[Survived] StringLiteral
src/cli.ts:82:16
 
 program
   .name("claudikins")
-  .description("CLI for @claudikins/tool-executor")
+  .description("")
   .version(packageJson.version);
 

[Survived] StringLiteral
src/cli.ts:87:16
 
 program
   .command("doctor")
-  .description("Check environment and dependencies")
+  .description("")
   .action(async () => {
     console.log("🔍 Checking environment...\n");

[Survived] StringLiteral
src/cli.ts:140:12
   });
 
 program
-  .command("extract")
+  .command("")
   .description("Extract tool schemas from MCP servers into registry")
   .option("-a, --all", "Extract from all configured servers")

[Survived] StringLiteral
src/cli.ts:142:24
 program
   .command("extract")
   .description("Extract tool schemas from MCP servers into registry")
-  .option("-a, --all", "Extract from all configured servers")
+  .option("-a, --all", "")
   .action(async (options: { all?: boolean }) => {
     if (!options.all) {

[Survived] ConditionalExpression
src/cli.ts:170:5
     }
   });
 
-if (process.argv[1] === fileURLToPath(import.meta.url)) {
+if (false) {
   program.parse();
 }

[Survived] EqualityOperator
src/cli.ts:170:5
     }
   });
 
-if (process.argv[1] === fileURLToPath(import.meta.url)) {
+if (process.argv[1] !== fileURLToPath(import.meta.url)) {
   program.parse();
 }
