[Killed] EqualityOperator
src/sandbox/runtime.ts:44:11
 function createClientProxy(name: string): ClientProxy {
   return new Proxy({} as ClientProxy, {
     get(_, toolName) {
-      if (toolName === "then") {
+      if (toolName !== "then") {
         return undefined;
       }
killedBy: sandbox runtime client bindings calls MCP tools through client proxies and logs audit entries
statusReason: expected 'clients.code-nav.lookup is not a func…' to be undefined

[Killed] ConditionalExpression
src/sandbox/runtime.ts:44:11
 function createClientProxy(name: string): ClientProxy {
   return new Proxy({} as ClientProxy, {
     get(_, toolName) {
-      if (toolName === "then") {
+      if (true) {
         return undefined;
       }
killedBy: sandbox runtime client bindings calls MCP tools through client proxies and logs audit entries
statusReason: expected 'clients.code-nav.lookup is not a func…' to be undefined

[Killed] EqualityOperator
src/sandbox/runtime.ts:48:11
         return undefined;
       }
 
-      if (typeof toolName !== "string") {
+      if (typeof toolName === "string") {
         return undefined;
       }
killedBy: sandbox runtime client bindings calls MCP tools through client proxies and logs audit entries
statusReason: expected 'clients.code-nav.lookup is not a func…' to be undefined

[Killed] EqualityOperator
src/sandbox/runtime.ts:72:15
 
           // Check response size
           const serialised = JSON.stringify(result);
-          if (serialised.length > MAX_LOG_ENTRY_CHARS) {
+          if (serialised.length <= MAX_LOG_ENTRY_CHARS) {
             // Auto-save large responses to workspace
             const filename = `${Date.now()}-${name}-${toolName}.json`;
killedBy: sandbox runtime client bindings calls MCP tools through client proxies and logs audit entries
statusReason: expected [ { returned: { …(4) } } ] to deep equally contain { returned: { ok: true } }

[Killed] StringLiteral
src/sandbox/runtime.ts:175:43
   "eval",
 ]);
 
-const RESERVED_GLOBAL_BINDINGS = new Set(["console", "workspace", "clients", "globalThis"]);
+const RESERVED_GLOBAL_BINDINGS = new Set(["", "workspace", "clients", "globalThis"]);
 
 function toGlobalIdentifier(name: string, usedIdentifiers: Set<string>): string {
killedBy: sandbox runtime client bindings auto-saves large MCP responses to workspace
statusReason: promise rejected "Error: ENOENT: no such file or directory,… { …(4) }" instead of resolving

[Killed] BooleanLiteral
src/sandbox/runtime.ts:242:9
     const proxy = createClientProxy(config.name);
     clients[config.name] = proxy;
     const identifier = bindingMap.get(config.name) || toSandboxIdentifier(config.name);
-    if (!Object.prototype.hasOwnProperty.call(globals, identifier)) {
+    if (Object.prototype.hasOwnProperty.call(globals, identifier)) {
       globals[identifier] = proxy;
     }
killedBy: sandbox runtime client bindings reports unavailable MCP clients as execution errors
statusReason: expected 'code_nav is not defined' to be 'code-nav MCP is not available' // Object.is equality
