[Survived] ObjectLiteral
src/config.ts:9:44
 // Resolve config relative to module location (not cwd) for plugin portability
 const __dirname = dirname(fileURLToPath(import.meta.url));
 
-export const ServerConfigSchema = z.object({
-  name: z.string().min(1),
-  displayName: z.string().min(1),
-  command: z.string().min(1),
-  trusted: z.boolean().optional(),
-  args: z.array(z.string()),
-  env: z.record(z.string(), z.string()).optional(),
-});
+export const ServerConfigSchema = z.object({});
 
 export const ToolExecutorConfigSchema = z.object({

[Survived] MethodExpression
src/config.ts:10:9
 const __dirname = dirname(fileURLToPath(import.meta.url));
 
 export const ServerConfigSchema = z.object({
-  name: z.string().min(1),
+  name: z.string().max(1),
   displayName: z.string().min(1),
   command: z.string().min(1),

[Survived] MethodExpression
src/config.ts:11:16
 
 export const ServerConfigSchema = z.object({
   name: z.string().min(1),
-  displayName: z.string().min(1),
+  displayName: z.string().max(1),
   command: z.string().min(1),
   trusted: z.boolean().optional(),

[Killed] MethodExpression
src/config.ts:12:12
 export const ServerConfigSchema = z.object({
   name: z.string().min(1),
   displayName: z.string().min(1),
-  command: z.string().min(1),
+  command: z.string().max(1),
   trusted: z.boolean().optional(),
   args: z.array(z.string()),
killedBy: sandbox runtime client bindings auto-saves large MCP responses to workspace
statusReason: .toMatch() expects to receive a string, but got undefined

[Survived] ObjectLiteral
src/config.ts:18:50
   env: z.record(z.string(), z.string()).optional(),
 });
 
-export const ToolExecutorConfigSchema = z.object({
-  $schema: z.string().optional(),
-  servers: z.array(ServerConfigSchema).min(1),
-}).strict();
+export const ToolExecutorConfigSchema = z.object({}).strict();
 
 export type ToolExecutorConfig = z.infer<typeof ToolExecutorConfigSchema>;

[Survived] MethodExpression
src/config.ts:20:12
 
 export const ToolExecutorConfigSchema = z.object({
   $schema: z.string().optional(),
-  servers: z.array(ServerConfigSchema).min(1),
+  servers: z.array(ServerConfigSchema).max(1),
 }).strict();
 

[Survived] StringLiteral
src/config.ts:29:3
 const CONFIG_FILENAMES = [
   "tool-executor.config.json",
   "tool-executor.config.js",
-  ".tool-executorrc.json",
+  "",
 ];
 
