[Killed] ArithmeticOperator
src/sandbox/clients.ts:10:22
   envKeys?: string[];
 };
 
-const IDLE_TIMEOUT = 3 * 60 * 1000; // 3 minutes
+const IDLE_TIMEOUT = 3 * 60 / 1000; // 3 minutes
 
 /**
killedBy: sandbox clients cleans up idle clients and keeps bounded audit history
statusReason: expected "vi.fn()" to be called +0 times, but got 1 times

[Killed] ArithmeticOperator
src/sandbox/clients.ts:10:22
   envKeys?: string[];
 };
 
-const IDLE_TIMEOUT = 3 * 60 * 1000; // 3 minutes
+const IDLE_TIMEOUT = 3 / 60 * 1000; // 3 minutes
 
 /**
killedBy: sandbox clients cleans up idle clients and keeps bounded audit history
statusReason: expected "vi.fn()" to be called +0 times, but got 1 times

[Killed] StringLiteral
src/sandbox/clients.ts:19:61
  */
 const DEFAULT_CONFIGS: DefaultServerConfig[] = [
   // NPX servers (Node.js)
-  { name: "notebooklm", displayName: "NotebookLM", command: "npx", args: ["-y", "notebooklm-mcp"] },
+  { name: "notebooklm", displayName: "NotebookLM", command: "", args: ["-y", "notebooklm-mcp"] },
   { name: "sequentialThinking", displayName: "Sequential Thinking", command: "npx", args: ["-y", "@modelcontextprotocol/server-sequential-thinking"] },
   { name: "context7", displayName: "Context7", command: "npx", args: ["-y", "@upstash/context7-mcp"] },
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { …(5) }, …(6) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] ArrayDeclaration
src/sandbox/clients.ts:19:74
  */
 const DEFAULT_CONFIGS: DefaultServerConfig[] = [
   // NPX servers (Node.js)
-  { name: "notebooklm", displayName: "NotebookLM", command: "npx", args: ["-y", "notebooklm-mcp"] },
+  { name: "notebooklm", displayName: "NotebookLM", command: "npx", args: [] },
   { name: "sequentialThinking", displayName: "Sequential Thinking", command: "npx", args: ["-y", "@modelcontextprotocol/server-sequential-thinking"] },
   { name: "context7", displayName: "Context7", command: "npx", args: ["-y", "@upstash/context7-mcp"] },
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] ArrayDeclaration
src/sandbox/clients.ts:20:91
 const DEFAULT_CONFIGS: DefaultServerConfig[] = [
   // NPX servers (Node.js)
   { name: "notebooklm", displayName: "NotebookLM", command: "npx", args: ["-y", "notebooklm-mcp"] },
-  { name: "sequentialThinking", displayName: "Sequential Thinking", command: "npx", args: ["-y", "@modelcontextprotocol/server-sequential-thinking"] },
+  { name: "sequentialThinking", displayName: "Sequential Thinking", command: "npx", args: [] },
   { name: "context7", displayName: "Context7", command: "npx", args: ["-y", "@upstash/context7-mcp"] },
   { name: "gemini", displayName: "Gemini", command: "npx", args: ["-y", "@rlabs-inc/gemini-mcp"], envKeys: ["GEMINI_API_KEY"] },
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] StringLiteral
src/sandbox/clients.ts:21:57
   // NPX servers (Node.js)
   { name: "notebooklm", displayName: "NotebookLM", command: "npx", args: ["-y", "notebooklm-mcp"] },
   { name: "sequentialThinking", displayName: "Sequential Thinking", command: "npx", args: ["-y", "@modelcontextprotocol/server-sequential-thinking"] },
-  { name: "context7", displayName: "Context7", command: "npx", args: ["-y", "@upstash/context7-mcp"] },
+  { name: "context7", displayName: "Context7", command: "", args: ["-y", "@upstash/context7-mcp"] },
   { name: "gemini", displayName: "Gemini", command: "npx", args: ["-y", "@rlabs-inc/gemini-mcp"], envKeys: ["GEMINI_API_KEY"] },
   { name: "shadcn", displayName: "shadcn", command: "npx", args: ["-y", "shadcn-ui-mcp-server"] },
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(6) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] ArrayDeclaration
src/sandbox/clients.ts:21:70
   // NPX servers (Node.js)
   { name: "notebooklm", displayName: "NotebookLM", command: "npx", args: ["-y", "notebooklm-mcp"] },
   { name: "sequentialThinking", displayName: "Sequential Thinking", command: "npx", args: ["-y", "@modelcontextprotocol/server-sequential-thinking"] },
-  { name: "context7", displayName: "Context7", command: "npx", args: ["-y", "@upstash/context7-mcp"] },
+  { name: "context7", displayName: "Context7", command: "npx", args: [] },
   { name: "gemini", displayName: "Gemini", command: "npx", args: ["-y", "@rlabs-inc/gemini-mcp"], envKeys: ["GEMINI_API_KEY"] },
   { name: "shadcn", displayName: "shadcn", command: "npx", args: ["-y", "shadcn-ui-mcp-server"] },
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] StringLiteral
src/sandbox/clients.ts:22:73
   { name: "notebooklm", displayName: "NotebookLM", command: "npx", args: ["-y", "notebooklm-mcp"] },
   { name: "sequentialThinking", displayName: "Sequential Thinking", command: "npx", args: ["-y", "@modelcontextprotocol/server-sequential-thinking"] },
   { name: "context7", displayName: "Context7", command: "npx", args: ["-y", "@upstash/context7-mcp"] },
-  { name: "gemini", displayName: "Gemini", command: "npx", args: ["-y", "@rlabs-inc/gemini-mcp"], envKeys: ["GEMINI_API_KEY"] },
+  { name: "gemini", displayName: "Gemini", command: "npx", args: ["-y", ""], envKeys: ["GEMINI_API_KEY"] },
   { name: "shadcn", displayName: "shadcn", command: "npx", args: ["-y", "shadcn-ui-mcp-server"] },
   { name: "apify", displayName: "Apify", command: "npx", args: ["-y", "@apify/actors-mcp-server"], envKeys: ["APIFY_TOKEN"] },
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] StringLiteral
src/sandbox/clients.ts:22:109
   { name: "notebooklm", displayName: "NotebookLM", command: "npx", args: ["-y", "notebooklm-mcp"] },
   { name: "sequentialThinking", displayName: "Sequential Thinking", command: "npx", args: ["-y", "@modelcontextprotocol/server-sequential-thinking"] },
   { name: "context7", displayName: "Context7", command: "npx", args: ["-y", "@upstash/context7-mcp"] },
-  { name: "gemini", displayName: "Gemini", command: "npx", args: ["-y", "@rlabs-inc/gemini-mcp"], envKeys: ["GEMINI_API_KEY"] },
+  { name: "gemini", displayName: "Gemini", command: "npx", args: ["-y", "@rlabs-inc/gemini-mcp"], envKeys: [""] },
   { name: "shadcn", displayName: "shadcn", command: "npx", args: ["-y", "shadcn-ui-mcp-server"] },
   { name: "apify", displayName: "Apify", command: "npx", args: ["-y", "@apify/actors-mcp-server"], envKeys: ["APIFY_TOKEN"] },
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] ObjectLiteral
src/sandbox/clients.ts:23:3
   { name: "sequentialThinking", displayName: "Sequential Thinking", command: "npx", args: ["-y", "@modelcontextprotocol/server-sequential-thinking"] },
   { name: "context7", displayName: "Context7", command: "npx", args: ["-y", "@upstash/context7-mcp"] },
   { name: "gemini", displayName: "Gemini", command: "npx", args: ["-y", "@rlabs-inc/gemini-mcp"], envKeys: ["GEMINI_API_KEY"] },
-  { name: "shadcn", displayName: "shadcn", command: "npx", args: ["-y", "shadcn-ui-mcp-server"] },
+  {},
   { name: "apify", displayName: "Apify", command: "npx", args: ["-y", "@apify/actors-mcp-server"], envKeys: ["APIFY_TOKEN"] },
   // Local binaries
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(6) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] StringLiteral
src/sandbox/clients.ts:23:73
   { name: "sequentialThinking", displayName: "Sequential Thinking", command: "npx", args: ["-y", "@modelcontextprotocol/server-sequential-thinking"] },
   { name: "context7", displayName: "Context7", command: "npx", args: ["-y", "@upstash/context7-mcp"] },
   { name: "gemini", displayName: "Gemini", command: "npx", args: ["-y", "@rlabs-inc/gemini-mcp"], envKeys: ["GEMINI_API_KEY"] },
-  { name: "shadcn", displayName: "shadcn", command: "npx", args: ["-y", "shadcn-ui-mcp-server"] },
+  { name: "shadcn", displayName: "shadcn", command: "npx", args: ["-y", ""] },
   { name: "apify", displayName: "Apify", command: "npx", args: ["-y", "@apify/actors-mcp-server"], envKeys: ["APIFY_TOKEN"] },
   // Local binaries
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] StringLiteral
src/sandbox/clients.ts:24:65
   { name: "context7", displayName: "Context7", command: "npx", args: ["-y", "@upstash/context7-mcp"] },
   { name: "gemini", displayName: "Gemini", command: "npx", args: ["-y", "@rlabs-inc/gemini-mcp"], envKeys: ["GEMINI_API_KEY"] },
   { name: "shadcn", displayName: "shadcn", command: "npx", args: ["-y", "shadcn-ui-mcp-server"] },
-  { name: "apify", displayName: "Apify", command: "npx", args: ["-y", "@apify/actors-mcp-server"], envKeys: ["APIFY_TOKEN"] },
+  { name: "apify", displayName: "Apify", command: "npx", args: ["", "@apify/actors-mcp-server"], envKeys: ["APIFY_TOKEN"] },
   // Local binaries
   { name: "codebase-memory", displayName: "Codebase Memory", command: "codebase-memory-mcp", trusted: true, commandEnvKey: "CODEBASE_MEMORY_MCP_BIN", args: [] },
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] StringLiteral
src/sandbox/clients.ts:24:33
   { name: "context7", displayName: "Context7", command: "npx", args: ["-y", "@upstash/context7-mcp"] },
   { name: "gemini", displayName: "Gemini", command: "npx", args: ["-y", "@rlabs-inc/gemini-mcp"], envKeys: ["GEMINI_API_KEY"] },
   { name: "shadcn", displayName: "shadcn", command: "npx", args: ["-y", "shadcn-ui-mcp-server"] },
-  { name: "apify", displayName: "Apify", command: "npx", args: ["-y", "@apify/actors-mcp-server"], envKeys: ["APIFY_TOKEN"] },
+  { name: "apify", displayName: "", command: "npx", args: ["-y", "@apify/actors-mcp-server"], envKeys: ["APIFY_TOKEN"] },
   // Local binaries
   { name: "codebase-memory", displayName: "Codebase Memory", command: "codebase-memory-mcp", trusted: true, commandEnvKey: "CODEBASE_MEMORY_MCP_BIN", args: [] },
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] BooleanLiteral
src/sandbox/clients.ts:26:103
   { name: "shadcn", displayName: "shadcn", command: "npx", args: ["-y", "shadcn-ui-mcp-server"] },
   { name: "apify", displayName: "Apify", command: "npx", args: ["-y", "@apify/actors-mcp-server"], envKeys: ["APIFY_TOKEN"] },
   // Local binaries
-  { name: "codebase-memory", displayName: "Codebase Memory", command: "codebase-memory-mcp", trusted: true, commandEnvKey: "CODEBASE_MEMORY_MCP_BIN", args: [] },
+  { name: "codebase-memory", displayName: "Codebase Memory", command: "codebase-memory-mcp", trusted: false, commandEnvKey: "CODEBASE_MEMORY_MCP_BIN", args: [] },
   // UVX servers (Python)
   { name: "serena", displayName: "Serena", command: "uvx", args: ["--from", "git+https://github.com/oraios/serena", "serena", "start-mcp-server"] },
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(6) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] StringLiteral
src/sandbox/clients.ts:26:43
   { name: "shadcn", displayName: "shadcn", command: "npx", args: ["-y", "shadcn-ui-mcp-server"] },
   { name: "apify", displayName: "Apify", command: "npx", args: ["-y", "@apify/actors-mcp-server"], envKeys: ["APIFY_TOKEN"] },
   // Local binaries
-  { name: "codebase-memory", displayName: "Codebase Memory", command: "codebase-memory-mcp", trusted: true, commandEnvKey: "CODEBASE_MEMORY_MCP_BIN", args: [] },
+  { name: "codebase-memory", displayName: "", command: "codebase-memory-mcp", trusted: true, commandEnvKey: "CODEBASE_MEMORY_MCP_BIN", args: [] },
   // UVX servers (Python)
   { name: "serena", displayName: "Serena", command: "uvx", args: ["--from", "git+https://github.com/oraios/serena", "serena", "start-mcp-server"] },
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] StringLiteral
src/sandbox/clients.ts:28:127
   // Local binaries
   { name: "codebase-memory", displayName: "Codebase Memory", command: "codebase-memory-mcp", trusted: true, commandEnvKey: "CODEBASE_MEMORY_MCP_BIN", args: [] },
   // UVX servers (Python)
-  { name: "serena", displayName: "Serena", command: "uvx", args: ["--from", "git+https://github.com/oraios/serena", "serena", "start-mcp-server"] },
+  { name: "serena", displayName: "Serena", command: "uvx", args: ["--from", "git+https://github.com/oraios/serena", "serena", ""] },
 ];
 
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] StringLiteral
src/sandbox/clients.ts:28:53
   // Local binaries
   { name: "codebase-memory", displayName: "Codebase Memory", command: "codebase-memory-mcp", trusted: true, commandEnvKey: "CODEBASE_MEMORY_MCP_BIN", args: [] },
   // UVX servers (Python)
-  { name: "serena", displayName: "Serena", command: "uvx", args: ["--from", "git+https://github.com/oraios/serena", "serena", "start-mcp-server"] },
+  { name: "serena", displayName: "Serena", command: "", args: ["--from", "git+https://github.com/oraios/serena", "serena", "start-mcp-server"] },
 ];
 
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(6) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] StringLiteral
src/sandbox/clients.ts:31:53
   { name: "serena", displayName: "Serena", command: "uvx", args: ["--from", "git+https://github.com/oraios/serena", "serena", "start-mcp-server"] },
 ];
 
-const SAFE_SERVER_COMMANDS = new Set(["npx", "uvx", "node", "python", "codebase-memory-mcp"]);
+const SAFE_SERVER_COMMANDS = new Set(["npx", "uvx", "", "python", "codebase-memory-mcp"]);
 
 /**
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: Cannot read properties of undefined (reading 'instance')

[Killed] StringLiteral
src/sandbox/clients.ts:31:39
   { name: "serena", displayName: "Serena", command: "uvx", args: ["--from", "git+https://github.com/oraios/serena", "serena", "start-mcp-server"] },
 ];
 
-const SAFE_SERVER_COMMANDS = new Set(["npx", "uvx", "node", "python", "codebase-memory-mcp"]);
+const SAFE_SERVER_COMMANDS = new Set(["", "uvx", "node", "python", "codebase-memory-mcp"]);
 
 /**
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [ 'trusted', 'override' ] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] BlockStatement
src/sandbox/clients.ts:36:55
 /**
  * Resolve optional command env override at runtime (after dotenv loads)
  */
-function resolveCommand(config: ServerConfig): string {
-  if (!config.commandEnvKey) return config.command;
-  return process.env[config.commandEnvKey] || config.command;
-}
+function resolveCommand(config: ServerConfig): string {}
 
 /**
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [ 'trusted', 'override' ] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] BooleanLiteral
src/sandbox/clients.ts:37:7
  * Resolve optional command env override at runtime (after dotenv loads)
  */
 function resolveCommand(config: ServerConfig): string {
-  if (!config.commandEnvKey) return config.command;
+  if (config.commandEnvKey) return config.command;
   return process.env[config.commandEnvKey] || config.command;
 }
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected { name: 'override', …(4) } to match object { name: 'override', …(2) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/sandbox/clients.ts:37:7
  * Resolve optional command env override at runtime (after dotenv loads)
  */
 function resolveCommand(config: ServerConfig): string {
-  if (!config.commandEnvKey) return config.command;
+  if (true) return config.command;
   return process.env[config.commandEnvKey] || config.command;
 }
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected { name: 'override', …(4) } to match object { name: 'override', …(2) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/sandbox/clients.ts:38:10
  */
 function resolveCommand(config: ServerConfig): string {
   if (!config.commandEnvKey) return config.command;
-  return process.env[config.commandEnvKey] || config.command;
+  return false;
 }
 
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected { name: 'override', …(4) } to match object { name: 'override', …(2) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/sandbox/clients.ts:38:10
  */
 function resolveCommand(config: ServerConfig): string {
   if (!config.commandEnvKey) return config.command;
-  return process.env[config.commandEnvKey] || config.command;
+  return process.env[config.commandEnvKey] && config.command;
 }
 
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected { name: 'override', …(4) } to match object { name: 'override', …(2) }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/sandbox/clients.ts:44:81
 /**
  * Resolve envKeys to actual env values at runtime (after dotenv loads)
  */
-function resolveEnvKeys(envKeys?: string[]): Record<string, string> | undefined {
-  if (!envKeys || envKeys.length === 0) return undefined;
-
-  return envKeys.reduce<Record<string, string>>((acc, key) => {
-    acc[key] = process.env[key] || "";
-    return acc;
-  }, {});
-}
+function resolveEnvKeys(envKeys?: string[]): Record<string, string> | undefined {}
 
 /**
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] BooleanLiteral
src/sandbox/clients.ts:45:7
  * Resolve envKeys to actual env values at runtime (after dotenv loads)
  */
 function resolveEnvKeys(envKeys?: string[]): Record<string, string> | undefined {
-  if (!envKeys || envKeys.length === 0) return undefined;
+  if (envKeys || envKeys.length === 0) return undefined;
 
   return envKeys.reduce<Record<string, string>>((acc, key) => {
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/sandbox/clients.ts:45:7
  * Resolve envKeys to actual env values at runtime (after dotenv loads)
  */
 function resolveEnvKeys(envKeys?: string[]): Record<string, string> | undefined {
-  if (!envKeys || envKeys.length === 0) return undefined;
+  if (true) return undefined;
 
   return envKeys.reduce<Record<string, string>>((acc, key) => {
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] BlockStatement
src/sandbox/clients.ts:47:63
 function resolveEnvKeys(envKeys?: string[]): Record<string, string> | undefined {
   if (!envKeys || envKeys.length === 0) return undefined;
 
-  return envKeys.reduce<Record<string, string>>((acc, key) => {
-    acc[key] = process.env[key] || "";
-    return acc;
-  }, {});
+  return envKeys.reduce<Record<string, string>>((acc, key) => {}, {});
 }
 
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] LogicalOperator
src/sandbox/clients.ts:48:16
   if (!envKeys || envKeys.length === 0) return undefined;
 
   return envKeys.reduce<Record<string, string>>((acc, key) => {
-    acc[key] = process.env[key] || "";
+    acc[key] = process.env[key] && "";
     return acc;
   }, {});
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] ConditionalExpression
src/sandbox/clients.ts:48:16
   if (!envKeys || envKeys.length === 0) return undefined;
 
   return envKeys.reduce<Record<string, string>>((acc, key) => {
-    acc[key] = process.env[key] || "";
+    acc[key] = true;
     return acc;
   }, {});
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ { name: 'notebooklm', …(4) }, …(7) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] BlockStatement
src/sandbox/clients.ts:56:55
 /**
  * Validate server commands to avoid accidental command injection from config
  */
-function isSafeCommand(config: ServerConfig): boolean {
-  const command = config.command;
-  if (command === "") return false;
-  if (SAFE_SERVER_COMMANDS.has(command)) return true;
-  return Boolean(config.trusted);
-}
+function isSafeCommand(config: ServerConfig): boolean {}
 
 function normalizeServerConfig<T extends ServerConfig>(config: T): T {
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] BooleanLiteral
src/sandbox/clients.ts:58:30
  */
 function isSafeCommand(config: ServerConfig): boolean {
   const command = config.command;
-  if (command === "") return false;
+  if (command === "") return true;
   if (SAFE_SERVER_COMMANDS.has(command)) return true;
   return Boolean(config.trusted);
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [ 'safe', 'empty', 'trusted', …(1) ] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] ConditionalExpression
src/sandbox/clients.ts:58:7
  */
 function isSafeCommand(config: ServerConfig): boolean {
   const command = config.command;
-  if (command === "") return false;
+  if (true) return false;
   if (SAFE_SERVER_COMMANDS.has(command)) return true;
   return Boolean(config.trusted);
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] ConditionalExpression
src/sandbox/clients.ts:59:7
 function isSafeCommand(config: ServerConfig): boolean {
   const command = config.command;
   if (command === "") return false;
-  if (SAFE_SERVER_COMMANDS.has(command)) return true;
+  if (false) return true;
   return Boolean(config.trusted);
 }
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [ 'trusted', 'override' ] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] ConditionalExpression
src/sandbox/clients.ts:59:7
 function isSafeCommand(config: ServerConfig): boolean {
   const command = config.command;
   if (command === "") return false;
-  if (SAFE_SERVER_COMMANDS.has(command)) return true;
+  if (true) return true;
   return Boolean(config.trusted);
 }
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [ 'safe', 'unsafe', 'trusted', …(1) ] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] BlockStatement
src/sandbox/clients.ts:63:70
   return Boolean(config.trusted);
 }
 
-function normalizeServerConfig<T extends ServerConfig>(config: T): T {
-  return {
-    ...config,
-    command: resolveCommand(config),
-  };
-}
+function normalizeServerConfig<T extends ServerConfig>(config: T): T {}
 
 /**
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: Cannot read properties of undefined (reading 'command')

[Killed] ObjectLiteral
src/sandbox/clients.ts:64:10
 }
 
 function normalizeServerConfig<T extends ServerConfig>(config: T): T {
-  return {
-    ...config,
-    command: resolveCommand(config),
-  };
+  return {};
 }
 
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] ConditionalExpression
src/sandbox/clients.ts:75:7
  */
 function loadServerConfigs(): ServerConfig[] {
   const config = loadConfig();
-  if (config) {
+  if (false) {
     console.error(`Loaded config with ${config.servers.length} servers`);
     return config.servers
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [ 'notebooklm', …(7) ] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] BlockStatement
src/sandbox/clients.ts:75:15
  */
 function loadServerConfigs(): ServerConfig[] {
   const config = loadConfig();
-  if (config) {
-    console.error(`Loaded config with ${config.servers.length} servers`);
-    return config.servers
-      .map(normalizeServerConfig)
-      .filter((server) => {
-        if (isSafeCommand(server)) {
-          return true;
-        }
-        console.error(`Ignoring server "${server.name}" because command "${server.command}" is not in the safe command set. Set "trusted: true" to allow explicit command use.`);
-        return false;
-      })
-      .map(s => ({
-        name: s.name,
-        displayName: s.displayName,
-        command: s.command,
-        args: s.args,
-        env: s.env,
-      }));
-  }
+  if (config) {}
 
   console.error("No config file found, using default servers");
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [ 'notebooklm', …(7) ] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] StringLiteral
src/sandbox/clients.ts:76:19
 function loadServerConfigs(): ServerConfig[] {
   const config = loadConfig();
   if (config) {
-    console.error(`Loaded config with ${config.servers.length} servers`);
+    console.error(``);
     return config.servers
       .map(normalizeServerConfig)
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected "error" to be called with arguments: [ 'Loaded config with 5 servers' ]

Received:

  1st error call:

  [
-   "Loaded config with 5 servers",

[Killed] MethodExpression
src/sandbox/clients.ts:77:12
   const config = loadConfig();
   if (config) {
     console.error(`Loaded config with ${config.servers.length} servers`);
-    return config.servers
-      .map(normalizeServerConfig)
-      .filter((server) => {
-        if (isSafeCommand(server)) {
-          return true;
-        }
-        console.error(`Ignoring server "${server.name}" because command "${server.command}" is not in the safe command set. Set "trusted: true" to allow explicit command use.`);
-        return false;
-      })
+    return config.servers.map(normalizeServerConfig)
       .map(s => ({
         name: s.name,
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [ 'safe', 'empty', 'unsafe', …(2) ] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] BlockStatement
src/sandbox/clients.ts:79:27
     console.error(`Loaded config with ${config.servers.length} servers`);
     return config.servers
       .map(normalizeServerConfig)
-      .filter((server) => {
-        if (isSafeCommand(server)) {
-          return true;
-        }
-        console.error(`Ignoring server "${server.name}" because command "${server.command}" is not in the safe command set. Set "trusted: true" to allow explicit command use.`);
-        return false;
-      })
+      .filter((server) => {})
       .map(s => ({
         name: s.name,
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [] to deeply equal [ 'safe', 'trusted', 'override' ]
