[Killed] ConditionalExpression
src/sandbox/clients.ts:80:13
     return config.servers
       .map(normalizeServerConfig)
       .filter((server) => {
-        if (isSafeCommand(server)) {
+        if (true) {
           return true;
         }
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [ 'safe', 'empty', 'unsafe', …(2) ] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] ConditionalExpression
src/sandbox/clients.ts:80:13
     return config.servers
       .map(normalizeServerConfig)
       .filter((server) => {
-        if (isSafeCommand(server)) {
+        if (false) {
           return true;
         }
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] BooleanLiteral
src/sandbox/clients.ts:81:18
       .map(normalizeServerConfig)
       .filter((server) => {
         if (isSafeCommand(server)) {
-          return true;
+          return false;
         }
         console.error(`Ignoring server "${server.name}" because command "${server.command}" is not in the safe command set. Set "trusted: true" to allow explicit command use.`);
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] BooleanLiteral
src/sandbox/clients.ts:84:16
           return true;
         }
         console.error(`Ignoring server "${server.name}" because command "${server.command}" is not in the safe command set. Set "trusted: true" to allow explicit command use.`);
-        return false;
+        return true;
       })
       .map(s => ({
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [ 'safe', 'empty', 'unsafe', …(2) ] to deeply equal [ 'safe', 'trusted', 'override' ]

[Killed] ArrowFunction
src/sandbox/clients.ts:86:12
         console.error(`Ignoring server "${server.name}" because command "${server.command}" is not in the safe command set. Set "trusted: true" to allow explicit command use.`);
         return false;
       })
-      .map(s => ({
-        name: s.name,
-        displayName: s.displayName,
-        command: s.command,
-        args: s.args,
-        env: s.env,
-      }));
+      .map(() => undefined);
   }
 
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] StringLiteral
src/sandbox/clients.ts:95:17
       }));
   }
 
-  console.error("No config file found, using default servers");
+  console.error("");
   // Resolve envKeys to env at runtime (dotenv should be loaded by now)
   return DEFAULT_CONFIGS.map(normalizeServerConfig).filter((server) => {
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected "error" to be called with arguments: [ Array(1) ]

Received:

  1st error call:

  [
-   "No config file found, using default servers",

[Killed] BlockStatement
src/sandbox/clients.ts:97:72
 
   console.error("No config file found, using default servers");
   // Resolve envKeys to env at runtime (dotenv should be loaded by now)
-  return DEFAULT_CONFIGS.map(normalizeServerConfig).filter((server) => {
-    if (isSafeCommand(server)) {
-      return true;
-    }
-    console.error(`Ignoring default server "${server.name}" because command "${server.command}" is not in the safe command set. Set "trusted: true" in DEFAULT_CONFIGS to allow explicit command use.`);
-    return false;
-  }).map(c => ({
+  return DEFAULT_CONFIGS.map(normalizeServerConfig).filter((server) => {}).map(c => ({
     name: c.name,
     displayName: c.displayName,
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Survived] MethodExpression
src/sandbox/clients.ts:97:10
 
   console.error("No config file found, using default servers");
   // Resolve envKeys to env at runtime (dotenv should be loaded by now)
-  return DEFAULT_CONFIGS.map(normalizeServerConfig).filter((server) => {
-    if (isSafeCommand(server)) {
-      return true;
-    }
-    console.error(`Ignoring default server "${server.name}" because command "${server.command}" is not in the safe command set. Set "trusted: true" in DEFAULT_CONFIGS to allow explicit command use.`);
-    return false;
-  }).map(c => ({
+  return DEFAULT_CONFIGS.map(normalizeServerConfig).map(c => ({
     name: c.name,
     displayName: c.displayName,

[Killed] BlockStatement
src/sandbox/clients.ts:98:32
   console.error("No config file found, using default servers");
   // Resolve envKeys to env at runtime (dotenv should be loaded by now)
   return DEFAULT_CONFIGS.map(normalizeServerConfig).filter((server) => {
-    if (isSafeCommand(server)) {
-      return true;
-    }
+    if (isSafeCommand(server)) {}
     console.error(`Ignoring default server "${server.name}" because command "${server.command}" is not in the safe command set. Set "trusted: true" in DEFAULT_CONFIGS to allow explicit command use.`);
     return false;
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] ConditionalExpression
src/sandbox/clients.ts:98:9
   console.error("No config file found, using default servers");
   // Resolve envKeys to env at runtime (dotenv should be loaded by now)
   return DEFAULT_CONFIGS.map(normalizeServerConfig).filter((server) => {
-    if (isSafeCommand(server)) {
+    if (false) {
       return true;
     }
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[NoCoverage] StringLiteral
src/sandbox/clients.ts:101:19
     if (isSafeCommand(server)) {
       return true;
     }
-    console.error(`Ignoring default server "${server.name}" because command "${server.command}" is not in the safe command set. Set "trusted: true" in DEFAULT_CONFIGS to allow explicit command use.`);
+    console.error(``);
     return false;
   }).map(c => ({

[NoCoverage] BooleanLiteral
src/sandbox/clients.ts:102:12
       return true;
     }
     console.error(`Ignoring default server "${server.name}" because command "${server.command}" is not in the safe command set. Set "trusted: true" in DEFAULT_CONFIGS to allow explicit command use.`);
-    return false;
+    return true;
   }).map(c => ({
     name: c.name,

[Killed] ArrowFunction
src/sandbox/clients.ts:103:10
     }
     console.error(`Ignoring default server "${server.name}" because command "${server.command}" is not in the safe command set. Set "trusted: true" in DEFAULT_CONFIGS to allow explicit command use.`);
     return false;
-  }).map(c => ({
-    name: c.name,
-    displayName: c.displayName,
-    command: c.command,
-    args: c.args,
-    env: resolveEnvKeys(c.envKeys),
-  }));
+  }).map(() => undefined);
 }
 
killedBy: sandbox clients falls back to default configs and resolves default env keys at runtime
statusReason: expected [ undefined, undefined, …(6) ] to deeply equal [ { name: 'notebooklm', …(4) }, …(7) ]

[Killed] BlockStatement
src/sandbox/clients.ts:117:52
  */
 let _serverConfigs: ServerConfig[] | null = null;
 
-export function getServerConfigs(): ServerConfig[] {
-  if (!_serverConfigs) {
-    _serverConfigs = loadServerConfigs();
-  }
-  return _serverConfigs;
-}
+export function getServerConfigs(): ServerConfig[] {}
 
 // For backwards compatibility - proxy that lazily loads configs
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/sandbox/clients.ts:118:7
 let _serverConfigs: ServerConfig[] | null = null;
 
 export function getServerConfigs(): ServerConfig[] {
-  if (!_serverConfigs) {
+  if (false) {
     _serverConfigs = loadServerConfigs();
   }
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: Cannot read properties of null (reading 'map')

[Killed] BooleanLiteral
src/sandbox/clients.ts:118:7
 let _serverConfigs: ServerConfig[] | null = null;
 
 export function getServerConfigs(): ServerConfig[] {
-  if (!_serverConfigs) {
+  if (_serverConfigs) {
     _serverConfigs = loadServerConfigs();
   }
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: Cannot read properties of null (reading 'map')

[Killed] ObjectLiteral
src/sandbox/clients.ts:125:63
 }
 
 // For backwards compatibility - proxy that lazily loads configs
-export const SERVER_CONFIGS = new Proxy([] as ServerConfig[], {
-  get(_, prop) {
-    const configs = getServerConfigs();
-    const value = (configs as any)[prop];
-    // Bind methods to the actual configs array
-    if (typeof value === "function") {
-      return value.bind(configs);
-    }
-    return value;
-  },
-});
+export const SERVER_CONFIGS = new Proxy([] as ServerConfig[], {});
 
 /**
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [] to deeply equal [ 'Safe', 'Trusted', 'Override' ]

[Killed] BlockStatement
src/sandbox/clients.ts:126:16
 
 // For backwards compatibility - proxy that lazily loads configs
 export const SERVER_CONFIGS = new Proxy([] as ServerConfig[], {
-  get(_, prop) {
-    const configs = getServerConfigs();
-    const value = (configs as any)[prop];
-    // Bind methods to the actual configs array
-    if (typeof value === "function") {
-      return value.bind(configs);
-    }
-    return value;
-  },
+  get(_, prop) {},
 });
 
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: SERVER_CONFIGS.map is not a function

[Killed] EqualityOperator
src/sandbox/clients.ts:130:9
     const configs = getServerConfigs();
     const value = (configs as any)[prop];
     // Bind methods to the actual configs array
-    if (typeof value === "function") {
+    if (typeof value !== "function") {
       return value.bind(configs);
     }
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: value.bind is not a function

[Killed] ConditionalExpression
src/sandbox/clients.ts:130:9
     const configs = getServerConfigs();
     const value = (configs as any)[prop];
     // Bind methods to the actual configs array
-    if (typeof value === "function") {
+    if (false) {
       return value.bind(configs);
     }
killedBy: sandbox clients loads explicit config, resolves command overrides, and filters unsafe commands
statusReason: expected [ undefined, undefined, undefined ] to deeply equal [ 'Safe', 'Trusted', 'Override' ]

[Killed] BlockStatement
src/sandbox/clients.ts:155:42
 /**
  * Initialize client states (all disconnected)
  */
-export function initClientStates(): void {
-  for (const config of SERVER_CONFIGS) {
-    clientStates.set(config.name, {
-      client: null,
-      lastUsed: 0,
-      connecting: false,
-    });
-  }
-}
+export function initClientStates(): void {}
 
 /**
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: Cannot read properties of undefined (reading 'instance')

[Killed] BlockStatement
src/sandbox/clients.ts:156:40
  * Initialize client states (all disconnected)
  */
 export function initClientStates(): void {
-  for (const config of SERVER_CONFIGS) {
-    clientStates.set(config.name, {
-      client: null,
-      lastUsed: 0,
-      connecting: false,
-    });
-  }
+  for (const config of SERVER_CONFIGS) {}
 }
 
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: Cannot read properties of undefined (reading 'instance')

[Survived] ObjectLiteral
src/sandbox/clients.ts:157:35
  */
 export function initClientStates(): void {
   for (const config of SERVER_CONFIGS) {
-    clientStates.set(config.name, {
-      client: null,
-      lastUsed: 0,
-      connecting: false,
-    });
+    clientStates.set(config.name, {});
   }
 }

[Survived] BooleanLiteral
src/sandbox/clients.ts:160:19
     clientStates.set(config.name, {
       client: null,
       lastUsed: 0,
-      connecting: false,
+      connecting: true,
     });
   }

[Killed] BooleanLiteral
src/sandbox/clients.ts:170:7
  */
 export async function getClient(name: string): Promise<Client | null> {
   const state = clientStates.get(name);
-  if (!state) {
+  if (state) {
     console.error(`Unknown client: ${name}`);
     return null;
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: Cannot read properties of undefined (reading 'instance')

[Killed] ConditionalExpression
src/sandbox/clients.ts:170:7
  */
 export async function getClient(name: string): Promise<Client | null> {
   const state = clientStates.get(name);
-  if (!state) {
+  if (false) {
     console.error(`Unknown client: ${name}`);
     return null;
killedBy: sandbox clients returns null for unknown or failed clients
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] StringLiteral
src/sandbox/clients.ts:171:19
 export async function getClient(name: string): Promise<Client | null> {
   const state = clientStates.get(name);
   if (!state) {
-    console.error(`Unknown client: ${name}`);
+    console.error(``);
     return null;
   }
killedBy: sandbox clients returns null for unknown or failed clients
statusReason: expected "error" to be called with arguments: [ 'Unknown client: missing' ]

Received:

  1st error call:

  [
-   "Unknown client: missing",

[Killed] ConditionalExpression
src/sandbox/clients.ts:176:7
   }
 
   // Already connected
-  if (state.client) {
+  if (false) {
     state.lastUsed = Date.now();
     return state.client;
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected { connect: [Function Mock], …(2) } to be { connect: [Function Mock], …(2) } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { connect: [Function Mock], …(2) }
Received: serializes to the same string

[Killed] BlockStatement
src/sandbox/clients.ts:176:21
   }
 
   // Already connected
-  if (state.client) {
-    state.lastUsed = Date.now();
-    return state.client;
-  }
+  if (state.client) {}
 
   // Connection already in progress - wait for it
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected { connect: [Function Mock], …(2) } to be { connect: [Function Mock], …(2) } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { connect: [Function Mock], …(2) }
Received: serializes to the same string

[Killed] ConditionalExpression
src/sandbox/clients.ts:183:7
 
   // Connection already in progress - wait for it
   const existingPromise = connectionPromises.get(name);
-  if (existingPromise) {
+  if (false) {
     return existingPromise;
   }
killedBy: sandbox clients deduplicates concurrent connection attempts
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/sandbox/clients.ts:183:24
 
   // Connection already in progress - wait for it
   const existingPromise = connectionPromises.get(name);
-  if (existingPromise) {
-    return existingPromise;
-  }
+  if (existingPromise) {}
 
   // Start new connection
killedBy: sandbox clients deduplicates concurrent connection attempts
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/sandbox/clients.ts:191:7
   const connectionPromise = connectClientInternal(name, state);
   connectionPromises.set(name, connectionPromise);
 
-  try {
-    return await connectionPromise;
-  } finally {
+  try {} finally {
     connectionPromises.delete(name);
   }
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected undefined to be { connect: [Function Mock], …(2) } // Object.is equality

[Killed] BlockStatement
src/sandbox/clients.ts:193:13
 
   try {
     return await connectionPromise;
-  } finally {
-    connectionPromises.delete(name);
-  }
+  } finally {}
 }
 
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected "error" to be called with arguments: [ 'Error disconnecting safe:', …(1) ]

Received:

  1st error call:

  [
-   "Error disconnecting safe:",

[Killed] BlockStatement
src/sandbox/clients.ts:201:96
 /**
  * Internal connection logic
  */
-async function connectClientInternal(name: string, state: ClientState): Promise<Client | null> {
-  const config = SERVER_CONFIGS.find((c) => c.name === name);
-  if (!config) {
-    return null;
-  }
-
-  try {
-    const client = new Client({ name: `claudikins-${name}`, version: "1.1.0" }, { capabilities: {} });
-    const transport = new StdioClientTransport({
-      command: config.command,
-      args: config.args,
-      env: { ...process.env, ...config.env } as Record<string, string>,
-    });
-
-    await client.connect(transport);
-
-    state.client = client;
-    state.lastUsed = Date.now();
-    console.error(`Connected: ${config.displayName}`);
-    return client;
-  } catch (error) {
-    console.error(`Failed to connect ${config.displayName}:`, error);
-    return null;
-  }
-}
+async function connectClientInternal(name: string, state: ClientState): Promise<Client | null> {}
 
 /**
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: Cannot read properties of undefined (reading 'instance')

[Killed] EqualityOperator
src/sandbox/clients.ts:202:45
  * Internal connection logic
  */
 async function connectClientInternal(name: string, state: ClientState): Promise<Client | null> {
-  const config = SERVER_CONFIGS.find((c) => c.name === name);
+  const config = SERVER_CONFIGS.find((c) => c.name !== name);
   if (!config) {
     return null;
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: Cannot read properties of undefined (reading 'instance')

[Killed] ArrowFunction
src/sandbox/clients.ts:202:38
  * Internal connection logic
  */
 async function connectClientInternal(name: string, state: ClientState): Promise<Client | null> {
-  const config = SERVER_CONFIGS.find((c) => c.name === name);
+  const config = SERVER_CONFIGS.find(() => undefined);
   if (!config) {
     return null;
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: Cannot read properties of undefined (reading 'instance')

[Killed] ConditionalExpression
src/sandbox/clients.ts:203:7
  */
 async function connectClientInternal(name: string, state: ClientState): Promise<Client | null> {
   const config = SERVER_CONFIGS.find((c) => c.name === name);
-  if (!config) {
+  if (true) {
     return null;
   }
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: Cannot read properties of undefined (reading 'instance')

[Killed] BooleanLiteral
src/sandbox/clients.ts:203:7
  */
 async function connectClientInternal(name: string, state: ClientState): Promise<Client | null> {
   const config = SERVER_CONFIGS.find((c) => c.name === name);
-  if (!config) {
+  if (config) {
     return null;
   }
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: Cannot read properties of undefined (reading 'instance')

[Killed] BlockStatement
src/sandbox/clients.ts:207:7
     return null;
   }
 
-  try {
-    const client = new Client({ name: `claudikins-${name}`, version: "1.1.0" }, { capabilities: {} });
-    const transport = new StdioClientTransport({
-      command: config.command,
-      args: config.args,
-      env: { ...process.env, ...config.env } as Record<string, string>,
-    });
-
-    await client.connect(transport);
-
-    state.client = client;
-    state.lastUsed = Date.now();
-    console.error(`Connected: ${config.displayName}`);
-    return client;
-  } catch (error) {
+  try {} catch (error) {
     console.error(`Failed to connect ${config.displayName}:`, error);
     return null;
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: Cannot read properties of undefined (reading 'instance')

[Killed] ObjectLiteral
src/sandbox/clients.ts:208:31
   }
 
   try {
-    const client = new Client({ name: `claudikins-${name}`, version: "1.1.0" }, { capabilities: {} });
+    const client = new Client({}, { capabilities: {} });
     const transport = new StdioClientTransport({
       command: config.command,
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BlockStatement
src/sandbox/clients.ts:221:19
     state.lastUsed = Date.now();
     console.error(`Connected: ${config.displayName}`);
     return client;
-  } catch (error) {
-    console.error(`Failed to connect ${config.displayName}:`, error);
-    return null;
-  }
+  } catch (error) {}
 }
 
killedBy: sandbox clients returns null for unknown or failed clients
statusReason: expected undefined to be null

[Killed] BlockStatement
src/sandbox/clients.ts:230:69
 /**
  * Disconnect a specific client
  */
-export async function disconnectClient(name: string): Promise<void> {
-  const state = clientStates.get(name);
-  if (!state?.client) return;
-
-  try {
-    await state.client.close();
-    console.error(`Disconnected: ${name}`);
-  } catch (error) {
-    console.error(`Error disconnecting ${name}:`, error);
-  }
-
-  state.client = null;
-  state.lastUsed = 0;
-}
+export async function disconnectClient(name: string): Promise<void> {}
 
 /**
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/sandbox/clients.ts:232:7
  */
 export async function disconnectClient(name: string): Promise<void> {
   const state = clientStates.get(name);
-  if (!state?.client) return;
+  if (state?.client) return;
 
   try {
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/sandbox/clients.ts:232:7
  */
 export async function disconnectClient(name: string): Promise<void> {
   const state = clientStates.get(name);
-  if (!state?.client) return;
+  if (true) return;
 
   try {
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/sandbox/clients.ts:234:7
   const state = clientStates.get(name);
   if (!state?.client) return;
 
-  try {
-    await state.client.close();
-    console.error(`Disconnected: ${name}`);
-  } catch (error) {
+  try {} catch (error) {
     console.error(`Error disconnecting ${name}:`, error);
   }
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/sandbox/clients.ts:237:19
   try {
     await state.client.close();
     console.error(`Disconnected: ${name}`);
-  } catch (error) {
-    console.error(`Error disconnecting ${name}:`, error);
-  }
+  } catch (error) {}
 
   state.client = null;
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected "error" to be called with arguments: [ 'Error disconnecting safe:', …(1) ]

Received:

  1st error call:

  [
-   "Error disconnecting safe:",

[Killed] BlockStatement
src/sandbox/clients.ts:248:54
 /**
  * Disconnect all clients
  */
-export async function disconnectAll(): Promise<void> {
-  const names = Array.from(clientStates.keys());
-  await Promise.all(names.map(disconnectClient));
-}
+export async function disconnectAll(): Promise<void> {}
 
 /**
killedBy: sandbox clients disconnects all connected clients
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/sandbox/clients.ts:256:59
 /**
  * Clean up idle clients (run periodically)
  */
-export async function cleanupIdleClients(): Promise<void> {
-  const now = Date.now();
-  for (const [name, state] of clientStates) {
-    if (state.client && now - state.lastUsed > IDLE_TIMEOUT) {
-      await disconnectClient(name);
-    }
-  }
-}
+export async function cleanupIdleClients(): Promise<void> {}
 
 /**
killedBy: sandbox clients cleans up idle clients and keeps bounded audit history
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/sandbox/clients.ts:258:45
  */
 export async function cleanupIdleClients(): Promise<void> {
   const now = Date.now();
-  for (const [name, state] of clientStates) {
-    if (state.client && now - state.lastUsed > IDLE_TIMEOUT) {
-      await disconnectClient(name);
-    }
-  }
+  for (const [name, state] of clientStates) {}
 }
 
killedBy: sandbox clients cleans up idle clients and keeps bounded audit history
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] LogicalOperator
src/sandbox/clients.ts:259:9
 export async function cleanupIdleClients(): Promise<void> {
   const now = Date.now();
   for (const [name, state] of clientStates) {
-    if (state.client && now - state.lastUsed > IDLE_TIMEOUT) {
+    if (state.client || now - state.lastUsed > IDLE_TIMEOUT) {
       await disconnectClient(name);
     }
killedBy: sandbox clients cleans up idle clients and keeps bounded audit history
statusReason: expected "vi.fn()" to be called +0 times, but got 1 times

[Killed] EqualityOperator
src/sandbox/clients.ts:259:25
 export async function cleanupIdleClients(): Promise<void> {
   const now = Date.now();
   for (const [name, state] of clientStates) {
-    if (state.client && now - state.lastUsed > IDLE_TIMEOUT) {
+    if (state.client && now - state.lastUsed <= IDLE_TIMEOUT) {
       await disconnectClient(name);
     }
killedBy: sandbox clients cleans up idle clients and keeps bounded audit history
statusReason: expected "vi.fn()" to be called +0 times, but got 1 times

[Killed] BlockStatement
src/sandbox/clients.ts:268:49
 /**
  * Get list of currently connected clients
  */
-export function getConnectedClients(): string[] {
-  const connected: string[] = [];
-  for (const [name, state] of clientStates) {
-    if (state.client) {
-      connected.push(name);
-    }
-  }
-  return connected;
-}
+export function getConnectedClients(): string[] {}
 
 /**
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected undefined to deeply equal [ 'safe' ]

[Killed] ArrayDeclaration
src/sandbox/clients.ts:269:31
  * Get list of currently connected clients
  */
 export function getConnectedClients(): string[] {
-  const connected: string[] = [];
+  const connected: string[] = ["Stryker was here"];
   for (const [name, state] of clientStates) {
     if (state.client) {
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected [ 'Stryker was here', 'safe' ] to deeply equal [ 'safe' ]

[Killed] BlockStatement
src/sandbox/clients.ts:270:45
  */
 export function getConnectedClients(): string[] {
   const connected: string[] = [];
-  for (const [name, state] of clientStates) {
-    if (state.client) {
-      connected.push(name);
-    }
-  }
+  for (const [name, state] of clientStates) {}
   return connected;
 }
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected [] to deeply equal [ 'safe' ]

[Killed] ConditionalExpression
src/sandbox/clients.ts:271:9
 export function getConnectedClients(): string[] {
   const connected: string[] = [];
   for (const [name, state] of clientStates) {
-    if (state.client) {
+    if (false) {
       connected.push(name);
     }
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected [] to deeply equal [ 'safe' ]

[Killed] ConditionalExpression
src/sandbox/clients.ts:271:9
 export function getConnectedClients(): string[] {
   const connected: string[] = [];
   for (const [name, state] of clientStates) {
-    if (state.client) {
+    if (true) {
       connected.push(name);
     }
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected [ 'safe' ] to deeply equal []

[Killed] BlockStatement
src/sandbox/clients.ts:281:49
 /**
  * Get list of all available clients (connected or not)
  */
-export function getAvailableClients(): string[] {
-  return SERVER_CONFIGS.map((c) => c.name);
-}
+export function getAvailableClients(): string[] {}
 
 /**
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected undefined to deeply equal [ 'safe' ]

[Killed] ArrowFunction
src/sandbox/clients.ts:282:29
  * Get list of all available clients (connected or not)
  */
 export function getAvailableClients(): string[] {
-  return SERVER_CONFIGS.map((c) => c.name);
+  return SERVER_CONFIGS.map(() => undefined);
 }
 
killedBy: sandbox clients connects, reuses, and disconnects clients
statusReason: expected [ undefined ] to deeply equal [ 'safe' ]
