[Survived] StringLiteral
src/search.ts:38:48
 
 // Absolute path to registry, relative to this module (not cwd)
 const __dirname = dirname(fileURLToPath(import.meta.url));
-const REGISTRY_ROOT = resolve(__dirname, "..", "registry");
+const REGISTRY_ROOT = resolve(__dirname, "..", "");
 
 /**
