[Killed] ConditionalExpression
src/bm25.ts:68:10
  * Check if BM25 engine is ready
  */
 export function isBM25Ready(): boolean {
-  return isInitialized && bm25Engine !== null;
+  return false;
 }
 
killedBy: bm25 tracks initialization state
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/bm25.ts:68:27
  * Check if BM25 engine is ready
  */
 export function isBM25Ready(): boolean {
-  return isInitialized && bm25Engine !== null;
+  return isInitialized && bm25Engine === null;
 }
 
killedBy: bm25 tracks initialization state
statusReason: expected false to be true // Object.is equality
