[Killed] BlockStatement
src/sandbox/clients.ts:288:56
 /**
  * Log an MCP call for auditing
  */
-export function logMcpCall(entry: AuditLogEntry): void {
-  auditLog.push(entry);
-
-  // Keep only last 1000 entries
-  if (auditLog.length > 1000) {
-    auditLog.shift();
-  }
-}
+export function logMcpCall(entry: AuditLogEntry): void {}
 
 /**
killedBy: sandbox clients cleans up idle clients and keeps bounded audit history
statusReason: expected [] to have a length of 1000 but got +0

[Killed] BlockStatement
src/sandbox/clients.ts:292:31
   auditLog.push(entry);
 
   // Keep only last 1000 entries
-  if (auditLog.length > 1000) {
-    auditLog.shift();
-  }
+  if (auditLog.length > 1000) {}
 }
 
killedBy: sandbox clients cleans up idle clients and keeps bounded audit history
statusReason: expected [ { timestamp: +0, …(3) }, …(1004) ] to have a length of 1000 but got 1005

[Killed] ConditionalExpression
src/sandbox/clients.ts:292:7
   auditLog.push(entry);
 
   // Keep only last 1000 entries
-  if (auditLog.length > 1000) {
+  if (false) {
     auditLog.shift();
   }
killedBy: sandbox clients cleans up idle clients and keeps bounded audit history
statusReason: expected [ { timestamp: +0, …(3) }, …(1004) ] to have a length of 1000 but got 1005

[Killed] BlockStatement
src/sandbox/clients.ts:300:59
 /**
  * Get recent audit log entries
  */
-export function getAuditLog(limit = 100): AuditLogEntry[] {
-  return auditLog.slice(-limit);
-}
+export function getAuditLog(limit = 100): AuditLogEntry[] {}
 
 /**
killedBy: sandbox clients cleans up idle clients and keeps bounded audit history
statusReason: Target cannot be null or undefined.

[Killed] MethodExpression
src/sandbox/clients.ts:301:10
  * Get recent audit log entries
  */
 export function getAuditLog(limit = 100): AuditLogEntry[] {
-  return auditLog.slice(-limit);
+  return auditLog;
 }
 
killedBy: sandbox clients cleans up idle clients and keeps bounded audit history
statusReason: expected [ 5, 6, 7, 8, 9, 10, 11, 12, …(992) ] to deeply equal [ 1003, 1004 ]

[Killed] UnaryOperator
src/sandbox/clients.ts:301:25
  * Get recent audit log entries
  */
 export function getAuditLog(limit = 100): AuditLogEntry[] {
-  return auditLog.slice(-limit);
+  return auditLog.slice(+limit);
 }
 
killedBy: sandbox clients cleans up idle clients and keeps bounded audit history
statusReason: expected [] to have a length of 1000 but got +0

[Killed] BlockStatement
src/sandbox/clients.ts:309:50
  */
 let cleanupInterval: NodeJS.Timeout | null = null;
 
-export function startLifecycleManagement(): void {
-  if (cleanupInterval) return;
-
-  // Initialize client states (deferred to ensure dotenv has loaded)
-  initClientStates();
-
-  // Check for idle clients every minute
-  cleanupInterval = setInterval(cleanupIdleClients, 60_000);
-
-  // Clean shutdown handlers
-  const shutdown = async (): Promise<void> => {
-    console.error("Shutting down...");
-    if (cleanupInterval) {
-      clearInterval(cleanupInterval);
-      cleanupInterval = null;
-    }
-    await disconnectAll();
-    process.exit(0);
-  };
-
-  process.on("SIGINT", shutdown);
-  process.on("SIGTERM", shutdown);
-}
+export function startLifecycleManagement(): void {}
 
 /**
killedBy: sandbox clients starts and stops lifecycle management once
statusReason: expected "addListener" to be called with arguments: [ 'SIGINT', Any<Function> ]

Number of calls: 0

[Killed] ConditionalExpression
src/sandbox/clients.ts:310:7
 let cleanupInterval: NodeJS.Timeout | null = null;
 
 export function startLifecycleManagement(): void {
-  if (cleanupInterval) return;
+  if (false) return;
 
   // Initialize client states (deferred to ensure dotenv has loaded)
killedBy: sandbox clients starts and stops lifecycle management once
statusReason: expected "addListener" to be called 4 times, but got 6 times

[Killed] ConditionalExpression
src/sandbox/clients.ts:310:7
 let cleanupInterval: NodeJS.Timeout | null = null;
 
 export function startLifecycleManagement(): void {
-  if (cleanupInterval) return;
+  if (true) return;
 
   // Initialize client states (deferred to ensure dotenv has loaded)
killedBy: sandbox clients starts and stops lifecycle management once
statusReason: expected "addListener" to be called with arguments: [ 'SIGINT', Any<Function> ]

Number of calls: 0

[Killed] BlockStatement
src/sandbox/clients.ts:319:47
   cleanupInterval = setInterval(cleanupIdleClients, 60_000);
 
   // Clean shutdown handlers
-  const shutdown = async (): Promise<void> => {
-    console.error("Shutting down...");
-    if (cleanupInterval) {
-      clearInterval(cleanupInterval);
-      cleanupInterval = null;
-    }
-    await disconnectAll();
-    process.exit(0);
-  };
+  const shutdown = async (): Promise<void> => {};
 
   process.on("SIGINT", shutdown);
killedBy: sandbox clients starts and stops lifecycle management once
statusReason: expected "error" to be called with arguments: [ 'Shutting down...' ]

Received:

  1st error call:

  [
-   "Shutting down...",

[Survived] ConditionalExpression
src/sandbox/clients.ts:321:9
   // Clean shutdown handlers
   const shutdown = async (): Promise<void> => {
     console.error("Shutting down...");
-    if (cleanupInterval) {
+    if (true) {
       clearInterval(cleanupInterval);
       cleanupInterval = null;

[Survived] BlockStatement
src/sandbox/clients.ts:321:26
   // Clean shutdown handlers
   const shutdown = async (): Promise<void> => {
     console.error("Shutting down...");
-    if (cleanupInterval) {
-      clearInterval(cleanupInterval);
-      cleanupInterval = null;
-    }
+    if (cleanupInterval) {}
     await disconnectAll();
     process.exit(0);

[Killed] BlockStatement
src/sandbox/clients.ts:336:49
 /**
  * Stop lifecycle management (for testing)
  */
-export function stopLifecycleManagement(): void {
-  if (cleanupInterval) {
-    clearInterval(cleanupInterval);
-    cleanupInterval = null;
-  }
-}
+export function stopLifecycleManagement(): void {}
 
 // Client states initialized lazily in startLifecycleManagement()
killedBy: sandbox clients starts and stops lifecycle management once
statusReason: expected "addListener" to be called 4 times, but got 2 times

[Killed] BlockStatement
src/sandbox/clients.ts:337:24
  * Stop lifecycle management (for testing)
  */
 export function stopLifecycleManagement(): void {
-  if (cleanupInterval) {
-    clearInterval(cleanupInterval);
-    cleanupInterval = null;
-  }
+  if (cleanupInterval) {}
 }
 
killedBy: sandbox clients starts and stops lifecycle management once
statusReason: expected "addListener" to be called 4 times, but got 2 times

[Killed] ConditionalExpression
src/sandbox/clients.ts:337:7
  * Stop lifecycle management (for testing)
  */
 export function stopLifecycleManagement(): void {
-  if (cleanupInterval) {
+  if (false) {
     clearInterval(cleanupInterval);
     cleanupInterval = null;
killedBy: sandbox clients starts and stops lifecycle management once
statusReason: expected "addListener" to be called 4 times, but got 2 times
