[Killed] ConditionalExpression
src/tools/search.ts:6:7
 
 /** First line only, max 80 chars */
 function oneLiner(text: string): string {
-  if (!text) return "";
+  if (true) return "";
   const line = text.split("\n")[0].trim();
   return line.length > 80 ? line.slice(0, 77) + "..." : line;
killedBy: tools/search handler maps search results to compact MCP output
statusReason: expected { results: [ { …(3) } ], …(6) } to match object { source: 'serena', count: 1, …(5) }
