[NoCoverage] BlockStatement
src/sandbox/runtime.ts:25:52
 /**
  * Summarise logs aggressively to minimize context usage
  */
-function summariseLogs(logs: unknown[]): unknown[] {
-  if (logs.length === 0) return [];
-
-  const serialised = JSON.stringify(logs);
-  if (serialised.length <= MAX_LOG_CHARS) {
-    return logs;
-  }
-
-  // Ultra-minimal summary - just confirmation + size
-  return [`Output truncated (${serialised.length} chars). Check workspace for full results.`];
-}
+function summariseLogs(logs: unknown[]): unknown[] {}
 
 /**

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:26:7
  * Summarise logs aggressively to minimize context usage
  */
 function summariseLogs(logs: unknown[]): unknown[] {
-  if (logs.length === 0) return [];
+  if (false) return [];
 
   const serialised = JSON.stringify(logs);

[NoCoverage] EqualityOperator
src/sandbox/runtime.ts:26:7
  * Summarise logs aggressively to minimize context usage
  */
 function summariseLogs(logs: unknown[]): unknown[] {
-  if (logs.length === 0) return [];
+  if (logs.length !== 0) return [];
 
   const serialised = JSON.stringify(logs);

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:29:7
   if (logs.length === 0) return [];
 
   const serialised = JSON.stringify(logs);
-  if (serialised.length <= MAX_LOG_CHARS) {
+  if (true) {
     return logs;
   }

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:29:43
   if (logs.length === 0) return [];
 
   const serialised = JSON.stringify(logs);
-  if (serialised.length <= MAX_LOG_CHARS) {
-    return logs;
-  }
+  if (serialised.length <= MAX_LOG_CHARS) {}
 
   // Ultra-minimal summary - just confirmation + size

[NoCoverage] ArrayDeclaration
src/sandbox/runtime.ts:34:10
   }
 
   // Ultra-minimal summary - just confirmation + size
-  return [`Output truncated (${serialised.length} chars). Check workspace for full results.`];
+  return [];
 }
 

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:34:11
   }
 
   // Ultra-minimal summary - just confirmation + size
-  return [`Output truncated (${serialised.length} chars). Check workspace for full results.`];
+  return [``];
 }
 

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:44:32
 function createClientProxy(name: string): ClientProxy {
   return new Proxy({} as ClientProxy, {
     get(_, toolName) {
-      if (toolName === "then") {
-        return undefined;
-      }
+      if (toolName === "then") {}
 
       if (typeof toolName !== "string") {

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:44:11
 function createClientProxy(name: string): ClientProxy {
   return new Proxy({} as ClientProxy, {
     get(_, toolName) {
-      if (toolName === "then") {
+      if (false) {
         return undefined;
       }

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:48:11
         return undefined;
       }
 
-      if (typeof toolName !== "string") {
+      if (true) {
         return undefined;
       }

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:48:41
         return undefined;
       }
 
-      if (typeof toolName !== "string") {
-        return undefined;
-      }
+      if (typeof toolName !== "string") {}
 
       return async (args: Record<string, unknown> = {}) => {

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:54:13
 
       return async (args: Record<string, unknown> = {}) => {
         const client = await getClient(name);
-        if (!client) {
+        if (false) {
           throw new Error(`${name} MCP is not available`);
         }

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:54:22
 
       return async (args: Record<string, unknown> = {}) => {
         const client = await getClient(name);
-        if (!client) {
-          throw new Error(`${name} MCP is not available`);
-        }
+        if (!client) {}
 
         const startTime = Date.now();

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:55:27
       return async (args: Record<string, unknown> = {}) => {
         const client = await getClient(name);
         if (!client) {
-          throw new Error(`${name} MCP is not available`);
+          throw new Error(``);
         }
 

[NoCoverage] ArithmeticOperator
src/sandbox/runtime.ts:67:23
             client: name,
             tool: toolName,
             args,
-            duration: Date.now() - startTime,
+            duration: Date.now() + startTime,
           });
 

[NoCoverage] EqualityOperator
src/sandbox/runtime.ts:72:15
 
           // Check response size
           const serialised = JSON.stringify(result);
-          if (serialised.length > MAX_LOG_ENTRY_CHARS) {
+          if (serialised.length >= MAX_LOG_ENTRY_CHARS) {
             // Auto-save large responses to workspace
             const filename = `${Date.now()}-${name}-${toolName}.json`;

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:72:15
 
           // Check response size
           const serialised = JSON.stringify(result);
-          if (serialised.length > MAX_LOG_ENTRY_CHARS) {
+          if (false) {
             // Auto-save large responses to workspace
             const filename = `${Date.now()}-${name}-${toolName}.json`;

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:74:30
           const serialised = JSON.stringify(result);
           if (serialised.length > MAX_LOG_ENTRY_CHARS) {
             // Auto-save large responses to workspace
-            const filename = `${Date.now()}-${name}-${toolName}.json`;
+            const filename = ``;
             const filepath = `${MCP_RESULTS_DIR}/${filename}`;
             try {

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:76:17
             // Auto-save large responses to workspace
             const filename = `${Date.now()}-${name}-${toolName}.json`;
             const filepath = `${MCP_RESULTS_DIR}/${filename}`;
-            try {
-              await workspace.mkdir(MCP_RESULTS_DIR);
-              await workspace.writeJSON(filepath, result);
-
-              // Return reference with preview
-              return {
-                _savedTo: filepath,
-                _size: serialised.length,
-                _preview: serialised.slice(0, 200) + "...",
-                _hint: `Full result saved to workspace. Use workspace.readJSON("${filepath}") to access.`,
-              };
-            } catch (saveErr) {
+            try {} catch (saveErr) {
               // If save fails, return truncated result with warning
               console.error(`Failed to auto-save large result: ${saveErr}`);

[NoCoverage] MethodExpression
src/sandbox/runtime.ts:84:27
               return {
                 _savedTo: filepath,
                 _size: serialised.length,
-                _preview: serialised.slice(0, 200) + "...",
+                _preview: serialised + "...",
                 _hint: `Full result saved to workspace. Use workspace.readJSON("${filepath}") to access.`,
               };

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:84:54
               return {
                 _savedTo: filepath,
                 _size: serialised.length,
-                _preview: serialised.slice(0, 200) + "...",
+                _preview: serialised.slice(0, 200) + "",
                 _hint: `Full result saved to workspace. Use workspace.readJSON("${filepath}") to access.`,
               };

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:87:31
                 _preview: serialised.slice(0, 200) + "...",
                 _hint: `Full result saved to workspace. Use workspace.readJSON("${filepath}") to access.`,
               };
-            } catch (saveErr) {
-              // If save fails, return truncated result with warning
-              console.error(`Failed to auto-save large result: ${saveErr}`);
-              return {
-                _warning: "Result too large to auto-save, returning truncated",
-                _size: serialised.length,
-                _preview: serialised.slice(0, 1000),
-              };
-            }
+            } catch (saveErr) {}
           }
 

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:89:29
               };
             } catch (saveErr) {
               // If save fails, return truncated result with warning
-              console.error(`Failed to auto-save large result: ${saveErr}`);
+              console.error(``);
               return {
                 _warning: "Result too large to auto-save, returning truncated",

[NoCoverage] ObjectLiteral
src/sandbox/runtime.ts:90:22
             } catch (saveErr) {
               // If save fails, return truncated result with warning
               console.error(`Failed to auto-save large result: ${saveErr}`);
-              return {
-                _warning: "Result too large to auto-save, returning truncated",
-                _size: serialised.length,
-                _preview: serialised.slice(0, 1000),
-              };
+              return {};
             }
           }

[NoCoverage] MethodExpression
src/sandbox/runtime.ts:93:27
               return {
                 _warning: "Result too large to auto-save, returning truncated",
                 _size: serialised.length,
-                _preview: serialised.slice(0, 1000),
+                _preview: serialised,
               };
             }

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:99:25
           }
 
           return result;
-        } catch (error) {
-          const errorMessage = error instanceof Error ? error.message : String(error);
-          logMcpCall({
-            timestamp: startTime,
-            client: name,
-            tool: toolName,
-            args,
-            duration: Date.now() - startTime,
-            error: errorMessage,
-          });
-          throw error;
-        }
+        } catch (error) {}
       };
     },

[NoCoverage] ObjectLiteral
src/sandbox/runtime.ts:101:22
           return result;
         } catch (error) {
           const errorMessage = error instanceof Error ? error.message : String(error);
-          logMcpCall({
-            timestamp: startTime,
-            client: name,
-            tool: toolName,
-            args,
-            duration: Date.now() - startTime,
-            error: errorMessage,
-          });
+          logMcpCall({});
           throw error;
         }

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:119:52
 /**
  * Convert arbitrary MCP server names into JavaScript-safe sandbox bindings.
  */
-function toSandboxIdentifier(name: string): string {
-  const identifier = name.replace(/[^a-zA-Z0-9_$]/g, "_") || "_";
-  return /^[0-9]/.test(identifier) ? `_${identifier}` : identifier;
-}
+function toSandboxIdentifier(name: string): string {}
 
 const RESERVED_IDENTIFIERS = new Set([

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:120:22
  * Convert arbitrary MCP server names into JavaScript-safe sandbox bindings.
  */
 function toSandboxIdentifier(name: string): string {
-  const identifier = name.replace(/[^a-zA-Z0-9_$]/g, "_") || "_";
+  const identifier = true;
   return /^[0-9]/.test(identifier) ? `_${identifier}` : identifier;
 }

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:120:22
  * Convert arbitrary MCP server names into JavaScript-safe sandbox bindings.
  */
 function toSandboxIdentifier(name: string): string {
-  const identifier = name.replace(/[^a-zA-Z0-9_$]/g, "_") || "_";
+  const identifier = false;
   return /^[0-9]/.test(identifier) ? `_${identifier}` : identifier;
 }

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:127:3
 const RESERVED_IDENTIFIERS = new Set([
   "await",
   "break",
-  "case",
+  "",
   "class",
   "catch",

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:129:3
   "break",
   "case",
   "class",
-  "catch",
+  "",
   "const",
   "continue",

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:135:3
   "debugger",
   "default",
   "delete",
-  "do",
+  "",
   "else",
   "enum",

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:140:3
   "enum",
   "export",
   "extends",
-  "false",
+  "",
   "finally",
   "for",

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:146:3
   "function",
   "if",
   "implements",
-  "import",
+  "",
   "in",
   "instanceof",

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:149:3
   "import",
   "in",
   "instanceof",
-  "interface",
+  "",
   "let",
   "new",

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:155:3
   "null",
   "package",
   "private",
-  "protected",
+  "",
   "public",
   "return",

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:156:3
   "package",
   "private",
   "protected",
-  "public",
+  "",
   "return",
   "static",

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:158:3
   "protected",
   "public",
   "return",
-  "static",
+  "",
   "super",
   "switch",

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:170:3
   "void",
   "while",
   "with",
-  "yield",
+  "",
   "arguments",
   "eval",

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:175:78
   "eval",
 ]);
 
-const RESERVED_GLOBAL_BINDINGS = new Set(["console", "workspace", "clients", "globalThis"]);
+const RESERVED_GLOBAL_BINDINGS = new Set(["console", "workspace", "clients", ""]);
 
 function toGlobalIdentifier(name: string, usedIdentifiers: Set<string>): string {

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:175:54
   "eval",
 ]);
 
-const RESERVED_GLOBAL_BINDINGS = new Set(["console", "workspace", "clients", "globalThis"]);
+const RESERVED_GLOBAL_BINDINGS = new Set(["console", "", "clients", "globalThis"]);
 
 function toGlobalIdentifier(name: string, usedIdentifiers: Set<string>): string {

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:177:81
 
 const RESERVED_GLOBAL_BINDINGS = new Set(["console", "workspace", "clients", "globalThis"]);
 
-function toGlobalIdentifier(name: string, usedIdentifiers: Set<string>): string {
-  let identifier = toSandboxIdentifier(name);
-  if (RESERVED_IDENTIFIERS.has(identifier)) {
-    identifier = `_${identifier}`;
-  }
-  if (RESERVED_GLOBAL_BINDINGS.has(identifier)) {
-    identifier = `${identifier}_`;
-  }
-
-  let candidate = identifier;
-  let i = 1;
-  while (usedIdentifiers.has(candidate)) {
-    candidate = `${identifier}_${i++}`;
-  }
-  return candidate;
-}
+function toGlobalIdentifier(name: string, usedIdentifiers: Set<string>): string {}
 
 /**

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:179:45
 
 function toGlobalIdentifier(name: string, usedIdentifiers: Set<string>): string {
   let identifier = toSandboxIdentifier(name);
-  if (RESERVED_IDENTIFIERS.has(identifier)) {
-    identifier = `_${identifier}`;
-  }
+  if (RESERVED_IDENTIFIERS.has(identifier)) {}
   if (RESERVED_GLOBAL_BINDINGS.has(identifier)) {
     identifier = `${identifier}_`;

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:179:7
 
 function toGlobalIdentifier(name: string, usedIdentifiers: Set<string>): string {
   let identifier = toSandboxIdentifier(name);
-  if (RESERVED_IDENTIFIERS.has(identifier)) {
+  if (true) {
     identifier = `_${identifier}`;
   }

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:180:18
 function toGlobalIdentifier(name: string, usedIdentifiers: Set<string>): string {
   let identifier = toSandboxIdentifier(name);
   if (RESERVED_IDENTIFIERS.has(identifier)) {
-    identifier = `_${identifier}`;
+    identifier = ``;
   }
   if (RESERVED_GLOBAL_BINDINGS.has(identifier)) {

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:182:49
   if (RESERVED_IDENTIFIERS.has(identifier)) {
     identifier = `_${identifier}`;
   }
-  if (RESERVED_GLOBAL_BINDINGS.has(identifier)) {
-    identifier = `${identifier}_`;
-  }
+  if (RESERVED_GLOBAL_BINDINGS.has(identifier)) {}
 
   let candidate = identifier;

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:182:7
   if (RESERVED_IDENTIFIERS.has(identifier)) {
     identifier = `_${identifier}`;
   }
-  if (RESERVED_GLOBAL_BINDINGS.has(identifier)) {
+  if (false) {
     identifier = `${identifier}_`;
   }

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:183:18
     identifier = `_${identifier}`;
   }
   if (RESERVED_GLOBAL_BINDINGS.has(identifier)) {
-    identifier = `${identifier}_`;
+    identifier = ``;
   }
 

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:188:10
 
   let candidate = identifier;
   let i = 1;
-  while (usedIdentifiers.has(candidate)) {
+  while (false) {
     candidate = `${identifier}_${i++}`;
   }

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:188:42
 
   let candidate = identifier;
   let i = 1;
-  while (usedIdentifiers.has(candidate)) {
-    candidate = `${identifier}_${i++}`;
-  }
+  while (usedIdentifiers.has(candidate)) {}
   return candidate;
 }

[NoCoverage] UpdateOperator
src/sandbox/runtime.ts:189:34
   let candidate = identifier;
   let i = 1;
   while (usedIdentifiers.has(candidate)) {
-    candidate = `${identifier}_${i++}`;
+    candidate = `${identifier}_${i--}`;
   }
   return candidate;

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:197:55
 /**
  * Map server names to guaranteed-usable sandbox bindings.
  */
-function buildServerBindingMap(): Map<string, string> {
-  const bindings = new Map<string, string>();
-  const used = new Set(["console", "workspace", "clients", "globalThis"]);
-
-  for (const config of SERVER_CONFIGS) {
-    const identifier = toGlobalIdentifier(config.name, used);
-    used.add(identifier);
-    bindings.set(config.name, identifier);
-  }
-
-  return bindings;
-}
+function buildServerBindingMap(): Map<string, string> {}
 
 /**

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:199:49
  */
 function buildServerBindingMap(): Map<string, string> {
   const bindings = new Map<string, string>();
-  const used = new Set(["console", "workspace", "clients", "globalThis"]);
+  const used = new Set(["console", "workspace", "", "globalThis"]);
 
   for (const config of SERVER_CONFIGS) {

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:201:40
   const bindings = new Map<string, string>();
   const used = new Set(["console", "workspace", "clients", "globalThis"]);
 
-  for (const config of SERVER_CONFIGS) {
-    const identifier = toGlobalIdentifier(config.name, used);
-    used.add(identifier);
-    bindings.set(config.name, identifier);
-  }
+  for (const config of SERVER_CONFIGS) {}
 
   return bindings;

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:213:73
 /**
  * Create a mock console that captures output
  */
-function createMockConsole(): { console: MockConsole; logs: unknown[] } {
-  const logs: unknown[] = [];
-  const mockConsole = {
-    log: (...args: unknown[]) => { logs.push(args.length === 1 ? args[0] : args); },
-    info: (...args: unknown[]) => { logs.push({ level: "info", data: args }); },
-    warn: (...args: unknown[]) => { logs.push({ level: "warn", data: args }); },
-    error: (...args: unknown[]) => { logs.push({ level: "error", data: args }); },
-    debug: (...args: unknown[]) => { logs.push({ level: "debug", data: args }); },
-  };
-  return { console: mockConsole, logs };
-}
+function createMockConsole(): { console: MockConsole; logs: unknown[] } {}
 
 /**

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:216:46
 function createMockConsole(): { console: MockConsole; logs: unknown[] } {
   const logs: unknown[] = [];
   const mockConsole = {
-    log: (...args: unknown[]) => { logs.push(args.length === 1 ? args[0] : args); },
+    log: (...args: unknown[]) => { logs.push(false ? args[0] : args); },
     info: (...args: unknown[]) => { logs.push({ level: "info", data: args }); },
     warn: (...args: unknown[]) => { logs.push({ level: "warn", data: args }); },

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:216:34
 function createMockConsole(): { console: MockConsole; logs: unknown[] } {
   const logs: unknown[] = [];
   const mockConsole = {
-    log: (...args: unknown[]) => { logs.push(args.length === 1 ? args[0] : args); },
+    log: (...args: unknown[]) => {},
     info: (...args: unknown[]) => { logs.push({ level: "info", data: args }); },
     warn: (...args: unknown[]) => { logs.push({ level: "warn", data: args }); },

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:217:35
   const logs: unknown[] = [];
   const mockConsole = {
     log: (...args: unknown[]) => { logs.push(args.length === 1 ? args[0] : args); },
-    info: (...args: unknown[]) => { logs.push({ level: "info", data: args }); },
+    info: (...args: unknown[]) => {},
     warn: (...args: unknown[]) => { logs.push({ level: "warn", data: args }); },
     error: (...args: unknown[]) => { logs.push({ level: "error", data: args }); },

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:218:35
   const mockConsole = {
     log: (...args: unknown[]) => { logs.push(args.length === 1 ? args[0] : args); },
     info: (...args: unknown[]) => { logs.push({ level: "info", data: args }); },
-    warn: (...args: unknown[]) => { logs.push({ level: "warn", data: args }); },
+    warn: (...args: unknown[]) => {},
     error: (...args: unknown[]) => { logs.push({ level: "error", data: args }); },
     debug: (...args: unknown[]) => { logs.push({ level: "debug", data: args }); },

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:218:56
   const mockConsole = {
     log: (...args: unknown[]) => { logs.push(args.length === 1 ? args[0] : args); },
     info: (...args: unknown[]) => { logs.push({ level: "info", data: args }); },
-    warn: (...args: unknown[]) => { logs.push({ level: "warn", data: args }); },
+    warn: (...args: unknown[]) => { logs.push({ level: "", data: args }); },
     error: (...args: unknown[]) => { logs.push({ level: "error", data: args }); },
     debug: (...args: unknown[]) => { logs.push({ level: "debug", data: args }); },

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:219:36
     log: (...args: unknown[]) => { logs.push(args.length === 1 ? args[0] : args); },
     info: (...args: unknown[]) => { logs.push({ level: "info", data: args }); },
     warn: (...args: unknown[]) => { logs.push({ level: "warn", data: args }); },
-    error: (...args: unknown[]) => { logs.push({ level: "error", data: args }); },
+    error: (...args: unknown[]) => {},
     debug: (...args: unknown[]) => { logs.push({ level: "debug", data: args }); },
   };

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:220:36
     info: (...args: unknown[]) => { logs.push({ level: "info", data: args }); },
     warn: (...args: unknown[]) => { logs.push({ level: "warn", data: args }); },
     error: (...args: unknown[]) => { logs.push({ level: "error", data: args }); },
-    debug: (...args: unknown[]) => { logs.push({ level: "debug", data: args }); },
+    debug: (...args: unknown[]) => {},
   };
   return { console: mockConsole, logs };

[NoCoverage] StringLiteral
src/sandbox/runtime.ts:220:57
     info: (...args: unknown[]) => { logs.push({ level: "info", data: args }); },
     warn: (...args: unknown[]) => { logs.push({ level: "warn", data: args }); },
     error: (...args: unknown[]) => { logs.push({ level: "error", data: args }); },
-    debug: (...args: unknown[]) => { logs.push({ level: "debug", data: args }); },
+    debug: (...args: unknown[]) => { logs.push({ level: "", data: args }); },
   };
   return { console: mockConsole, logs };

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:228:72
 /**
  * Build the sandbox globals object with all MCP clients and workspace
  */
-function buildSandboxGlobals(mockConsole: MockConsole): SandboxGlobals {
-  const bindingMap = buildServerBindingMap();
-  const clients: Record<string, ClientProxy> = {};
-  const globals: SandboxGlobals = {
-    console: mockConsole,
-    workspace,
-    clients,
-  };
-
-  // Add all MCP client proxies
-  for (const config of SERVER_CONFIGS) {
-    const proxy = createClientProxy(config.name);
-    clients[config.name] = proxy;
-    const identifier = bindingMap.get(config.name) || toSandboxIdentifier(config.name);
-    if (!Object.prototype.hasOwnProperty.call(globals, identifier)) {
-      globals[identifier] = proxy;
-    }
-  }
-
-  return globals;
-}
+function buildSandboxGlobals(mockConsole: MockConsole): SandboxGlobals {}
 
 /**

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:238:40
   };
 
   // Add all MCP client proxies
-  for (const config of SERVER_CONFIGS) {
-    const proxy = createClientProxy(config.name);
-    clients[config.name] = proxy;
-    const identifier = bindingMap.get(config.name) || toSandboxIdentifier(config.name);
-    if (!Object.prototype.hasOwnProperty.call(globals, identifier)) {
-      globals[identifier] = proxy;
-    }
-  }
+  for (const config of SERVER_CONFIGS) {}
 
   return globals;

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:241:24
   for (const config of SERVER_CONFIGS) {
     const proxy = createClientProxy(config.name);
     clients[config.name] = proxy;
-    const identifier = bindingMap.get(config.name) || toSandboxIdentifier(config.name);
+    const identifier = true;
     if (!Object.prototype.hasOwnProperty.call(globals, identifier)) {
       globals[identifier] = proxy;

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:241:24
   for (const config of SERVER_CONFIGS) {
     const proxy = createClientProxy(config.name);
     clients[config.name] = proxy;
-    const identifier = bindingMap.get(config.name) || toSandboxIdentifier(config.name);
+    const identifier = false;
     if (!Object.prototype.hasOwnProperty.call(globals, identifier)) {
       globals[identifier] = proxy;

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:242:69
     const proxy = createClientProxy(config.name);
     clients[config.name] = proxy;
     const identifier = bindingMap.get(config.name) || toSandboxIdentifier(config.name);
-    if (!Object.prototype.hasOwnProperty.call(globals, identifier)) {
-      globals[identifier] = proxy;
-    }
+    if (!Object.prototype.hasOwnProperty.call(globals, identifier)) {}
   }
 

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:242:9
     const proxy = createClientProxy(config.name);
     clients[config.name] = proxy;
     const identifier = bindingMap.get(config.name) || toSandboxIdentifier(config.name);
-    if (!Object.prototype.hasOwnProperty.call(globals, identifier)) {
+    if (true) {
       globals[identifier] = proxy;
     }

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:261:7
   const globalNames = Object.keys(globals);
   const globalValues = Object.values(globals);
 
-  try {
-    // Create async function with globals as parameters
-    // eslint-disable-next-line @typescript-eslint/no-implied-eval
-    const AsyncFunction = Object.getPrototypeOf(async function () { }).constructor as new (...args: string[]) => (...args: unknown[]) => Promise<unknown>;
-    const fn = new AsyncFunction(...globalNames, code);
-
-    // Execute with timeout
-    const result = await Promise.race([
-      fn(...globalValues),
-      new Promise((_, reject) => setTimeout(() => reject(new Error(`Execution timed out after ${timeout}ms`)), timeout)),
-    ]);
-
-    // If the code returned something, add it to logs
-    if (result !== undefined) {
-      logs.push({ returned: result });
-    }
-
-    return { logs: summariseLogs(logs) };
-  } catch (error) {
+  try {} catch (error) {
     const errorMessage = error instanceof Error ? error.message : String(error);
     const stack = error instanceof Error ? error.stack : undefined;

[NoCoverage] ArrowFunction
src/sandbox/runtime.ts:270:19
     // Execute with timeout
     const result = await Promise.race([
       fn(...globalValues),
-      new Promise((_, reject) => setTimeout(() => reject(new Error(`Execution timed out after ${timeout}ms`)), timeout)),
+      new Promise(() => undefined),
     ]);
 

[NoCoverage] ArrowFunction
src/sandbox/runtime.ts:270:45
     // Execute with timeout
     const result = await Promise.race([
       fn(...globalValues),
-      new Promise((_, reject) => setTimeout(() => reject(new Error(`Execution timed out after ${timeout}ms`)), timeout)),
+      new Promise((_, reject) => setTimeout(() => undefined, timeout)),
     ]);
 

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:274:31
     ]);
 
     // If the code returned something, add it to logs
-    if (result !== undefined) {
-      logs.push({ returned: result });
-    }
+    if (result !== undefined) {}
 
     return { logs: summariseLogs(logs) };

[NoCoverage] EqualityOperator
src/sandbox/runtime.ts:274:9
     ]);
 
     // If the code returned something, add it to logs
-    if (result !== undefined) {
+    if (result === undefined) {
       logs.push({ returned: result });
     }

[NoCoverage] ObjectLiteral
src/sandbox/runtime.ts:278:12
       logs.push({ returned: result });
     }
 
-    return { logs: summariseLogs(logs) };
+    return {};
   } catch (error) {
     const errorMessage = error instanceof Error ? error.message : String(error);

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:279:19
     }
 
     return { logs: summariseLogs(logs) };
-  } catch (error) {
-    const errorMessage = error instanceof Error ? error.message : String(error);
-    const stack = error instanceof Error ? error.stack : undefined;
-
-    return {
-      logs: summariseLogs(logs),
-      error: errorMessage,
-      stack,
-    };
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:294:53
 /**
  * Get a list of available MCP clients (for error messages)
  */
-export function getAvailableClientNames(): string[] {
-  return SERVER_CONFIGS.map((c) => c.name);
-}
+export function getAvailableClientNames(): string[] {}
 
 /**

[NoCoverage] ArrowFunction
src/sandbox/runtime.ts:295:29
  * Get a list of available MCP clients (for error messages)
  */
 export function getAvailableClientNames(): string[] {
-  return SERVER_CONFIGS.map((c) => c.name);
+  return SERVER_CONFIGS.map(() => undefined);
 }
 
