[NoCoverage] BlockStatement
src/sandbox/runtime.ts:301:54
 /**
  * Get available MCP client bindings as exposed inside execute_code.
  */
-export function getSandboxClientBindings(): string[] {
-  return SERVER_CONFIGS.map((c) => {
-    const identifier = buildServerBindingMap().get(c.name) || toSandboxIdentifier(c.name);
-    return identifier === c.name ? c.name : `${identifier} (server: ${c.name})`;
-  });
-}
+export function getSandboxClientBindings(): string[] {}
 

[NoCoverage] BlockStatement
src/sandbox/runtime.ts:302:36
  * Get available MCP client bindings as exposed inside execute_code.
  */
 export function getSandboxClientBindings(): string[] {
-  return SERVER_CONFIGS.map((c) => {
-    const identifier = buildServerBindingMap().get(c.name) || toSandboxIdentifier(c.name);
-    return identifier === c.name ? c.name : `${identifier} (server: ${c.name})`;
-  });
+  return SERVER_CONFIGS.map((c) => {});
 }
 

[NoCoverage] LogicalOperator
src/sandbox/runtime.ts:303:24
  */
 export function getSandboxClientBindings(): string[] {
   return SERVER_CONFIGS.map((c) => {
-    const identifier = buildServerBindingMap().get(c.name) || toSandboxIdentifier(c.name);
+    const identifier = buildServerBindingMap().get(c.name) && toSandboxIdentifier(c.name);
     return identifier === c.name ? c.name : `${identifier} (server: ${c.name})`;
   });

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:303:24
  */
 export function getSandboxClientBindings(): string[] {
   return SERVER_CONFIGS.map((c) => {
-    const identifier = buildServerBindingMap().get(c.name) || toSandboxIdentifier(c.name);
+    const identifier = false;
     return identifier === c.name ? c.name : `${identifier} (server: ${c.name})`;
   });

[NoCoverage] EqualityOperator
src/sandbox/runtime.ts:304:12
 export function getSandboxClientBindings(): string[] {
   return SERVER_CONFIGS.map((c) => {
     const identifier = buildServerBindingMap().get(c.name) || toSandboxIdentifier(c.name);
-    return identifier === c.name ? c.name : `${identifier} (server: ${c.name})`;
+    return identifier !== c.name ? c.name : `${identifier} (server: ${c.name})`;
   });
 }

[NoCoverage] ConditionalExpression
src/sandbox/runtime.ts:304:12
 export function getSandboxClientBindings(): string[] {
   return SERVER_CONFIGS.map((c) => {
     const identifier = buildServerBindingMap().get(c.name) || toSandboxIdentifier(c.name);
-    return identifier === c.name ? c.name : `${identifier} (server: ${c.name})`;
+    return true ? c.name : `${identifier} (server: ${c.name})`;
   });
 }
