[Survived] ObjectLiteral
src/schemas.ts:6:48
 /**
  * Input schema for search_tools
  */
-export const SearchToolsInputSchema = z.object({
-  query: z.string()
-    .min(1, "Query cannot be empty")
-    .describe("Search query for finding relevant tools"),
-  limit: z.number()
-    .int()
-    .min(1)
-    .max(50)
-    .default(5)
-    .describe("Maximum results to return (default: 5)"),
-  offset: z.number()
-    .int()
-    .min(0)
-    .default(0)
-    .describe("Number of results to skip for pagination (default: 0)"),
-}).strict();
+export const SearchToolsInputSchema = z.object({}).strict();
 
 export type SearchToolsInput = z.infer<typeof SearchToolsInputSchema>;

[Survived] MethodExpression
src/schemas.ts:7:10
  * Input schema for search_tools
  */
 export const SearchToolsInputSchema = z.object({
-  query: z.string()
-    .min(1, "Query cannot be empty")
+  query: z.string().max(1, "Query cannot be empty")
     .describe("Search query for finding relevant tools"),
   limit: z.number()

[Survived] MethodExpression
src/schemas.ts:10:10
   query: z.string()
     .min(1, "Query cannot be empty")
     .describe("Search query for finding relevant tools"),
-  limit: z.number()
-    .int()
-    .min(1)
+  limit: z.number().int().max(1)
     .max(50)
     .default(5)

[Survived] MethodExpression
src/schemas.ts:10:10
   query: z.string()
     .min(1, "Query cannot be empty")
     .describe("Search query for finding relevant tools"),
-  limit: z.number()
-    .int()
-    .min(1)
-    .max(50)
+  limit: z.number().int().min(1).min(50)
     .default(5)
     .describe("Maximum results to return (default: 5)"),

[Survived] MethodExpression
src/schemas.ts:16:11
     .max(50)
     .default(5)
     .describe("Maximum results to return (default: 5)"),
-  offset: z.number()
-    .int()
-    .min(0)
+  offset: z.number().int().max(0)
     .default(0)
     .describe("Number of results to skip for pagination (default: 0)"),

[Survived] MethodExpression
src/schemas.ts:29:9
  * Input schema for get_tool_schema
  */
 export const GetToolSchemaInputSchema = z.object({
-  name: z.string()
-    .min(1, "Tool name cannot be empty")
+  name: z.string().max(1, "Tool name cannot be empty")
     .describe("Tool name (from search_tools results)"),
 }).strict();

[Survived] StringLiteral
src/schemas.ts:30:13
  */
 export const GetToolSchemaInputSchema = z.object({
   name: z.string()
-    .min(1, "Tool name cannot be empty")
+    .min(1, "")
     .describe("Tool name (from search_tools results)"),
 }).strict();

[Survived] MethodExpression
src/schemas.ts:40:9
  * Input schema for execute_code
  */
 export const ExecuteCodeInputSchema = z.object({
-  code: z.string()
-    .min(1, "Code cannot be empty")
+  code: z.string().max(1, "Code cannot be empty")
     .describe("TypeScript/JavaScript code to execute"),
   timeout: z.number()

[Survived] StringLiteral
src/schemas.ts:41:13
  */
 export const ExecuteCodeInputSchema = z.object({
   code: z.string()
-    .min(1, "Code cannot be empty")
+    .min(1, "")
     .describe("TypeScript/JavaScript code to execute"),
   timeout: z.number()

[Survived] MethodExpression
src/schemas.ts:43:12
   code: z.string()
     .min(1, "Code cannot be empty")
     .describe("TypeScript/JavaScript code to execute"),
-  timeout: z.number()
-    .int()
-    .min(1000)
+  timeout: z.number().int().max(1000)
     .max(600000)
     .default(30000)

[Survived] MethodExpression
src/schemas.ts:43:12
   code: z.string()
     .min(1, "Code cannot be empty")
     .describe("TypeScript/JavaScript code to execute"),
-  timeout: z.number()
-    .int()
-    .min(1000)
-    .max(600000)
+  timeout: z.number().int().min(1000).min(600000)
     .default(30000)
     .describe("Execution timeout in ms (default: 30000)"),
