[NoCoverage] BooleanLiteral
src/bm25.ts:15:21
 
 let bm25Engine: BM25SearchEngine | null = null;
 let indexedTools: ToolDefinition[] = [];
-let isInitialized = false;
+let isInitialized = true;
 
 /**

[NoCoverage] ObjectLiteral
src/bm25.ts:25:41
   indexedTools = tools;
 
   // Configure for tool search - weight name higher than description
-  bm25Engine.defineConfig({ fldWeights: { name: 3, description: 1, server: 1 } });
+  bm25Engine.defineConfig({ fldWeights: {} });
 
   // Use standard NLP preprocessing

[NoCoverage] ArrayDeclaration
src/bm25.ts:28:30
   bm25Engine.defineConfig({ fldWeights: { name: 3, description: 1, server: 1 } });
 
   // Use standard NLP preprocessing
-  bm25Engine.definePrepTasks([
-    nlp.string.lowerCase,
-    nlp.string.tokenize0,
-    nlp.tokens.removeWords,
-    nlp.tokens.stem,
-  ]);
+  bm25Engine.definePrepTasks([]);
 
   // Index all tools

[NoCoverage] BlockStatement
src/bm25.ts:36:32
   ]);
 
   // Index all tools
-  tools.forEach((tool, idx) => {
-    bm25Engine!.addDoc({
-      name: tool.name,
-      description: tool.description,
-      server: tool.server,
-    }, idx);
-  });
+  tools.forEach((tool, idx) => {});
 
   bm25Engine.consolidate();

[NoCoverage] ObjectLiteral
src/bm25.ts:37:24
 
   // Index all tools
   tools.forEach((tool, idx) => {
-    bm25Engine!.addDoc({
-      name: tool.name,
-      description: tool.description,
-      server: tool.server,
-    }, idx);
+    bm25Engine!.addDoc({}, idx);
   });
 

[NoCoverage] BooleanLiteral
src/bm25.ts:45:19
   });
 
   bm25Engine.consolidate();
-  isInitialized = true;
+  isInitialized = false;
 }
 

[NoCoverage] BlockStatement
src/bm25.ts:52:76
  * Search tools using BM25
  * wink-bm25 returns [[docId: string, score: number], ...] tuples
  */
-export function searchBM25(query: string, limit: number): ToolDefinition[] {
-  if (!bm25Engine || !isInitialized) {
-    return [];
-  }
-
-  // wink-bm25 types claim number[] but actually returns [string, number][]
-  const results = bm25Engine.search(query, limit);
-  return results
-    .map(([docId]) => indexedTools[parseInt(docId, 10)])
-    .filter((tool): tool is ToolDefinition => tool !== undefined);
-}
+export function searchBM25(query: string, limit: number): ToolDefinition[] {}
 
 /**

[NoCoverage] ConditionalExpression
src/bm25.ts:53:7
  * wink-bm25 returns [[docId: string, score: number], ...] tuples
  */
 export function searchBM25(query: string, limit: number): ToolDefinition[] {
-  if (!bm25Engine || !isInitialized) {
+  if (true) {
     return [];
   }

[NoCoverage] BooleanLiteral
src/bm25.ts:53:22
  * wink-bm25 returns [[docId: string, score: number], ...] tuples
  */
 export function searchBM25(query: string, limit: number): ToolDefinition[] {
-  if (!bm25Engine || !isInitialized) {
+  if (!bm25Engine || isInitialized) {
     return [];
   }

[NoCoverage] MethodExpression
src/bm25.ts:59:10
 
   // wink-bm25 types claim number[] but actually returns [string, number][]
   const results = bm25Engine.search(query, limit);
-  return results
-    .map(([docId]) => indexedTools[parseInt(docId, 10)])
-    .filter((tool): tool is ToolDefinition => tool !== undefined);
+  return results.map(([docId]) => indexedTools[parseInt(docId, 10)]);
 }
 

[NoCoverage] ArrowFunction
src/bm25.ts:60:10
   // wink-bm25 types claim number[] but actually returns [string, number][]
   const results = bm25Engine.search(query, limit);
   return results
-    .map(([docId]) => indexedTools[parseInt(docId, 10)])
+    .map(() => undefined)
     .filter((tool): tool is ToolDefinition => tool !== undefined);
 }

[NoCoverage] ArrowFunction
src/bm25.ts:61:13
   const results = bm25Engine.search(query, limit);
   return results
     .map(([docId]) => indexedTools[parseInt(docId, 10)])
-    .filter((tool): tool is ToolDefinition => tool !== undefined);
+    .filter(() => undefined);
 }
 

[NoCoverage] ConditionalExpression
src/bm25.ts:61:47
   const results = bm25Engine.search(query, limit);
   return results
     .map(([docId]) => indexedTools[parseInt(docId, 10)])
-    .filter((tool): tool is ToolDefinition => tool !== undefined);
+    .filter((tool): tool is ToolDefinition => false);
 }
 

[NoCoverage] BlockStatement
src/bm25.ts:67:40
 /**
  * Check if BM25 engine is ready
  */
-export function isBM25Ready(): boolean {
-  return isInitialized && bm25Engine !== null;
-}
+export function isBM25Ready(): boolean {}
 
 /**

[NoCoverage] LogicalOperator
src/bm25.ts:68:10
  * Check if BM25 engine is ready
  */
 export function isBM25Ready(): boolean {
-  return isInitialized && bm25Engine !== null;
+  return isInitialized || bm25Engine !== null;
 }
 

[NoCoverage] ConditionalExpression
src/bm25.ts:68:27
  * Check if BM25 engine is ready
  */
 export function isBM25Ready(): boolean {
-  return isInitialized && bm25Engine !== null;
+  return isInitialized && true;
 }
 

[NoCoverage] BlockStatement
src/bm25.ts:74:35
 /**
  * Reset BM25 engine (for testing)
  */
-export function resetBM25(): void {
-  bm25Engine = null;
-  indexedTools = [];
-  isInitialized = false;
-}
+export function resetBM25(): void {}
 

[NoCoverage] ArrayDeclaration
src/bm25.ts:76:18
  */
 export function resetBM25(): void {
   bm25Engine = null;
-  indexedTools = [];
+  indexedTools = ["Stryker was here"];
   isInitialized = false;
 }

[NoCoverage] BooleanLiteral
src/bm25.ts:77:19
 export function resetBM25(): void {
   bm25Engine = null;
   indexedTools = [];
-  isInitialized = false;
+  isInitialized = true;
 }
 
