[NoCoverage] StringLiteral
src/sandbox/workspace.ts:9:55
 
 // Resolve workspace relative to module location (not cwd) for plugin portability
 const __dirname = dirname(fileURLToPath(import.meta.url));
-const WORKSPACE_ROOT = resolve(__dirname, "..", "..", "workspace");
+const WORKSPACE_ROOT = resolve(__dirname, "..", "..", "");
 
 /**

[NoCoverage] StringLiteral
src/sandbox/workspace.ts:9:49
 
 // Resolve workspace relative to module location (not cwd) for plugin portability
 const __dirname = dirname(fileURLToPath(import.meta.url));
-const WORKSPACE_ROOT = resolve(__dirname, "..", "..", "workspace");
+const WORKSPACE_ROOT = resolve(__dirname, "..", "", "workspace");
 
 /**

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:14:52
 /**
  * Resolve a path within the workspace, blocking traversal attacks
  */
-function resolvePath(relativePath: string): string {
-  const normalized = normalize(relativePath);
-
-  // Block absolute paths and traversal
-  if (normalized.startsWith("/") || normalized.startsWith("..") || normalized.includes("/../")) {
-    throw new Error(`Path traversal blocked: ${relativePath}`);
-  }
-
-  const fullPath = resolve(WORKSPACE_ROOT, normalized);
-
-  // Double-check the resolved path is within workspace
-  if (!fullPath.startsWith(WORKSPACE_ROOT)) {
-    throw new Error(`Path traversal blocked: ${relativePath}`);
-  }
-
-  return fullPath;
-}
+function resolvePath(relativePath: string): string {}
 
 /**

[NoCoverage] ConditionalExpression
src/sandbox/workspace.ts:18:7
   const normalized = normalize(relativePath);
 
   // Block absolute paths and traversal
-  if (normalized.startsWith("/") || normalized.startsWith("..") || normalized.includes("/../")) {
+  if (true) {
     throw new Error(`Path traversal blocked: ${relativePath}`);
   }

[NoCoverage] LogicalOperator
src/sandbox/workspace.ts:18:7
   const normalized = normalize(relativePath);
 
   // Block absolute paths and traversal
-  if (normalized.startsWith("/") || normalized.startsWith("..") || normalized.includes("/../")) {
+  if ((normalized.startsWith("/") || normalized.startsWith("..")) && normalized.includes("/../")) {
     throw new Error(`Path traversal blocked: ${relativePath}`);
   }

[NoCoverage] BooleanLiteral
src/sandbox/workspace.ts:25:7
   const fullPath = resolve(WORKSPACE_ROOT, normalized);
 
   // Double-check the resolved path is within workspace
-  if (!fullPath.startsWith(WORKSPACE_ROOT)) {
+  if (fullPath.startsWith(WORKSPACE_ROOT)) {
     throw new Error(`Path traversal blocked: ${relativePath}`);
   }

[NoCoverage] MethodExpression
src/sandbox/workspace.ts:25:8
   const fullPath = resolve(WORKSPACE_ROOT, normalized);
 
   // Double-check the resolved path is within workspace
-  if (!fullPath.startsWith(WORKSPACE_ROOT)) {
+  if (!fullPath.endsWith(WORKSPACE_ROOT)) {
     throw new Error(`Path traversal blocked: ${relativePath}`);
   }

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:39:7
 async function cleanupMcpResults(maxAgeMs = 3600000): Promise<number> {
   const dir = join(WORKSPACE_ROOT, MCP_RESULTS_DIR);
 
-  try {
-    const files = await readdir(dir);
-    const now = Date.now();
-    let deleted = 0;
-
-    for (const file of files) {
-      const filepath = join(dir, file);
-      const stats = await fsStat(filepath);
-
-      if (now - stats.mtimeMs > maxAgeMs) {
-        await unlink(filepath);
-        deleted++;
-      }
-    }
-
-    return deleted;
-  } catch (err) {
+  try {} catch (err) {
     // ENOENT is expected if directory doesn't exist yet
     if ((err as NodeJS.ErrnoException).code === "ENOENT") {

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:44:31
     const now = Date.now();
     let deleted = 0;
 
-    for (const file of files) {
-      const filepath = join(dir, file);
-      const stats = await fsStat(filepath);
-
-      if (now - stats.mtimeMs > maxAgeMs) {
-        await unlink(filepath);
-        deleted++;
-      }
-    }
+    for (const file of files) {}
 
     return deleted;

[NoCoverage] EqualityOperator
src/sandbox/workspace.ts:48:11
       const filepath = join(dir, file);
       const stats = await fsStat(filepath);
 
-      if (now - stats.mtimeMs > maxAgeMs) {
+      if (now - stats.mtimeMs >= maxAgeMs) {
         await unlink(filepath);
         deleted++;

[NoCoverage] ConditionalExpression
src/sandbox/workspace.ts:48:11
       const filepath = join(dir, file);
       const stats = await fsStat(filepath);
 
-      if (now - stats.mtimeMs > maxAgeMs) {
+      if (true) {
         await unlink(filepath);
         deleted++;

[NoCoverage] UpdateOperator
src/sandbox/workspace.ts:50:9
 
       if (now - stats.mtimeMs > maxAgeMs) {
         await unlink(filepath);
-        deleted++;
+        deleted--;
       }
     }

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:55:17
     }
 
     return deleted;
-  } catch (err) {
-    // ENOENT is expected if directory doesn't exist yet
-    if ((err as NodeJS.ErrnoException).code === "ENOENT") {
-      return 0;
-    }
-
-    // Log unexpected errors (permissions, disk full, etc.)
-    console.error("cleanupMcpResults failed:", err);
-    return 0;
-  }
+  } catch (err) {}
 }
 

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:57:59
     return deleted;
   } catch (err) {
     // ENOENT is expected if directory doesn't exist yet
-    if ((err as NodeJS.ErrnoException).code === "ENOENT") {
-      return 0;
-    }
+    if ((err as NodeJS.ErrnoException).code === "ENOENT") {}
 
     // Log unexpected errors (permissions, disk full, etc.)

[NoCoverage] ConditionalExpression
src/sandbox/workspace.ts:57:9
     return deleted;
   } catch (err) {
     // ENOENT is expected if directory doesn't exist yet
-    if ((err as NodeJS.ErrnoException).code === "ENOENT") {
+    if (false) {
       return 0;
     }

[NoCoverage] StringLiteral
src/sandbox/workspace.ts:62:19
     }
 
     // Log unexpected errors (permissions, disk full, etc.)
-    console.error("cleanupMcpResults failed:", err);
+    console.error("", err);
     return 0;
   }

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:72:45
  */
 export const workspace = {
   // Core operations
-  async read(path: string): Promise<string> {
-    const fullPath = resolvePath(path);
-    return readFile(fullPath, "utf-8");
-  },
+  async read(path: string): Promise<string> {},
 
   async write(path: string, data: string): Promise<void> {

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:77:58
     return readFile(fullPath, "utf-8");
   },
 
-  async write(path: string, data: string): Promise<void> {
-    const fullPath = resolvePath(path);
-    await writeFile(fullPath, data, "utf-8");
-  },
+  async write(path: string, data: string): Promise<void> {},
 
   async append(path: string, data: string): Promise<void> {

[NoCoverage] StringLiteral
src/sandbox/workspace.ts:79:37
 
   async write(path: string, data: string): Promise<void> {
     const fullPath = resolvePath(path);
-    await writeFile(fullPath, data, "utf-8");
+    await writeFile(fullPath, data, "");
   },
 

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:82:59
     await writeFile(fullPath, data, "utf-8");
   },
 
-  async append(path: string, data: string): Promise<void> {
-    const fullPath = resolvePath(path);
-    await appendFile(fullPath, data, "utf-8");
-  },
+  async append(path: string, data: string): Promise<void> {},
 
   async delete(path: string): Promise<void> {

[NoCoverage] StringLiteral
src/sandbox/workspace.ts:84:38
 
   async append(path: string, data: string): Promise<void> {
     const fullPath = resolvePath(path);
-    await appendFile(fullPath, data, "utf-8");
+    await appendFile(fullPath, data, "");
   },
 

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:87:45
     await appendFile(fullPath, data, "utf-8");
   },
 
-  async delete(path: string): Promise<void> {
-    const fullPath = resolvePath(path);
-    await unlink(fullPath);
-  },
+  async delete(path: string): Promise<void> {},
 
   // JSON operations

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:93:57
   },
 
   // JSON operations
-  async readJSON<T = unknown>(path: string): Promise<T> {
-    const content = await workspace.read(path);
-    return JSON.parse(content) as T;
-  },
+  async readJSON<T = unknown>(path: string): Promise<T> {},
 
   async writeJSON(path: string, data: unknown): Promise<void> {

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:98:63
     return JSON.parse(content) as T;
   },
 
-  async writeJSON(path: string, data: unknown): Promise<void> {
-    await workspace.write(path, JSON.stringify(data, null, 2));
-  },
+  async writeJSON(path: string, data: unknown): Promise<void> {},
 
   // Binary operations

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:103:51
   },
 
   // Binary operations
-  async readBuffer(path: string): Promise<Buffer> {
-    const fullPath = resolvePath(path);
-    return readFile(fullPath);
-  },
+  async readBuffer(path: string): Promise<Buffer> {},
 
   async writeBuffer(path: string, data: Buffer): Promise<void> {

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:108:64
     return readFile(fullPath);
   },
 
-  async writeBuffer(path: string, data: Buffer): Promise<void> {
-    const fullPath = resolvePath(path);
-    await writeFile(fullPath, data);
-  },
+  async writeBuffer(path: string, data: Buffer): Promise<void> {},
 
   // Directory operations

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:114:45
   },
 
   // Directory operations
-  async list(path = "."): Promise<string[]> {
-    const fullPath = resolvePath(path);
-    return readdir(fullPath);
-  },
+  async list(path = "."): Promise<string[]> {},
 
   async glob(pattern: string): Promise<string[]> {

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:119:50
     return readdir(fullPath);
   },
 
-  async glob(pattern: string): Promise<string[]> {
-    // Block dangerous patterns
-    if (pattern.includes("..")) {
-      throw new Error(`Glob traversal blocked: ${pattern}`);
-    }
-
-    const matches = await globFs(pattern, {
-      cwd: WORKSPACE_ROOT,
-      nodir: false,
-    });
-
-    return matches;
-  },
+  async glob(pattern: string): Promise<string[]> {},
 
   async mkdir(path: string): Promise<void> {

[NoCoverage] ConditionalExpression
src/sandbox/workspace.ts:121:9
 
   async glob(pattern: string): Promise<string[]> {
     // Block dangerous patterns
-    if (pattern.includes("..")) {
+    if (true) {
       throw new Error(`Glob traversal blocked: ${pattern}`);
     }

[NoCoverage] ConditionalExpression
src/sandbox/workspace.ts:121:9
 
   async glob(pattern: string): Promise<string[]> {
     // Block dangerous patterns
-    if (pattern.includes("..")) {
+    if (false) {
       throw new Error(`Glob traversal blocked: ${pattern}`);
     }

[NoCoverage] StringLiteral
src/sandbox/workspace.ts:122:23
   async glob(pattern: string): Promise<string[]> {
     // Block dangerous patterns
     if (pattern.includes("..")) {
-      throw new Error(`Glob traversal blocked: ${pattern}`);
+      throw new Error(``);
     }
 

[NoCoverage] BooleanLiteral
src/sandbox/workspace.ts:127:14
 
     const matches = await globFs(pattern, {
       cwd: WORKSPACE_ROOT,
-      nodir: false,
+      nodir: true,
     });
 

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:133:44
     return matches;
   },
 
-  async mkdir(path: string): Promise<void> {
-    const fullPath = resolvePath(path);
-    await fsMkdir(fullPath, { recursive: true });
-  },
+  async mkdir(path: string): Promise<void> {},
 
   async exists(path: string): Promise<boolean> {

[NoCoverage] BooleanLiteral
src/sandbox/workspace.ts:135:42
 
   async mkdir(path: string): Promise<void> {
     const fullPath = resolvePath(path);
-    await fsMkdir(fullPath, { recursive: true });
+    await fsMkdir(fullPath, { recursive: false });
   },
 

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:138:48
     await fsMkdir(fullPath, { recursive: true });
   },
 
-  async exists(path: string): Promise<boolean> {
-    try {
-      const fullPath = resolvePath(path);
-      await fsStat(fullPath);
-      return true;
-    } catch (err) {
-      // ENOENT means file doesn't exist - expected
-      if ((err as NodeJS.ErrnoException).code === "ENOENT") {
-        return false;
-      }
-
-      // Rethrow unexpected errors (permissions, etc.)
-      throw err;
-    }
-  },
+  async exists(path: string): Promise<boolean> {},
 
   // Metadata

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:139:9
   },
 
   async exists(path: string): Promise<boolean> {
-    try {
-      const fullPath = resolvePath(path);
-      await fsStat(fullPath);
-      return true;
-    } catch (err) {
+    try {} catch (err) {
       // ENOENT means file doesn't exist - expected
       if ((err as NodeJS.ErrnoException).code === "ENOENT") {

[NoCoverage] BooleanLiteral
src/sandbox/workspace.ts:142:14
     try {
       const fullPath = resolvePath(path);
       await fsStat(fullPath);
-      return true;
+      return false;
     } catch (err) {
       // ENOENT means file doesn't exist - expected

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:143:19
       const fullPath = resolvePath(path);
       await fsStat(fullPath);
       return true;
-    } catch (err) {
-      // ENOENT means file doesn't exist - expected
-      if ((err as NodeJS.ErrnoException).code === "ENOENT") {
-        return false;
-      }
-
-      // Rethrow unexpected errors (permissions, etc.)
-      throw err;
-    }
+    } catch (err) {}
   },
 

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:145:61
       return true;
     } catch (err) {
       // ENOENT means file doesn't exist - expected
-      if ((err as NodeJS.ErrnoException).code === "ENOENT") {
-        return false;
-      }
+      if ((err as NodeJS.ErrnoException).code === "ENOENT") {}
 
       // Rethrow unexpected errors (permissions, etc.)

[NoCoverage] ConditionalExpression
src/sandbox/workspace.ts:145:11
       return true;
     } catch (err) {
       // ENOENT means file doesn't exist - expected
-      if ((err as NodeJS.ErrnoException).code === "ENOENT") {
+      if (true) {
         return false;
       }

[NoCoverage] BooleanLiteral
src/sandbox/workspace.ts:146:16
     } catch (err) {
       // ENOENT means file doesn't exist - expected
       if ((err as NodeJS.ErrnoException).code === "ENOENT") {
-        return false;
+        return true;
       }
 

[NoCoverage] BlockStatement
src/sandbox/workspace.ts:155:84
   },
 
   // Metadata
-  async stat(path: string): Promise<{ size: number; mtime: Date; isDir: boolean }> {
-    const fullPath = resolvePath(path);
-    const stats = await fsStat(fullPath);
-    return {
-      size: stats.size,
-      mtime: stats.mtime,
-      isDir: stats.isDirectory(),
-    };
-  },
+  async stat(path: string): Promise<{ size: number; mtime: Date; isDir: boolean }> {},
 
   // MCP results management
