[Killed] BlockStatement
src/cli.ts:14:54
 const CLI_ROOT = resolve(dirname(fileURLToPath(import.meta.url)), "..");
 const packageJson = JSON.parse(readFileSync(resolve(CLI_ROOT, "package.json"), "utf-8")) as { version: string };
 
-function hasExecutable(pathToCheck: string): boolean {
-  try {
-    return statSync(pathToCheck).isFile();
-  } catch (_a) {
-    return false;
-  }
-}
+function hasExecutable(pathToCheck: string): boolean {}
 
 function isCommandAvailable(command: string): boolean {
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cli.ts:15:7
 const packageJson = JSON.parse(readFileSync(resolve(CLI_ROOT, "package.json"), "utf-8")) as { version: string };
 
 function hasExecutable(pathToCheck: string): boolean {
-  try {
-    return statSync(pathToCheck).isFile();
-  } catch (_a) {
+  try {} catch (_a) {
     return false;
   }
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cli.ts:17:16
 function hasExecutable(pathToCheck: string): boolean {
   try {
     return statSync(pathToCheck).isFile();
-  } catch (_a) {
-    return false;
-  }
+  } catch (_a) {}
 }
 
killedBy: cli helpers checks command availability for explicit paths and quoted PATH entries
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/cli.ts:18:12
   try {
     return statSync(pathToCheck).isFile();
   } catch (_a) {
-    return false;
+    return true;
   }
 }
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
src/cli.ts:23:31
 }
 
 function isCommandAvailable(command: string): boolean {
-  const commandHasExtension = process.platform === "win32" && Boolean(extname(command));
+  const commandHasExtension = true;
   const pathExtensions = process.platform === "win32" && !commandHasExtension
     ? (process.env.PATHEXT || ".COM;.EXE;.BAT;.CMD").split(";")

[Survived] ConditionalExpression
src/cli.ts:23:31
 }
 
 function isCommandAvailable(command: string): boolean {
-  const commandHasExtension = process.platform === "win32" && Boolean(extname(command));
+  const commandHasExtension = true && Boolean(extname(command));
   const pathExtensions = process.platform === "win32" && !commandHasExtension
     ? (process.env.PATHEXT || ".COM;.EXE;.BAT;.CMD").split(";")

[Killed] ConditionalExpression
src/cli.ts:24:26
 
 function isCommandAvailable(command: string): boolean {
   const commandHasExtension = process.platform === "win32" && Boolean(extname(command));
-  const pathExtensions = process.platform === "win32" && !commandHasExtension
+  const pathExtensions = true
     ? (process.env.PATHEXT || ".COM;.EXE;.BAT;.CMD").split(";")
     : [""];
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/cli.ts:24:26
 
 function isCommandAvailable(command: string): boolean {
   const commandHasExtension = process.platform === "win32" && Boolean(extname(command));
-  const pathExtensions = process.platform === "win32" && !commandHasExtension
+  const pathExtensions = true && !commandHasExtension
     ? (process.env.PATHEXT || ".COM;.EXE;.BAT;.CMD").split(";")
     : [""];
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected false to be true // Object.is equality

[NoCoverage] LogicalOperator
src/cli.ts:25:8
 function isCommandAvailable(command: string): boolean {
   const commandHasExtension = process.platform === "win32" && Boolean(extname(command));
   const pathExtensions = process.platform === "win32" && !commandHasExtension
-    ? (process.env.PATHEXT || ".COM;.EXE;.BAT;.CMD").split(";")
+    ? (process.env.PATHEXT && ".COM;.EXE;.BAT;.CMD").split(";")
     : [""];
   const pathDirs = (process.env.PATH || "").split(delimiter);

[NoCoverage] ConditionalExpression
src/cli.ts:25:8
 function isCommandAvailable(command: string): boolean {
   const commandHasExtension = process.platform === "win32" && Boolean(extname(command));
   const pathExtensions = process.platform === "win32" && !commandHasExtension
-    ? (process.env.PATHEXT || ".COM;.EXE;.BAT;.CMD").split(";")
+    ? (true).split(";")
     : [""];
   const pathDirs = (process.env.PATH || "").split(delimiter);

[Killed] ConditionalExpression
src/cli.ts:27:21
   const pathExtensions = process.platform === "win32" && !commandHasExtension
     ? (process.env.PATHEXT || ".COM;.EXE;.BAT;.CMD").split(";")
     : [""];
-  const pathDirs = (process.env.PATH || "").split(delimiter);
+  const pathDirs = (true).split(delimiter);
 
   if (isAbsolute(command) || command.includes("/") || command.includes("\\")) {
killedBy: cli helpers checks command availability via PATH lookup
statusReason: (intermediate value)(intermediate value)(intermediate value).split is not a function

[Killed] LogicalOperator
src/cli.ts:27:21
   const pathExtensions = process.platform === "win32" && !commandHasExtension
     ? (process.env.PATHEXT || ".COM;.EXE;.BAT;.CMD").split(";")
     : [""];
-  const pathDirs = (process.env.PATH || "").split(delimiter);
+  const pathDirs = (process.env.PATH && "").split(delimiter);
 
   if (isAbsolute(command) || command.includes("/") || command.includes("\\")) {
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/cli.ts:29:7
     : [""];
   const pathDirs = (process.env.PATH || "").split(delimiter);
 
-  if (isAbsolute(command) || command.includes("/") || command.includes("\\")) {
+  if (false) {
     return hasExecutable(command);
   }
killedBy: cli helpers checks command availability for explicit paths and quoted PATH entries
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/cli.ts:29:7
     : [""];
   const pathDirs = (process.env.PATH || "").split(delimiter);
 
-  if (isAbsolute(command) || command.includes("/") || command.includes("\\")) {
+  if (false || command.includes("\\")) {
     return hasExecutable(command);
   }
killedBy: cli helpers checks command availability for explicit paths and quoted PATH entries
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cli.ts:33:35
     return hasExecutable(command);
   }
 
-  for (const pathDir of pathDirs) {
-    const cleanDir = pathDir.replace(/^["']|["']$/g, "");
-    for (const ext of pathExtensions) {
-      if (!cleanDir) {
-        continue;
-      }
-
-      if (hasExecutable(join(cleanDir, `${command}${ext}`))) {
-        return true;
-      }
-    }
-  }
+  for (const pathDir of pathDirs) {}
 
   return false;
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/cli.ts:34:38
   }
 
   for (const pathDir of pathDirs) {
-    const cleanDir = pathDir.replace(/^["']|["']$/g, "");
+    const cleanDir = pathDir.replace(/^["']|[^"']$/g, "");
     for (const ext of pathExtensions) {
       if (!cleanDir) {
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected false to be true // Object.is equality

[Survived] Regex
src/cli.ts:34:38
   }
 
   for (const pathDir of pathDirs) {
-    const cleanDir = pathDir.replace(/^["']|["']$/g, "");
+    const cleanDir = pathDir.replace(/^["']|["']/g, "");
     for (const ext of pathExtensions) {
       if (!cleanDir) {

[Killed] BlockStatement
src/cli.ts:35:39
 
   for (const pathDir of pathDirs) {
     const cleanDir = pathDir.replace(/^["']|["']$/g, "");
-    for (const ext of pathExtensions) {
-      if (!cleanDir) {
-        continue;
-      }
-
-      if (hasExecutable(join(cleanDir, `${command}${ext}`))) {
-        return true;
-      }
-    }
+    for (const ext of pathExtensions) {}
   }
 
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/cli.ts:36:11
   for (const pathDir of pathDirs) {
     const cleanDir = pathDir.replace(/^["']|["']$/g, "");
     for (const ext of pathExtensions) {
-      if (!cleanDir) {
+      if (cleanDir) {
         continue;
       }
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/cli.ts:36:11
   for (const pathDir of pathDirs) {
     const cleanDir = pathDir.replace(/^["']|["']$/g, "");
     for (const ext of pathExtensions) {
-      if (!cleanDir) {
+      if (true) {
         continue;
       }
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/cli.ts:40:11
         continue;
       }
 
-      if (hasExecutable(join(cleanDir, `${command}${ext}`))) {
+      if (false) {
         return true;
       }
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cli.ts:40:62
         continue;
       }
 
-      if (hasExecutable(join(cleanDir, `${command}${ext}`))) {
-        return true;
-      }
+      if (hasExecutable(join(cleanDir, `${command}${ext}`))) {}
     }
   }
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/cli.ts:41:16
       }
 
       if (hasExecutable(join(cleanDir, `${command}${ext}`))) {
-        return true;
+        return false;
       }
     }
killedBy: cli helpers checks command availability via PATH lookup
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cli.ts:49:76
   return false;
 }
 
-function checkCommand(command: string, label: string, hint?: string): void {
-  const found = isCommandAvailable(command);
-  console.log(`${label}: ${found ? "✅ Found" : "⚠️ Not found"}${!found && hint ? ` (${hint})` : ""}`);
-}
+function checkCommand(command: string, label: string, hint?: string): void {}
 
 function checkConfiguredServers(): void {
killedBy: cli helpers prints check status with hint text
statusReason: expected "log" to be called with arguments: [ 'Node runtime: ✅ Found' ]

Number of calls: 0

[Killed] BooleanLiteral
src/cli.ts:51:65
 
 function checkCommand(command: string, label: string, hint?: string): void {
   const found = isCommandAvailable(command);
-  console.log(`${label}: ${found ? "✅ Found" : "⚠️ Not found"}${!found && hint ? ` (${hint})` : ""}`);
+  console.log(`${label}: ${found ? "✅ Found" : "⚠️ Not found"}${found && hint ? ` (${hint})` : ""}`);
 }
 
killedBy: cli helpers reports missing command with hint
statusReason: expected "log" to be called with arguments: [ StringContaining{…} ]

Received:

  1st log call:

  [
-   StringContaining "Missing binary: ⚠️ Not found (Run installer)",

[Killed] ConditionalExpression
src/cli.ts:51:65
 
 function checkCommand(command: string, label: string, hint?: string): void {
   const found = isCommandAvailable(command);
-  console.log(`${label}: ${found ? "✅ Found" : "⚠️ Not found"}${!found && hint ? ` (${hint})` : ""}`);
+  console.log(`${label}: ${found ? "✅ Found" : "⚠️ Not found"}${true ? ` (${hint})` : ""}`);
 }
 
killedBy: cli helpers prints check status with hint text
statusReason: expected "log" to be called with arguments: [ 'Node runtime: ✅ Found' ]

Received:

  1st log call:

  [
-   "Node runtime: ✅ Found",

[Killed] BlockStatement
src/cli.ts:54:41
   console.log(`${label}: ${found ? "✅ Found" : "⚠️ Not found"}${!found && hint ? ` (${hint})` : ""}`);
 }
 
-function checkConfiguredServers(): void {
-  for (const config of getServerConfigs()) {
-    checkCommand(config.command, `${config.displayName} (${config.name}) command`, "Ensure executable is available in PATH or set an explicit absolute command in config");
-  }
-}
+function checkConfiguredServers(): void {}
 
 function checkUvx(): void {
killedBy: cli helpers checks configured servers using mocked server list
statusReason: expected "log" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
src/cli.ts:55:44
 }
 
 function checkConfiguredServers(): void {
-  for (const config of getServerConfigs()) {
-    checkCommand(config.command, `${config.displayName} (${config.name}) command`, "Ensure executable is available in PATH or set an explicit absolute command in config");
-  }
+  for (const config of getServerConfigs()) {}
 }
 
killedBy: cli helpers checks configured servers using mocked server list
statusReason: expected "log" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Survived] BlockStatement
src/cli.ts:60:27
   }
 }
 
-function checkUvx(): void {
-  checkCommand("uvx", "uvx", "optional, needed for Python MCP servers");
-}
+function checkUvx(): void {}
 
 function checkConfig(): void {

[Killed] BlockStatement
src/cli.ts:64:30
   checkCommand("uvx", "uvx", "optional, needed for Python MCP servers");
 }
 
-function checkConfig(): void {
-  const configPath = findConfigFile(CLI_ROOT);
-  const found = configPath !== null;
-
-  console.log(`Config file: ${found ? "✅ Found" : "⚠️ Not found (using defaults)"}`);
-  if (found) {
-    console.log(`  - ${configPath}`);
-  }
-}
+function checkConfig(): void {}
 
 function checkRegistry(): boolean {
killedBy: cli helpers checks config detection result
statusReason: expected "log" to be called with arguments: [ 'Config file: ✅ Found' ]

Number of calls: 0

[Killed] ConditionalExpression
src/cli.ts:66:17
 
 function checkConfig(): void {
   const configPath = findConfigFile(CLI_ROOT);
-  const found = configPath !== null;
+  const found = false;
 
   console.log(`Config file: ${found ? "✅ Found" : "⚠️ Not found (using defaults)"}`);
killedBy: cli helpers checks config detection result
statusReason: expected "log" to be called with arguments: [ 'Config file: ✅ Found' ]

Received:

  1st log call:

  [
-   "Config file: ✅ Found",

[Killed] ConditionalExpression
src/cli.ts:66:17
 
 function checkConfig(): void {
   const configPath = findConfigFile(CLI_ROOT);
-  const found = configPath !== null;
+  const found = true;
 
   console.log(`Config file: ${found ? "✅ Found" : "⚠️ Not found (using defaults)"}`);
killedBy: cli helpers checks missing config detection result
statusReason: expected "log" to be called with arguments: [ Array(1) ]

Received:

  1st log call:

  [
-   "Config file: ⚠️ Not found (using defaults)",

[Killed] StringLiteral
src/cli.ts:68:15
   const configPath = findConfigFile(CLI_ROOT);
   const found = configPath !== null;
 
-  console.log(`Config file: ${found ? "✅ Found" : "⚠️ Not found (using defaults)"}`);
+  console.log(``);
   if (found) {
     console.log(`  - ${configPath}`);
killedBy: cli helpers checks config detection result
statusReason: expected "log" to be called with arguments: [ 'Config file: ✅ Found' ]

Received:

  1st log call:

  [
-   "Config file: ✅ Found",

[Killed] BlockStatement
src/cli.ts:69:14
   const found = configPath !== null;
 
   console.log(`Config file: ${found ? "✅ Found" : "⚠️ Not found (using defaults)"}`);
-  if (found) {
-    console.log(`  - ${configPath}`);
-  }
+  if (found) {}
 }
 
killedBy: cli helpers checks config detection result
statusReason: expected "log" to be called with arguments: [ Array(1) ]

Received:

  1st log call:

  [
-   "  - /tmp/tool-executor.config.json",

[Killed] ConditionalExpression
src/cli.ts:69:7
   const found = configPath !== null;
 
   console.log(`Config file: ${found ? "✅ Found" : "⚠️ Not found (using defaults)"}`);
-  if (found) {
+  if (true) {
     console.log(`  - ${configPath}`);
   }
killedBy: cli helpers checks missing config detection result
statusReason: expected "log" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/cli.ts:74:35
   }
 }
 
-function checkRegistry(): boolean {
-  return existsSync(resolve(CLI_ROOT, "registry"));
-}
+function checkRegistry(): boolean {}
 
 const program = new Command();
killedBy: cli helpers checks registry directory presence
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/cli.ts:88:23
 program
   .command("doctor")
   .description("Check environment and dependencies")
-  .action(async () => {
-    console.log("🔍 Checking environment...\n");
-
-    // Check Node version
-    const nodeVersion = process.version;
-    const nodeMajor = parseInt(nodeVersion.slice(1).split(".")[0]);
-    console.log(`Node.js: ${nodeVersion} ${nodeMajor >= 18 ? "✅" : "❌ (need 18+)"}`);
-
-    // Check for Python/uv (for uvx servers)
-    checkUvx();
-
-    // Check for config file
-    checkConfig();
-
-    // Check for registry
-    const registryExists = checkRegistry();
-    console.log(`Registry: ${registryExists ? "✅ Found" : "❌ Not found"}`);
-
-    checkConfiguredServers();
-
-    console.log("\n✨ Doctor complete");
-  });
+  .action(async () => {});
 
 program
killedBy: cli helpers runs the doctor command
statusReason: expected "log" to be called with arguments: [ '🔍 Checking environment...\n' ]

Number of calls: 0

[Survived] MethodExpression
src/cli.ts:93:32
 
     // Check Node version
     const nodeVersion = process.version;
-    const nodeMajor = parseInt(nodeVersion.slice(1).split(".")[0]);
+    const nodeMajor = parseInt(nodeVersion.split(".")[0]);
     console.log(`Node.js: ${nodeVersion} ${nodeMajor >= 18 ? "✅" : "❌ (need 18+)"}`);
 

[Survived] EqualityOperator
src/cli.ts:94:44
     // Check Node version
     const nodeVersion = process.version;
     const nodeMajor = parseInt(nodeVersion.slice(1).split(".")[0]);
-    console.log(`Node.js: ${nodeVersion} ${nodeMajor >= 18 ? "✅" : "❌ (need 18+)"}`);
+    console.log(`Node.js: ${nodeVersion} ${nodeMajor > 18 ? "✅" : "❌ (need 18+)"}`);
 
     // Check for Python/uv (for uvx servers)

[Survived] ConditionalExpression
src/cli.ts:94:44
     // Check Node version
     const nodeVersion = process.version;
     const nodeMajor = parseInt(nodeVersion.slice(1).split(".")[0]);
-    console.log(`Node.js: ${nodeVersion} ${nodeMajor >= 18 ? "✅" : "❌ (need 18+)"}`);
+    console.log(`Node.js: ${nodeVersion} ${false ? "✅" : "❌ (need 18+)"}`);
 
     // Check for Python/uv (for uvx servers)

[Killed] BlockStatement
src/cli.ts:114:23
 program
   .command("init")
   .description("Initialize a new tool-executor configuration")
-  .action(async () => {
-    const configPath = resolve(process.cwd(), "tool-executor.config.json");
-
-    if (existsSync(configPath)) {
-      console.log("⚠️ Config file already exists");
-      return;
-    }
-
-    const { writeFileSync } = await import("fs");
-    const defaultConfig = {
-      servers: [
-        {
-          name: "example",
-          displayName: "Example Server",
-          command: "npx",
-          args: ["-y", "example-mcp-server"],
-        },
-      ],
-    };
-
-    writeFileSync(configPath, JSON.stringify(defaultConfig, null, 2));
-    console.log("✅ Created tool-executor.config.json");
-    console.log("   Edit this file to add your MCP servers, then run: claudikins extract");
-  });
+  .action(async () => {});
 
 program
killedBy: cli helpers runs init command without overwriting an existing config
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/cli.ts:117:9
   .action(async () => {
     const configPath = resolve(process.cwd(), "tool-executor.config.json");
 
-    if (existsSync(configPath)) {
+    if (false) {
       console.log("⚠️ Config file already exists");
       return;
killedBy: cli helpers runs init command without overwriting an existing config
statusReason: expected "log" to be called with arguments: [ '⚠️ Config file already exists' ]

Received:

  1st log call:

  [
-   "⚠️ Config file already exists",

[Killed] ConditionalExpression
src/cli.ts:117:9
   .action(async () => {
     const configPath = resolve(process.cwd(), "tool-executor.config.json");
 
-    if (existsSync(configPath)) {
+    if (true) {
       console.log("⚠️ Config file already exists");
       return;
killedBy: cli helpers runs init command without overwriting an existing config
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/cli.ts:125:9
     const { writeFileSync } = await import("fs");
     const defaultConfig = {
       servers: [
-        {
-          name: "example",
-          displayName: "Example Server",
-          command: "npx",
-          args: ["-y", "example-mcp-server"],
-        },
+        {},
       ],
     };
killedBy: cli helpers runs init command without overwriting an existing config
statusReason: expected { servers: [ {} ] } to match object { servers: [ { …(4) } ] }

[Killed] ConditionalExpression
src/cli.ts:144:9
   .description("Extract tool schemas from MCP servers into registry")
   .option("-a, --all", "Extract from all configured servers")
   .action(async (options: { all?: boolean }) => {
-    if (!options.all) {
+    if (true) {
       console.log("Usage: claudikins extract --all");
       console.log("\nExtracts tool schemas from all configured MCP servers");
killedBy: cli helpers reports missing extract script when --all is requested outside the project
statusReason: promise resolved "Command{ _events: { …(1) }, …(45), …(2) }" instead of rejecting

[Timeout] BlockStatement
src/cli.ts:144:23
   .description("Extract tool schemas from MCP servers into registry")
   .option("-a, --all", "Extract from all configured servers")
   .action(async (options: { all?: boolean }) => {
-    if (!options.all) {
-      console.log("Usage: claudikins extract --all");
-      console.log("\nExtracts tool schemas from all configured MCP servers");
-      console.log("and generates YAML files in the registry/ directory.");
-      return;
-    }
+    if (!options.all) {}
 
     console.log("🔧 Extracting schemas from MCP servers...\n");

[Killed] StringLiteral
src/cli.ts:145:19
   .option("-a, --all", "Extract from all configured servers")
   .action(async (options: { all?: boolean }) => {
     if (!options.all) {
-      console.log("Usage: claudikins extract --all");
+      console.log("");
       console.log("\nExtracts tool schemas from all configured MCP servers");
       console.log("and generates YAML files in the registry/ directory.");
killedBy: cli helpers prints extract usage when --all is omitted
statusReason: expected "log" to be called with arguments: [ 'Usage: claudikins extract --all' ]

Received:

  1st log call:

  [
-   "Usage: claudikins extract --all",

[Killed] StringLiteral
src/cli.ts:147:19
     if (!options.all) {
       console.log("Usage: claudikins extract --all");
       console.log("\nExtracts tool schemas from all configured MCP servers");
-      console.log("and generates YAML files in the registry/ directory.");
+      console.log("");
       return;
     }
killedBy: cli helpers prints extract usage when --all is omitted
statusReason: expected "log" to be called with arguments: [ Array(1) ]

Received:

  1st log call:

  [
-   "and generates YAML files in the registry/ directory.",

[Killed] BlockStatement
src/cli.ts:155:34
 
     // Run the extract script via tsx
     const scriptPath = resolve(process.cwd(), "scripts/extract-schemas.ts");
-    if (!existsSync(scriptPath)) {
-      console.error("❌ Extract script not found at scripts/extract-schemas.ts");
-      console.error("   Make sure you're in the claudikins-tool-executor directory");
-      process.exit(1);
-    }
+    if (!existsSync(scriptPath)) {}
 
     try {
killedBy: cli helpers reports missing extract script when --all is requested outside the project
statusReason: expected "error" to be called with arguments: [ Array(1) ]

Received:

  1st error call:

  [
-   "❌ Extract script not found at scripts/extract-schemas.ts",

[Killed] BooleanLiteral
src/cli.ts:155:9
 
     // Run the extract script via tsx
     const scriptPath = resolve(process.cwd(), "scripts/extract-schemas.ts");
-    if (!existsSync(scriptPath)) {
+    if (existsSync(scriptPath)) {
       console.error("❌ Extract script not found at scripts/extract-schemas.ts");
       console.error("   Make sure you're in the claudikins-tool-executor directory");
killedBy: cli helpers reports missing extract script when --all is requested outside the project
statusReason: expected "error" to be called with arguments: [ Array(1) ]

Received:

  1st error call:

  [
-   "❌ Extract script not found at scripts/extract-schemas.ts",

[NoCoverage] BlockStatement
src/cli.ts:161:9
       process.exit(1);
     }
 
-    try {
-      execSync(`npx tsx ${scriptPath}`, { stdio: "inherit" });
-      console.log("\n✨ Extraction complete");
-    } catch (error) {
+    try {} catch (error) {
       console.error("\n❌ Extraction failed");
       process.exit(1);

[NoCoverage] BlockStatement
src/cli.ts:164:21
     try {
       execSync(`npx tsx ${scriptPath}`, { stdio: "inherit" });
       console.log("\n✨ Extraction complete");
-    } catch (error) {
-      console.error("\n❌ Extraction failed");
-      process.exit(1);
-    }
+    } catch (error) {}
   });
 

[NoCoverage] BlockStatement
src/cli.ts:170:57
     }
   });
 
-if (process.argv[1] === fileURLToPath(import.meta.url)) {
-  program.parse();
-}
+if (process.argv[1] === fileURLToPath(import.meta.url)) {}
 
 export {
