[Killed] BlockStatement
src/config.ts:35:47
 /**
  * Expand ${VAR} syntax in a string using process.env
  */
-function expandEnvVars(value: string): string {
-  return value.replace(/\$\{([^}]+)\}/g, (_, varName: string) => {
-    return process.env[varName] || "";
-  });
-}
+function expandEnvVars(value: string): string {}
 
 /**
killedBy: config loads config and expands environment variables
statusReason: expected null to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] BlockStatement
src/config.ts:36:66
  * Expand ${VAR} syntax in a string using process.env
  */
 function expandEnvVars(value: string): string {
-  return value.replace(/\$\{([^}]+)\}/g, (_, varName: string) => {
-    return process.env[varName] || "";
-  });
+  return value.replace(/\$\{([^}]+)\}/g, (_, varName: string) => {});
 }
 
killedBy: config loads config and expands environment variables
statusReason: expected { servers: [ { name: 'test', …(4) } ] } to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] LogicalOperator
src/config.ts:37:12
  */
 function expandEnvVars(value: string): string {
   return value.replace(/\$\{([^}]+)\}/g, (_, varName: string) => {
-    return process.env[varName] || "";
+    return process.env[varName] && "";
   });
 }
killedBy: config loads config and expands environment variables
statusReason: expected { servers: [ { name: 'test', …(4) } ] } to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] ConditionalExpression
src/config.ts:37:12
  */
 function expandEnvVars(value: string): string {
   return value.replace(/\$\{([^}]+)\}/g, (_, varName: string) => {
-    return process.env[varName] || "";
+    return false;
   });
 }
killedBy: config loads config and expands environment variables
statusReason: expected { servers: [ { name: 'test', …(4) } ] } to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] BlockStatement
src/config.ts:44:55
 /**
  * Recursively expand env vars in an object
  */
-function expandEnvVarsInObject(obj: unknown): unknown {
-  if (typeof obj === "string") {
-    return expandEnvVars(obj);
-  }
-
-  if (Array.isArray(obj)) {
-    return obj.map(expandEnvVarsInObject);
-  }
-
-  if (obj !== null && typeof obj === "object") {
-    const result: Record<string, unknown> = {};
-    for (const [key, value] of Object.entries(obj)) {
-      result[key] = expandEnvVarsInObject(value);
-    }
-    return result;
-  }
-
-  return obj;
-}
+function expandEnvVarsInObject(obj: unknown): unknown {}
 
 export function findConfigFile(startDir = resolve(__dirname, "..")): string | null {
killedBy: config loads config and expands environment variables
statusReason: expected null to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] BlockStatement
src/config.ts:45:32
  * Recursively expand env vars in an object
  */
 function expandEnvVarsInObject(obj: unknown): unknown {
-  if (typeof obj === "string") {
-    return expandEnvVars(obj);
-  }
+  if (typeof obj === "string") {}
 
   if (Array.isArray(obj)) {
killedBy: config loads config and expands environment variables
statusReason: expected { servers: [ { name: 'test', …(4) } ] } to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] EqualityOperator
src/config.ts:45:7
  * Recursively expand env vars in an object
  */
 function expandEnvVarsInObject(obj: unknown): unknown {
-  if (typeof obj === "string") {
+  if (typeof obj !== "string") {
     return expandEnvVars(obj);
   }
killedBy: config loads config and expands environment variables
statusReason: expected null to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] ConditionalExpression
src/config.ts:49:7
     return expandEnvVars(obj);
   }
 
-  if (Array.isArray(obj)) {
+  if (false) {
     return obj.map(expandEnvVarsInObject);
   }
killedBy: config loads config and expands environment variables
statusReason: expected null to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] ConditionalExpression
src/config.ts:49:7
     return expandEnvVars(obj);
   }
 
-  if (Array.isArray(obj)) {
+  if (true) {
     return obj.map(expandEnvVarsInObject);
   }
killedBy: config loads config and expands environment variables
statusReason: expected null to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] EqualityOperator
src/config.ts:53:23
     return obj.map(expandEnvVarsInObject);
   }
 
-  if (obj !== null && typeof obj === "object") {
+  if (obj !== null && typeof obj !== "object") {
     const result: Record<string, unknown> = {};
     for (const [key, value] of Object.entries(obj)) {
killedBy: config loads config and expands environment variables
statusReason: expected { servers: [ { name: 'test', …(4) } ] } to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] BlockStatement
src/config.ts:53:48
     return obj.map(expandEnvVarsInObject);
   }
 
-  if (obj !== null && typeof obj === "object") {
-    const result: Record<string, unknown> = {};
-    for (const [key, value] of Object.entries(obj)) {
-      result[key] = expandEnvVarsInObject(value);
-    }
-    return result;
-  }
+  if (obj !== null && typeof obj === "object") {}
 
   return obj;
killedBy: config loads config and expands environment variables
statusReason: expected { servers: [ { name: 'test', …(4) } ] } to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] BlockStatement
src/config.ts:55:53
 
   if (obj !== null && typeof obj === "object") {
     const result: Record<string, unknown> = {};
-    for (const [key, value] of Object.entries(obj)) {
-      result[key] = expandEnvVarsInObject(value);
-    }
+    for (const [key, value] of Object.entries(obj)) {}
     return result;
   }
killedBy: config loads config and expands environment variables
statusReason: expected null to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] BlockStatement
src/config.ts:64:84
   return obj;
 }
 
-export function findConfigFile(startDir = resolve(__dirname, "..")): string | null {
-  for (const filename of CONFIG_FILENAMES) {
-    const filepath = resolve(startDir, filename);
-    if (existsSync(filepath)) {
-      return filepath;
-    }
-  }
-  return null;
-}
+export function findConfigFile(startDir = resolve(__dirname, "..")): string | null {}
 
 export function loadConfig(configPath?: string): ToolExecutorConfig | null {
killedBy: config finds the first supported config filename in order
statusReason: expected undefined to be '/var/folders/q4/rmdc04vn45qcl4m6x3pp0…' // Object.is equality

[NoCoverage] StringLiteral
src/config.ts:64:62
   return obj;
 }
 
-export function findConfigFile(startDir = resolve(__dirname, "..")): string | null {
+export function findConfigFile(startDir = resolve(__dirname, "")): string | null {
   for (const filename of CONFIG_FILENAMES) {
     const filepath = resolve(startDir, filename);

[Killed] BlockStatement
src/config.ts:65:44
 }
 
 export function findConfigFile(startDir = resolve(__dirname, "..")): string | null {
-  for (const filename of CONFIG_FILENAMES) {
-    const filepath = resolve(startDir, filename);
-    if (existsSync(filepath)) {
-      return filepath;
-    }
-  }
+  for (const filename of CONFIG_FILENAMES) {}
   return null;
 }
killedBy: config finds the first supported config filename in order
statusReason: expected null to be '/var/folders/q4/rmdc04vn45qcl4m6x3pp0…' // Object.is equality

[Killed] ConditionalExpression
src/config.ts:67:9
 export function findConfigFile(startDir = resolve(__dirname, "..")): string | null {
   for (const filename of CONFIG_FILENAMES) {
     const filepath = resolve(startDir, filename);
-    if (existsSync(filepath)) {
+    if (true) {
       return filepath;
     }
killedBy: config returns null when no config file exists
statusReason: expected '/var/folders/q4/rmdc04vn45qcl4m6x3pp0…' to be null

[Killed] BlockStatement
src/config.ts:67:31
 export function findConfigFile(startDir = resolve(__dirname, "..")): string | null {
   for (const filename of CONFIG_FILENAMES) {
     const filepath = resolve(startDir, filename);
-    if (existsSync(filepath)) {
-      return filepath;
-    }
+    if (existsSync(filepath)) {}
   }
   return null;
killedBy: config finds the first supported config filename in order
statusReason: expected null to be '/var/folders/q4/rmdc04vn45qcl4m6x3pp0…' // Object.is equality

[Killed] BlockStatement
src/config.ts:74:76
   return null;
 }
 
-export function loadConfig(configPath?: string): ToolExecutorConfig | null {
-  const filepath = configPath || findConfigFile();
-  if (!filepath || !existsSync(filepath)) {
-    return null;
-  }
-
-  try {
-    const content = readFileSync(filepath, "utf-8");
-    const parsed = JSON.parse(content);
-    const expanded = expandEnvVarsInObject(parsed);
-    return ToolExecutorConfigSchema.parse(expanded);
-  } catch (error) {
-    console.error(`Failed to load config from ${filepath}:`, error);
-    return null;
-  }
-}
+export function loadConfig(configPath?: string): ToolExecutorConfig | null {}
 
killedBy: config returns null when no config file exists
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/config.ts:75:20
 }
 
 export function loadConfig(configPath?: string): ToolExecutorConfig | null {
-  const filepath = configPath || findConfigFile();
+  const filepath = false;
   if (!filepath || !existsSync(filepath)) {
     return null;
killedBy: config loads config and expands environment variables
statusReason: expected null to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] LogicalOperator
src/config.ts:75:20
 }
 
 export function loadConfig(configPath?: string): ToolExecutorConfig | null {
-  const filepath = configPath || findConfigFile();
+  const filepath = configPath && findConfigFile();
   if (!filepath || !existsSync(filepath)) {
     return null;
killedBy: config loads config and expands environment variables
statusReason: expected null to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] BooleanLiteral
src/config.ts:76:20
 
 export function loadConfig(configPath?: string): ToolExecutorConfig | null {
   const filepath = configPath || findConfigFile();
-  if (!filepath || !existsSync(filepath)) {
+  if (!filepath || existsSync(filepath)) {
     return null;
   }
killedBy: config loads config and expands environment variables
statusReason: expected null to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] BooleanLiteral
src/config.ts:76:7
 
 export function loadConfig(configPath?: string): ToolExecutorConfig | null {
   const filepath = configPath || findConfigFile();
-  if (!filepath || !existsSync(filepath)) {
+  if (filepath || !existsSync(filepath)) {
     return null;
   }
killedBy: config loads config and expands environment variables
statusReason: expected null to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] BlockStatement
src/config.ts:80:7
     return null;
   }
 
-  try {
-    const content = readFileSync(filepath, "utf-8");
-    const parsed = JSON.parse(content);
-    const expanded = expandEnvVarsInObject(parsed);
-    return ToolExecutorConfigSchema.parse(expanded);
-  } catch (error) {
+  try {} catch (error) {
     console.error(`Failed to load config from ${filepath}:`, error);
     return null;
killedBy: config loads config and expands environment variables
statusReason: expected undefined to deeply equal { servers: [ { name: 'test', …(4) } ] }

[Killed] BlockStatement
src/config.ts:85:19
     const parsed = JSON.parse(content);
     const expanded = expandEnvVarsInObject(parsed);
     return ToolExecutorConfigSchema.parse(expanded);
-  } catch (error) {
-    console.error(`Failed to load config from ${filepath}:`, error);
-    return null;
-  }
+  } catch (error) {}
 }
 
killedBy: config returns null when schema validation fails
statusReason: expected undefined to be null
