[Killed] BlockStatement
src/search.ts:53:60
 /**
  * Get or create the registry Serena client
  */
-async function getRegistrySerena(): Promise<Client | null> {
-  // Already connected
-  if (registrySerena) return registrySerena;
-
-  // Connection already in progress - wait for it
-  if (connectionPromise) {
-    return connectionPromise;
-  }
-
-  // Start new connection
-  connectionPromise = connectRegistrySerena();
-  try {
-    return await connectionPromise;
-  } finally {
-    connectionPromise = null;
-  }
-}
+async function getRegistrySerena(): Promise<Client | null> {}
 
 /**
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] ConditionalExpression
src/search.ts:55:7
  */
 async function getRegistrySerena(): Promise<Client | null> {
   // Already connected
-  if (registrySerena) return registrySerena;
+  if (true) return registrySerena;
 
   // Connection already in progress - wait for it
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Survived] ConditionalExpression
src/search.ts:55:7
  */
 async function getRegistrySerena(): Promise<Client | null> {
   // Already connected
-  if (registrySerena) return registrySerena;
+  if (false) return registrySerena;
 
   // Connection already in progress - wait for it

[Killed] ConditionalExpression
src/search.ts:58:7
   if (registrySerena) return registrySerena;
 
   // Connection already in progress - wait for it
-  if (connectionPromise) {
+  if (true) {
     return connectionPromise;
   }
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Survived] ConditionalExpression
src/search.ts:58:7
   if (registrySerena) return registrySerena;
 
   // Connection already in progress - wait for it
-  if (connectionPromise) {
+  if (false) {
     return connectionPromise;
   }

[Killed] BlockStatement
src/search.ts:64:7
 
   // Start new connection
   connectionPromise = connectRegistrySerena();
-  try {
-    return await connectionPromise;
-  } finally {
+  try {} finally {
     connectionPromise = null;
   }
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] BlockStatement
src/search.ts:66:13
   connectionPromise = connectRegistrySerena();
   try {
     return await connectionPromise;
-  } finally {
-    connectionPromise = null;
-  }
+  } finally {}
 }
 
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] BlockStatement
src/search.ts:74:64
 /**
  * Internal connection logic for registry Serena
  */
-async function connectRegistrySerena(): Promise<Client | null> {
-  try {
-    const client = new Client({ name: "claudikins-registry-search", version: "1.1.0" }, { capabilities: {} });
-    const transport = new StdioClientTransport({
-      command: "uvx",
-      args: ["--from", "git+https://github.com/oraios/serena", "serena", "start-mcp-server"],
-      env: process.env as Record<string, string>,
-    });
-
-    await client.connect(transport);
-
-    // Activate the registry project
-    await client.callTool({
-      name: "activate_project",
-      arguments: { project: REGISTRY_ROOT },
-    });
-
-    registrySerena = client;
-    console.error("Registry Serena connected and project activated");
-    return client;
-  } catch (error) {
-    console.error("Failed to connect registry Serena:", error);
-    return null;
-  }
-}
+async function connectRegistrySerena(): Promise<Client | null> {}
 
 /**
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] BlockStatement
src/search.ts:75:7
  * Internal connection logic for registry Serena
  */
 async function connectRegistrySerena(): Promise<Client | null> {
-  try {
-    const client = new Client({ name: "claudikins-registry-search", version: "1.1.0" }, { capabilities: {} });
-    const transport = new StdioClientTransport({
-      command: "uvx",
-      args: ["--from", "git+https://github.com/oraios/serena", "serena", "start-mcp-server"],
-      env: process.env as Record<string, string>,
-    });
-
-    await client.connect(transport);
-
-    // Activate the registry project
-    await client.callTool({
-      name: "activate_project",
-      arguments: { project: REGISTRY_ROOT },
-    });
-
-    registrySerena = client;
-    console.error("Registry Serena connected and project activated");
-    return client;
-  } catch (error) {
+  try {} catch (error) {
     console.error("Failed to connect registry Serena:", error);
     return null;
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Survived] ObjectLiteral
src/search.ts:76:31
  */
 async function connectRegistrySerena(): Promise<Client | null> {
   try {
-    const client = new Client({ name: "claudikins-registry-search", version: "1.1.0" }, { capabilities: {} });
+    const client = new Client({}, { capabilities: {} });
     const transport = new StdioClientTransport({
       command: "uvx",

[Survived] StringLiteral
src/search.ts:78:16
   try {
     const client = new Client({ name: "claudikins-registry-search", version: "1.1.0" }, { capabilities: {} });
     const transport = new StdioClientTransport({
-      command: "uvx",
+      command: "",
       args: ["--from", "git+https://github.com/oraios/serena", "serena", "start-mcp-server"],
       env: process.env as Record<string, string>,

[Survived] StringLiteral
src/search.ts:79:64
     const client = new Client({ name: "claudikins-registry-search", version: "1.1.0" }, { capabilities: {} });
     const transport = new StdioClientTransport({
       command: "uvx",
-      args: ["--from", "git+https://github.com/oraios/serena", "serena", "start-mcp-server"],
+      args: ["--from", "git+https://github.com/oraios/serena", "", "start-mcp-server"],
       env: process.env as Record<string, string>,
     });

[Survived] StringLiteral
src/search.ts:79:14
     const client = new Client({ name: "claudikins-registry-search", version: "1.1.0" }, { capabilities: {} });
     const transport = new StdioClientTransport({
       command: "uvx",
-      args: ["--from", "git+https://github.com/oraios/serena", "serena", "start-mcp-server"],
+      args: ["", "git+https://github.com/oraios/serena", "serena", "start-mcp-server"],
       env: process.env as Record<string, string>,
     });

[Survived] BlockStatement
src/search.ts:94:19
     registrySerena = client;
     console.error("Registry Serena connected and project activated");
     return client;
-  } catch (error) {
-    console.error("Failed to connect registry Serena:", error);
-    return null;
-  }
+  } catch (error) {}
 }
 

[Killed] BlockStatement
src/search.ts:103:92
 /**
  * Load a tool definition from a YAML file
  */
-export async function loadToolDefinition(filePath: string): Promise<ToolDefinition | null> {
-  try {
-    const content = await readFile(filePath, "utf-8");
-    const parsed = yaml.load(content) as ToolDefinition;
-
-    // Validate required fields
-    if (!parsed.name || !parsed.server || !parsed.description) {
-      console.error(`Invalid tool definition: ${filePath}`);
-      return null;
-    }
-
-    return parsed as ToolDefinition;
-  } catch (error) {
-    console.error(`Failed to load tool: ${filePath}`, error);
-    return null;
-  }
-}
+export async function loadToolDefinition(filePath: string): Promise<ToolDefinition | null> {}
 
 /**
killedBy: loadToolDefinition loads valid YAML tool definitions
statusReason: expected undefined to deeply equal { name: 'diagram-generator', …(5) }

[Killed] BlockStatement
src/search.ts:104:7
  * Load a tool definition from a YAML file
  */
 export async function loadToolDefinition(filePath: string): Promise<ToolDefinition | null> {
-  try {
-    const content = await readFile(filePath, "utf-8");
-    const parsed = yaml.load(content) as ToolDefinition;
-
-    // Validate required fields
-    if (!parsed.name || !parsed.server || !parsed.description) {
-      console.error(`Invalid tool definition: ${filePath}`);
-      return null;
-    }
-
-    return parsed as ToolDefinition;
-  } catch (error) {
+  try {} catch (error) {
     console.error(`Failed to load tool: ${filePath}`, error);
     return null;
killedBy: loadToolDefinition loads valid YAML tool definitions
statusReason: expected undefined to deeply equal { name: 'diagram-generator', …(5) }

[Killed] ConditionalExpression
src/search.ts:109:9
     const parsed = yaml.load(content) as ToolDefinition;
 
     // Validate required fields
-    if (!parsed.name || !parsed.server || !parsed.description) {
+    if (false) {
       console.error(`Invalid tool definition: ${filePath}`);
       return null;
killedBy: loadToolDefinition returns null for invalid definitions
statusReason: expected { name: 'diagram-generator', …(1) } to be null

[Killed] LogicalOperator
src/search.ts:109:9
     const parsed = yaml.load(content) as ToolDefinition;
 
     // Validate required fields
-    if (!parsed.name || !parsed.server || !parsed.description) {
+    if ((!parsed.name || !parsed.server) && !parsed.description) {
       console.error(`Invalid tool definition: ${filePath}`);
       return null;
killedBy: loadToolDefinition returns null for invalid definitions
statusReason: expected { name: 'diagram-generator', …(1) } to be null

[Killed] BlockStatement
src/search.ts:115:19
     }
 
     return parsed as ToolDefinition;
-  } catch (error) {
-    console.error(`Failed to load tool: ${filePath}`, error);
-    return null;
-  }
+  } catch (error) {}
 }
 
killedBy: loadToolDefinition returns null when file read fails
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/search.ts:127:9
 async function searchWithSerena(query: string, limit: number): Promise<SearchResult[] | null> {
   try {
     const serena = await getRegistrySerena();
-    if (!serena) {
+    if (true) {
       return null;
     }
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] BooleanLiteral
src/search.ts:127:9
 async function searchWithSerena(query: string, limit: number): Promise<SearchResult[] | null> {
   try {
     const serena = await getRegistrySerena();
-    if (!serena) {
+    if (serena) {
       return null;
     }
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] ArrowFunction
src/search.ts:136:12
     // This matches files containing ALL terms regardless of order
     const terms = query
       .split(/\s+/)
-      .map(term => term.replace(/[.*+?^${}()|[\]\\]/g, '\\$&')); // escape regex chars
+      .map(() => undefined); // escape regex chars
 
     // Use lookaheads so terms can appear in any order
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: expected 2nd "vi.fn()" call to have been called with [ Array(1) ]

[Killed] Regex
src/search.ts:136:33
     // This matches files containing ALL terms regardless of order
     const terms = query
       .split(/\s+/)
-      .map(term => term.replace(/[.*+?^${}()|[\]\\]/g, '\\$&')); // escape regex chars
+      .map(term => term.replace(/[^.*+?^${}()|[\]\\]/g, '\\$&')); // escape regex chars
 
     // Use lookaheads so terms can appear in any order
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: expected 2nd "vi.fn()" call to have been called with [ Array(1) ]

[Killed] EqualityOperator
src/search.ts:140:21
 
     // Use lookaheads so terms can appear in any order
     // Single term: just use it directly. Multiple terms: use lookaheads
-    const pattern = terms.length === 1
+    const pattern = terms.length !== 1
       ? terms[0]
       : terms.map(t => `(?=.*${t})`).join('') + '.*';
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: expected 2nd "vi.fn()" call to have been called with [ Array(1) ]

[Killed] ConditionalExpression
src/search.ts:140:21
 
     // Use lookaheads so terms can appear in any order
     // Single term: just use it directly. Multiple terms: use lookaheads
-    const pattern = terms.length === 1
+    const pattern = true
       ? terms[0]
       : terms.map(t => `(?=.*${t})`).join('') + '.*';
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: expected 2nd "vi.fn()" call to have been called with [ Array(1) ]

[Killed] ArrowFunction
src/search.ts:142:19
     // Single term: just use it directly. Multiple terms: use lookaheads
     const pattern = terms.length === 1
       ? terms[0]
-      : terms.map(t => `(?=.*${t})`).join('') + '.*';
+      : terms.map(() => undefined).join('') + '.*';
 
     // Use Serena's search_for_pattern to find matches in registry
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: expected 2nd "vi.fn()" call to have been called with [ Array(1) ]

[Killed] StringLiteral
src/search.ts:142:24
     // Single term: just use it directly. Multiple terms: use lookaheads
     const pattern = terms.length === 1
       ? terms[0]
-      : terms.map(t => `(?=.*${t})`).join('') + '.*';
+      : terms.map(t => ``).join('') + '.*';
 
     // Use Serena's search_for_pattern to find matches in registry
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: expected 2nd "vi.fn()" call to have been called with [ Array(1) ]

[Killed] BooleanLiteral
src/search.ts:156:28
       },
     }) as { content?: SerenaContentItem[] };
 
-    if (!result.content || !Array.isArray(result.content)) {
+    if (!result.content || Array.isArray(result.content)) {
       return null;
     }
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] ConditionalExpression
src/search.ts:156:9
       },
     }) as { content?: SerenaContentItem[] };
 
-    if (!result.content || !Array.isArray(result.content)) {
+    if (true) {
       return null;
     }
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] EqualityOperator
src/search.ts:165:11
     const seenFiles = new Set<string>();
 
     for (const item of result.content) {
-      if (item.type !== "text") continue;
+      if (item.type === "text") continue;
 
       // Extract file paths from Serena output (relative to registry root)
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] ConditionalExpression
src/search.ts:165:11
     const seenFiles = new Set<string>();
 
     for (const item of result.content) {
-      if (item.type !== "text") continue;
+      if (true) continue;
 
       // Extract file paths from Serena output (relative to registry root)
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] Regex
src/search.ts:172:38
 
       // Match paths like "ui/mermaid/generate_diagram.yaml", "knowledge/context7/query-docs.yaml", or
       // "reasoning/sequentialThinking/sequentialthinking.yaml"
-      const fileMatches = text.match(/[A-Za-z0-9_.-]+\/[A-Za-z0-9_.-]+\/[^\s:]+\.ya?ml/gi);
+      const fileMatches = text.match(/[A-Za-z0-9_.-]+\/[A-Za-z0-9_.-]+\/[\s:]+\.ya?ml/gi);
 
       if (fileMatches) {
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] Regex
src/search.ts:172:38
 
       // Match paths like "ui/mermaid/generate_diagram.yaml", "knowledge/context7/query-docs.yaml", or
       // "reasoning/sequentialThinking/sequentialthinking.yaml"
-      const fileMatches = text.match(/[A-Za-z0-9_.-]+\/[A-Za-z0-9_.-]+\/[^\s:]+\.ya?ml/gi);
+      const fileMatches = text.match(/[A-Za-z0-9_.-]+\/[A-Za-z0-9_.-]+\/[^\s:]\.ya?ml/gi);
 
       if (fileMatches) {
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] ConditionalExpression
src/search.ts:174:11
       // "reasoning/sequentialThinking/sequentialthinking.yaml"
       const fileMatches = text.match(/[A-Za-z0-9_.-]+\/[A-Za-z0-9_.-]+\/[^\s:]+\.ya?ml/gi);
 
-      if (fileMatches) {
+      if (true) {
         for (const match of fileMatches) {
           if (seenFiles.has(match)) continue;
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] ConditionalExpression
src/search.ts:174:11
       // "reasoning/sequentialThinking/sequentialthinking.yaml"
       const fileMatches = text.match(/[A-Za-z0-9_.-]+\/[A-Za-z0-9_.-]+\/[^\s:]+\.ya?ml/gi);
 
-      if (fileMatches) {
+      if (false) {
         for (const match of fileMatches) {
           if (seenFiles.has(match)) continue;
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] BlockStatement
src/search.ts:175:42
       const fileMatches = text.match(/[A-Za-z0-9_.-]+\/[A-Za-z0-9_.-]+\/[^\s:]+\.ya?ml/gi);
 
       if (fileMatches) {
-        for (const match of fileMatches) {
-          if (seenFiles.has(match)) continue;
-          seenFiles.add(match);
-
-          const fullPath = resolve(REGISTRY_ROOT, match);
-          const tool = await loadToolDefinition(fullPath);
-          if (tool) {
-            results.push({
-              tool,
-              score: 1.0, // Serena doesn't provide scores
-              matchContext: text.slice(0, 200),
-            });
-          }
-
-          if (results.length >= limit) break;
-        }
+        for (const match of fileMatches) {}
       }
     }
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] ConditionalExpression
src/search.ts:176:15
 
       if (fileMatches) {
         for (const match of fileMatches) {
-          if (seenFiles.has(match)) continue;
+          if (false) continue;
           seenFiles.add(match);
 
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: expected { results: [ { …(3) } ], …(2) } to match object { source: 'serena', …(2) }

[Killed] ConditionalExpression
src/search.ts:176:15
 
       if (fileMatches) {
         for (const match of fileMatches) {
-          if (seenFiles.has(match)) continue;
+          if (true) continue;
           seenFiles.add(match);
 
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] ConditionalExpression
src/search.ts:181:15
 
           const fullPath = resolve(REGISTRY_ROOT, match);
           const tool = await loadToolDefinition(fullPath);
-          if (tool) {
+          if (false) {
             results.push({
               tool,
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] BlockStatement
src/search.ts:181:21
 
           const fullPath = resolve(REGISTRY_ROOT, match);
           const tool = await loadToolDefinition(fullPath);
-          if (tool) {
-            results.push({
-              tool,
-              score: 1.0, // Serena doesn't provide scores
-              matchContext: text.slice(0, 200),
-            });
-          }
+          if (tool) {}
 
           if (results.length >= limit) break;
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Survived] MethodExpression
src/search.ts:185:29
             results.push({
               tool,
               score: 1.0, // Serena doesn't provide scores
-              matchContext: text.slice(0, 200),
+              matchContext: text,
             });
           }

[Killed] EqualityOperator
src/search.ts:189:15
             });
           }
 
-          if (results.length >= limit) break;
+          if (results.length > limit) break;
         }
       }
killedBy: searchTools paginates Serena results and stops loading at requested limit
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] EqualityOperator
src/search.ts:189:15
             });
           }
 
-          if (results.length >= limit) break;
+          if (results.length < limit) break;
         }
       }
killedBy: searchTools paginates Serena results and stops loading at requested limit
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[NoCoverage] BlockStatement
src/search.ts:195:19
     }
 
     return results;
-  } catch (error) {
-    console.error("Serena search failed:", error);
-    return null;
-  }
+  } catch (error) {}
 }
 

[Survived] BlockStatement
src/search.ts:204:58
 /**
  * Load all tools for BM25 indexing
  */
-async function loadAllTools(): Promise<ToolDefinition[]> {
-  const files = await glob("**/*.{yaml,yml}", {
-    cwd: REGISTRY_ROOT,
-    absolute: true,
-  });
-
-  const tools: ToolDefinition[] = [];
-  for (const file of files) {
-    const tool = await loadToolDefinition(file);
-    if (tool) tools.push(tool);
-  }
-  return tools;
-}
+async function loadAllTools(): Promise<ToolDefinition[]> {}
 
 /**

[Survived] StringLiteral
src/search.ts:205:28
  * Load all tools for BM25 indexing
  */
 async function loadAllTools(): Promise<ToolDefinition[]> {
-  const files = await glob("**/*.{yaml,yml}", {
+  const files = await glob("", {
     cwd: REGISTRY_ROOT,
     absolute: true,

[Survived] BooleanLiteral
src/search.ts:207:15
 async function loadAllTools(): Promise<ToolDefinition[]> {
   const files = await glob("**/*.{yaml,yml}", {
     cwd: REGISTRY_ROOT,
-    absolute: true,
+    absolute: false,
   });
 

[Survived] BlockStatement
src/search.ts:211:29
   });
 
   const tools: ToolDefinition[] = [];
-  for (const file of files) {
-    const tool = await loadToolDefinition(file);
-    if (tool) tools.push(tool);
-  }
+  for (const file of files) {}
   return tools;
 }

[Survived] ConditionalExpression
src/search.ts:213:9
   const tools: ToolDefinition[] = [];
   for (const file of files) {
     const tool = await loadToolDefinition(file);
-    if (tool) tools.push(tool);
+    if (false) tools.push(tool);
   }
   return tools;

[Survived] ConditionalExpression
src/search.ts:213:9
   const tools: ToolDefinition[] = [];
   for (const file of files) {
     const tool = await loadToolDefinition(file);
-    if (tool) tools.push(tool);
+    if (true) tools.push(tool);
   }
   return tools;

[Killed] BooleanLiteral
src/search.ts:223:7
  */
 async function searchLocally(query: string, limit: number): Promise<SearchResult[]> {
   // Try BM25 first (better ranking)
-  if (!isBM25Ready()) {
+  if (isBM25Ready()) {
     try {
       const allTools = await loadAllTools();
killedBy: searchTools uses BM25 local results before text scoring
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "**/*.{yaml,yml}",

[Killed] ConditionalExpression
src/search.ts:223:7
  */
 async function searchLocally(query: string, limit: number): Promise<SearchResult[]> {
   // Try BM25 first (better ranking)
-  if (!isBM25Ready()) {
+  if (true) {
     try {
       const allTools = await loadAllTools();
killedBy: searchTools uses BM25 local results before text scoring
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "**/*.{yaml,yml}",

[Survived] BlockStatement
src/search.ts:224:9
 async function searchLocally(query: string, limit: number): Promise<SearchResult[]> {
   // Try BM25 first (better ranking)
   if (!isBM25Ready()) {
-    try {
-      const allTools = await loadAllTools();
-      initBM25(allTools);
-      console.error(`BM25 index built with ${allTools.length} tools`);
-    } catch (error) {
+    try {} catch (error) {
       console.error("Failed to initialize BM25:", error);
     }

[Survived] StringLiteral
src/search.ts:227:21
     try {
       const allTools = await loadAllTools();
       initBM25(allTools);
-      console.error(`BM25 index built with ${allTools.length} tools`);
+      console.error(``);
     } catch (error) {
       console.error("Failed to initialize BM25:", error);

[NoCoverage] BlockStatement
src/search.ts:228:21
       const allTools = await loadAllTools();
       initBM25(allTools);
       console.error(`BM25 index built with ${allTools.length} tools`);
-    } catch (error) {
-      console.error("Failed to initialize BM25:", error);
-    }
+    } catch (error) {}
   }
 

[Killed] ConditionalExpression
src/search.ts:233:7
     }
   }
 
-  if (isBM25Ready()) {
+  if (false) {
     const bm25Results = searchBM25(query, limit);
     if (bm25Results.length > 0) {
killedBy: searchTools uses BM25 local results before text scoring
statusReason: files is not iterable

[Killed] BlockStatement
src/search.ts:233:22
     }
   }
 
-  if (isBM25Ready()) {
-    const bm25Results = searchBM25(query, limit);
-    if (bm25Results.length > 0) {
-      return bm25Results.map((tool, idx) => ({
-        tool,
-        score: 1 - (idx * 0.01), // Decreasing score for ranking
-      }));
-    }
-  }
+  if (isBM25Ready()) {}
 
   // Fall back to simple text matching
killedBy: searchTools uses BM25 local results before text scoring
statusReason: files is not iterable

[Killed] EqualityOperator
src/search.ts:235:9
 
   if (isBM25Ready()) {
     const bm25Results = searchBM25(query, limit);
-    if (bm25Results.length > 0) {
+    if (bm25Results.length <= 0) {
       return bm25Results.map((tool, idx) => ({
         tool,
killedBy: searchTools uses BM25 local results before text scoring
statusReason: files is not iterable

[Killed] ConditionalExpression
src/search.ts:235:9
 
   if (isBM25Ready()) {
     const bm25Results = searchBM25(query, limit);
-    if (bm25Results.length > 0) {
+    if (false) {
       return bm25Results.map((tool, idx) => ({
         tool,
killedBy: searchTools uses BM25 local results before text scoring
statusReason: files is not iterable

[Killed] ArrowFunction
src/search.ts:236:30
   if (isBM25Ready()) {
     const bm25Results = searchBM25(query, limit);
     if (bm25Results.length > 0) {
-      return bm25Results.map((tool, idx) => ({
-        tool,
-        score: 1 - (idx * 0.01), // Decreasing score for ranking
-      }));
+      return bm25Results.map(() => undefined);
     }
   }
killedBy: searchTools uses BM25 local results before text scoring
statusReason: expected [ undefined, undefined ] to deeply equal [ { tool: { …(6) }, score: 1 }, …(1) ]

[Killed] ObjectLiteral
src/search.ts:236:46
   if (isBM25Ready()) {
     const bm25Results = searchBM25(query, limit);
     if (bm25Results.length > 0) {
-      return bm25Results.map((tool, idx) => ({
-        tool,
-        score: 1 - (idx * 0.01), // Decreasing score for ranking
-      }));
+      return bm25Results.map((tool, idx) => ({}));
     }
   }
killedBy: searchTools uses BM25 local results before text scoring
statusReason: expected [ {}, {} ] to deeply equal [ { tool: { …(6) }, score: 1 }, …(1) ]

[Killed] ArithmeticOperator
src/search.ts:238:16
     if (bm25Results.length > 0) {
       return bm25Results.map((tool, idx) => ({
         tool,
-        score: 1 - (idx * 0.01), // Decreasing score for ranking
+        score: 1 + idx * 0.01, // Decreasing score for ranking
       }));
     }
killedBy: searchTools uses BM25 local results before text scoring
statusReason: expected [ { tool: { …(6) }, score: 1 }, …(1) ] to deeply equal [ { tool: { …(6) }, score: 1 }, …(1) ]

[Killed] ArithmeticOperator
src/search.ts:238:21
     if (bm25Results.length > 0) {
       return bm25Results.map((tool, idx) => ({
         tool,
-        score: 1 - (idx * 0.01), // Decreasing score for ranking
+        score: 1 - (idx / 0.01), // Decreasing score for ranking
       }));
     }
killedBy: searchTools uses BM25 local results before text scoring
statusReason: expected [ { tool: { …(6) }, score: 1 }, …(1) ] to deeply equal [ { tool: { …(6) }, score: 1 }, …(1) ]

[Killed] MethodExpression
src/search.ts:244:22
   }
 
   // Fall back to simple text matching
-  const queryLower = query.toLowerCase();
+  const queryLower = query.toUpperCase();
   const queryTerms = queryLower.split(/\s+/).filter(Boolean);
   const files = await glob("**/*.{yaml,yml}", {
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [] to have a length of 1 but got +0

[Survived] MethodExpression
src/search.ts:245:22
 
   // Fall back to simple text matching
   const queryLower = query.toLowerCase();
-  const queryTerms = queryLower.split(/\s+/).filter(Boolean);
+  const queryTerms = queryLower.split(/\s+/);
   const files = await glob("**/*.{yaml,yml}", {
     cwd: REGISTRY_ROOT,

[Killed] Regex
src/search.ts:245:39
 
   // Fall back to simple text matching
   const queryLower = query.toLowerCase();
-  const queryTerms = queryLower.split(/\s+/).filter(Boolean);
+  const queryTerms = queryLower.split(/\S+/).filter(Boolean);
   const files = await glob("**/*.{yaml,yml}", {
     cwd: REGISTRY_ROOT,
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [] to have a length of 1 but got +0
