[Killed] BlockStatement
src/search.ts:253:29
 
   const results: SearchResult[] = [];
 
-  for (const file of files) {
-    const tool = await loadToolDefinition(file);
-    if (!tool) continue;
-
-    // Score based on term matches
-    const searchText = `${tool.name} ${tool.description} ${tool.category || ""} ${tool.server}`.toLowerCase();
-    let score = 0;
-
-    for (const term of queryTerms) {
-      if (searchText.includes(term)) {
-        score += 1;
-        // Bonus for name/category match
-        if (tool.name.toLowerCase().includes(term)) score += 2;
-        if (tool.category?.toLowerCase().includes(term)) score += 1;
-      }
-    }
-
-    if (score > 0) {
-      results.push({
-        tool,
-        score: score / queryTerms.length,
-      });
-    }
-  }
+  for (const file of files) {}
 
   // Sort by score descending
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/search.ts:255:9
 
   for (const file of files) {
     const tool = await loadToolDefinition(file);
-    if (!tool) continue;
+    if (true) continue;
 
     // Score based on term matches
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/search.ts:255:9
 
   for (const file of files) {
     const tool = await loadToolDefinition(file);
-    if (!tool) continue;
+    if (tool) continue;
 
     // Score based on term matches
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
src/search.ts:258:24
     if (!tool) continue;
 
     // Score based on term matches
-    const searchText = `${tool.name} ${tool.description} ${tool.category || ""} ${tool.server}`.toLowerCase();
+    const searchText = `${tool.name} ${tool.description} ${tool.category || ""} ${tool.server}`.toUpperCase();
     let score = 0;
 
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [] to have a length of 1 but got +0

[Survived] ConditionalExpression
src/search.ts:258:60
     if (!tool) continue;
 
     // Score based on term matches
-    const searchText = `${tool.name} ${tool.description} ${tool.category || ""} ${tool.server}`.toLowerCase();
+    const searchText = `${tool.name} ${tool.description} ${true} ${tool.server}`.toLowerCase();
     let score = 0;
 

[Killed] BlockStatement
src/search.ts:261:36
     const searchText = `${tool.name} ${tool.description} ${tool.category || ""} ${tool.server}`.toLowerCase();
     let score = 0;
 
-    for (const term of queryTerms) {
-      if (searchText.includes(term)) {
-        score += 1;
-        // Bonus for name/category match
-        if (tool.name.toLowerCase().includes(term)) score += 2;
-        if (tool.category?.toLowerCase().includes(term)) score += 1;
-      }
-    }
+    for (const term of queryTerms) {}
 
     if (score > 0) {
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/search.ts:262:38
     let score = 0;
 
     for (const term of queryTerms) {
-      if (searchText.includes(term)) {
-        score += 1;
-        // Bonus for name/category match
-        if (tool.name.toLowerCase().includes(term)) score += 2;
-        if (tool.category?.toLowerCase().includes(term)) score += 1;
-      }
+      if (searchText.includes(term)) {}
     }
 
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/search.ts:262:11
     let score = 0;
 
     for (const term of queryTerms) {
-      if (searchText.includes(term)) {
+      if (true) {
         score += 1;
         // Bonus for name/category match
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [ { tool: { …(6) }, score: 3 }, …(1) ] to have a length of 1 but got 2

[Killed] AssignmentOperator
src/search.ts:263:9
 
     for (const term of queryTerms) {
       if (searchText.includes(term)) {
-        score += 1;
+        score -= 1;
         // Bonus for name/category match
         if (tool.name.toLowerCase().includes(term)) score += 2;
killedBy: searchTools sorts local text results and applies pagination
statusReason: expected { tool: { …(6) }, score: 1 } to match object { tool: { name: 'code-search' }, …(1) }

[Killed] ConditionalExpression
src/search.ts:265:13
       if (searchText.includes(term)) {
         score += 1;
         // Bonus for name/category match
-        if (tool.name.toLowerCase().includes(term)) score += 2;
+        if (false) score += 2;
         if (tool.category?.toLowerCase().includes(term)) score += 1;
       }
killedBy: searchTools sorts local text results and applies pagination
statusReason: expected { tool: { …(6) }, score: 1 } to match object { tool: { name: 'code-search' }, …(1) }

[Killed] MethodExpression
src/search.ts:265:13
       if (searchText.includes(term)) {
         score += 1;
         // Bonus for name/category match
-        if (tool.name.toLowerCase().includes(term)) score += 2;
+        if (tool.name.toUpperCase().includes(term)) score += 2;
         if (tool.category?.toLowerCase().includes(term)) score += 1;
       }
killedBy: searchTools sorts local text results and applies pagination
statusReason: expected { tool: { …(6) }, score: 1 } to match object { tool: { name: 'code-search' }, …(1) }

[Killed] ConditionalExpression
src/search.ts:266:13
         score += 1;
         // Bonus for name/category match
         if (tool.name.toLowerCase().includes(term)) score += 2;
-        if (tool.category?.toLowerCase().includes(term)) score += 1;
+        if (true) score += 1;
       }
     }
killedBy: searchTools sorts local text results and applies pagination
statusReason: expected { tool: { …(6) }, score: 2 } to match object { tool: { name: 'code-search' }, …(1) }
(5 matching properties omitted from actual)

[Killed] ConditionalExpression
src/search.ts:266:13
         score += 1;
         // Bonus for name/category match
         if (tool.name.toLowerCase().includes(term)) score += 2;
-        if (tool.category?.toLowerCase().includes(term)) score += 1;
+        if (false) score += 1;
       }
     }
killedBy: searchTools sorts local text results and applies pagination
statusReason: expected { tool: { …(6) }, score: 1.5 } to match object { tool: { name: 'code-search' }, …(1) }
(5 matching properties omitted from actual)

[Killed] BlockStatement
src/search.ts:270:20
       }
     }
 
-    if (score > 0) {
-      results.push({
-        tool,
-        score: score / queryTerms.length,
-      });
-    }
+    if (score > 0) {}
   }
 
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/search.ts:270:9
       }
     }
 
-    if (score > 0) {
+    if (true) {
       results.push({
         tool,
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [ { tool: { …(6) }, score: 3 }, …(1) ] to have a length of 1 but got 2

[Killed] ArithmeticOperator
src/search.ts:273:16
     if (score > 0) {
       results.push({
         tool,
-        score: score / queryTerms.length,
+        score: score * queryTerms.length,
       });
     }
killedBy: searchTools sorts local text results and applies pagination
statusReason: expected { tool: { …(6) }, score: 8 } to match object { tool: { name: 'code-search' }, …(1) }

[Killed] MethodExpression
src/search.ts:279:3
   }
 
   // Sort by score descending
-  results.sort((a, b) => b.score - a.score);
+  results;
   return results.slice(0, limit);
 }
killedBy: searchTools sorts local text results and applies pagination
statusReason: expected { tool: { …(6) }, score: 1.5 } to match object { tool: { name: 'code-search' }, …(1) }
(5 matching properties omitted from actual)

[Killed] ArrowFunction
src/search.ts:279:16
   }
 
   // Sort by score descending
-  results.sort((a, b) => b.score - a.score);
+  results.sort(() => undefined);
   return results.slice(0, limit);
 }
killedBy: searchTools sorts local text results and applies pagination
statusReason: expected { tool: { …(6) }, score: 1.5 } to match object { tool: { name: 'code-search' }, …(1) }
(5 matching properties omitted from actual)

[Survived] MethodExpression
src/search.ts:280:10
 
   // Sort by score descending
   results.sort((a, b) => b.score - a.score);
-  return results.slice(0, limit);
+  return results;
 }
 

[Killed] ArithmeticOperator
src/search.ts:288:22
  */
 export async function searchTools(query: string, limit = 10, offset = 0): Promise<SearchResponse> {
   // Request more results to support pagination
-  const fetchLimit = offset + limit;
+  const fetchLimit = offset - limit;
 
   // Try Serena first
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/search.ts:292:7
 
   // Try Serena first
   const serenaResults = await searchWithSerena(query, fetchLimit);
-  if (serenaResults && serenaResults.length > 0) {
+  if (false) {
     const paginatedResults = serenaResults.slice(offset, offset + limit);
     return {
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: files is not iterable

[Killed] LogicalOperator
src/search.ts:292:7
 
   // Try Serena first
   const serenaResults = await searchWithSerena(query, fetchLimit);
-  if (serenaResults && serenaResults.length > 0) {
+  if (serenaResults || serenaResults.length > 0) {
     const paginatedResults = serenaResults.slice(offset, offset + limit);
     return {
killedBy: searchTools uses local search when Serena is unavailable
statusReason: Cannot read properties of null (reading 'length')

[Killed] ArithmeticOperator
src/search.ts:293:58
   // Try Serena first
   const serenaResults = await searchWithSerena(query, fetchLimit);
   if (serenaResults && serenaResults.length > 0) {
-    const paginatedResults = serenaResults.slice(offset, offset + limit);
+    const paginatedResults = serenaResults.slice(offset, offset - limit);
     return {
       results: paginatedResults,
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: expected { results: [], source: 'serena', …(1) } to match object { source: 'serena', …(2) }

[Survived] MethodExpression
src/search.ts:293:30
   // Try Serena first
   const serenaResults = await searchWithSerena(query, fetchLimit);
   if (serenaResults && serenaResults.length > 0) {
-    const paginatedResults = serenaResults.slice(offset, offset + limit);
+    const paginatedResults = serenaResults;
     return {
       results: paginatedResults,

[Killed] StringLiteral
src/search.ts:296:15
     const paginatedResults = serenaResults.slice(offset, offset + limit);
     return {
       results: paginatedResults,
-      source: "serena",
+      source: "",
       totalCount: serenaResults.length,
     };
killedBy: searchTools returns Serena results when registry search succeeds
statusReason: expected { results: [ { …(3) } ], …(2) } to match object { source: 'serena', …(2) }

[Killed] ConditionalExpression
src/search.ts:303:26
 
   // Fall back to local search
   const localResults = await searchLocally(query, fetchLimit);
-  const fallbackReason = serenaResults === null
+  const fallbackReason = false
     ? "Serena unavailable - using text search"
     : "No semantic matches - using text search";
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected 'No semantic matches - using text sear…' to be 'Serena unavailable - using text search' // Object.is equality

[Killed] ConditionalExpression
src/search.ts:303:26
 
   // Fall back to local search
   const localResults = await searchLocally(query, fetchLimit);
-  const fallbackReason = serenaResults === null
+  const fallbackReason = true
     ? "Serena unavailable - using text search"
     : "No semantic matches - using text search";
killedBy: searchTools uses local search when Serena returns no content
statusReason: expected 'Serena unavailable - using text search' to be 'No semantic matches - using text sear…' // Object.is equality

[Killed] BlockStatement
src/search.ts:307:34
     ? "Serena unavailable - using text search"
     : "No semantic matches - using text search";
 
-  if (localResults.length === 0) {
-    return {
-      results: [],
-      source: "local",
-      totalCount: 0,
-      fallbackReason,
-      suggestion: "Try broader terms like 'image', 'code search', 'graph analysis', 'diagram', or browse categories: code-nav, graph-analysis, knowledge, ai-models, web, ui",
-    };
-  }
+  if (localResults.length === 0) {}
 
   const paginatedResults = localResults.slice(offset, offset + limit);
killedBy: searchTools returns suggestions when nothing local matches
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
src/search.ts:307:7
     ? "Serena unavailable - using text search"
     : "No semantic matches - using text search";
 
-  if (localResults.length === 0) {
+  if (localResults.length !== 0) {
     return {
       results: [],
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/search.ts:308:12
     : "No semantic matches - using text search";
 
   if (localResults.length === 0) {
-    return {
-      results: [],
-      source: "local",
-      totalCount: 0,
-      fallbackReason,
-      suggestion: "Try broader terms like 'image', 'code search', 'graph analysis', 'diagram', or browse categories: code-nav, graph-analysis, knowledge, ai-models, web, ui",
-    };
+    return {};
   }
 
killedBy: searchTools returns suggestions when nothing local matches
statusReason: expected undefined to be 'local' // Object.is equality

[Killed] MethodExpression
src/search.ts:317:28
     };
   }
 
-  const paginatedResults = localResults.slice(offset, offset + limit);
+  const paginatedResults = localResults;
   return {
     results: paginatedResults,
killedBy: searchTools paginates local text results after scoring
statusReason: expected [ { tool: { …(6) }, score: 2 }, …(1) ] to have a length of 1 but got 2

[Killed] ArithmeticOperator
src/search.ts:317:55
     };
   }
 
-  const paginatedResults = localResults.slice(offset, offset + limit);
+  const paginatedResults = localResults.slice(offset, offset - limit);
   return {
     results: paginatedResults,
killedBy: searchTools uses local search when Serena is unavailable
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/search.ts:329:58
 /**
  * Get all available categories in the registry
  */
-export async function getCategories(): Promise<string[]> {
-  const files = await glob("*/", {
-    cwd: REGISTRY_ROOT,
-  });
-
-  // Remove trailing slashes
-  return files.map((f) => f.replace(/\/$/, ""));
-}
+export async function getCategories(): Promise<string[]> {}
 
 /**
killedBy: search module helpers returns categories from registry root
statusReason: expected undefined to deeply equal [ 'ui', 'code-nav' ]

[Killed] StringLiteral
src/search.ts:330:28
  * Get all available categories in the registry
  */
 export async function getCategories(): Promise<string[]> {
-  const files = await glob("*/", {
+  const files = await glob("", {
     cwd: REGISTRY_ROOT,
   });
killedBy: search module helpers returns categories from registry root
statusReason: expected "vi.fn()" to be called with arguments: [ '*/', { cwd: StringContaining{…} } ]

Received:

  1st vi.fn() call:

  [
-   "*/",

[Killed] ObjectLiteral
src/search.ts:330:34
  * Get all available categories in the registry
  */
 export async function getCategories(): Promise<string[]> {
-  const files = await glob("*/", {
-    cwd: REGISTRY_ROOT,
-  });
+  const files = await glob("*/", {});
 
   // Remove trailing slashes
killedBy: search module helpers returns categories from registry root
statusReason: expected "vi.fn()" to be called with arguments: [ '*/', { cwd: StringContaining{…} } ]

Received:

  1st vi.fn() call:

  [
    "*/",

[Killed] ArrowFunction
src/search.ts:335:20
   });
 
   // Remove trailing slashes
-  return files.map((f) => f.replace(/\/$/, ""));
+  return files.map(() => undefined);
 }
 
killedBy: search module helpers returns categories from registry root
statusReason: expected [ undefined, undefined ] to deeply equal [ 'ui', 'code-nav' ]

[Survived] Regex
src/search.ts:335:37
   });
 
   // Remove trailing slashes
-  return files.map((f) => f.replace(/\/$/, ""));
+  return files.map((f) => f.replace(/\//, ""));
 }
 

[Killed] BlockStatement
src/search.ts:341:88
 /**
  * List all tools in a category
  */
-export async function listToolsInCategory(category: string): Promise<ToolDefinition[]> {
-  const categoryPath = resolve(REGISTRY_ROOT, category);
-  const files = await glob("**/*.{yaml,yml}", {
-    cwd: categoryPath,
-    absolute: true,
-  });
-
-  const tools: ToolDefinition[] = [];
-  for (const file of files) {
-    const tool = await loadToolDefinition(file);
-    if (tool) tools.push(tool);
-  }
-  return tools;
-}
+export async function listToolsInCategory(category: string): Promise<ToolDefinition[]> {}
 
 /**
killedBy: search module helpers lists tools in a category
statusReason: Target cannot be null or undefined.

[Killed] ObjectLiteral
src/search.ts:343:47
  */
 export async function listToolsInCategory(category: string): Promise<ToolDefinition[]> {
   const categoryPath = resolve(REGISTRY_ROOT, category);
-  const files = await glob("**/*.{yaml,yml}", {
-    cwd: categoryPath,
-    absolute: true,
-  });
+  const files = await glob("**/*.{yaml,yml}", {});
 
   const tools: ToolDefinition[] = [];
killedBy: search module helpers lists tools in a category
statusReason: expected "vi.fn()" to be called with arguments: [ '**/*.{yaml,yml}', …(1) ]

Received:

  1st vi.fn() call:

  [
    "**/*.{yaml,yml}",

[Killed] BooleanLiteral
src/search.ts:345:15
   const categoryPath = resolve(REGISTRY_ROOT, category);
   const files = await glob("**/*.{yaml,yml}", {
     cwd: categoryPath,
-    absolute: true,
+    absolute: false,
   });
 
killedBy: search module helpers lists tools in a category
statusReason: expected "vi.fn()" to be called with arguments: [ '**/*.{yaml,yml}', …(1) ]

Received:

  1st vi.fn() call:

  [
    "**/*.{yaml,yml}",

[Killed] ArrayDeclaration
src/search.ts:348:35
     absolute: true,
   });
 
-  const tools: ToolDefinition[] = [];
+  const tools: ToolDefinition[] = ["Stryker was here"];
   for (const file of files) {
     const tool = await loadToolDefinition(file);
killedBy: search module helpers lists tools in a category
statusReason: expected [ 'Stryker was here', { …(6) } ] to have a length of 1 but got 2

[Killed] BlockStatement
src/search.ts:359:87
 /**
  * Get a specific tool by name (for full schema retrieval)
  */
-export async function getToolByName(toolName: string): Promise<ToolDefinition | null> {
-  // Search all YAML files in registry
-  const files = await glob("**/*.{yaml,yml}", {
-    cwd: REGISTRY_ROOT,
-    absolute: true,
-  });
-
-  for (const file of files) {
-    const tool = await loadToolDefinition(file);
-    if (tool && tool.name === toolName) {
-      return tool;
-    }
-  }
-
-  return null;
-}
+export async function getToolByName(toolName: string): Promise<ToolDefinition | null> {}
 
 /**
killedBy: search module helpers gets a tool by name
statusReason: expected undefined to match object { name: 'code-search', …(1) }

[Killed] StringLiteral
src/search.ts:361:28
  */
 export async function getToolByName(toolName: string): Promise<ToolDefinition | null> {
   // Search all YAML files in registry
-  const files = await glob("**/*.{yaml,yml}", {
+  const files = await glob("", {
     cwd: REGISTRY_ROOT,
     absolute: true,
killedBy: search module helpers gets a tool by name
statusReason: expected "vi.fn()" to be called with arguments: [ '**/*.{yaml,yml}', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "**/*.{yaml,yml}",

[Killed] BlockStatement
src/search.ts:366:29
     absolute: true,
   });
 
-  for (const file of files) {
-    const tool = await loadToolDefinition(file);
-    if (tool && tool.name === toolName) {
-      return tool;
-    }
-  }
+  for (const file of files) {}
 
   return null;
killedBy: search module helpers gets a tool by name
statusReason: expected null to match object { name: 'code-search', …(1) }

[Killed] ConditionalExpression
src/search.ts:368:9
 
   for (const file of files) {
     const tool = await loadToolDefinition(file);
-    if (tool && tool.name === toolName) {
+    if (false) {
       return tool;
     }
killedBy: search module helpers gets a tool by name
statusReason: expected null to match object { name: 'code-search', …(1) }

[Killed] BlockStatement
src/search.ts:368:41
 
   for (const file of files) {
     const tool = await loadToolDefinition(file);
-    if (tool && tool.name === toolName) {
-      return tool;
-    }
+    if (tool && tool.name === toolName) {}
   }
 
killedBy: search module helpers gets a tool by name
statusReason: expected null to match object { name: 'code-search', …(1) }

[Killed] BlockStatement
src/search.ts:379:65
 /**
  * Disconnect the registry Serena client (for cleanup)
  */
-export async function disconnectRegistrySerena(): Promise<void> {
-  if (registrySerena) {
-    try {
-      await registrySerena.close();
-      console.error("Registry Serena disconnected");
-    } catch (error) {
-      console.error("Error disconnecting registry Serena:", error);
-    }
-    registrySerena = null;
-  }
-}
+export async function disconnectRegistrySerena(): Promise<void> {}
 
killedBy: searchTools paginates Serena results and stops loading at requested limit
statusReason: files is not iterable

[Killed] ConditionalExpression
src/search.ts:380:7
  * Disconnect the registry Serena client (for cleanup)
  */
 export async function disconnectRegistrySerena(): Promise<void> {
-  if (registrySerena) {
+  if (false) {
     try {
       await registrySerena.close();
killedBy: searchTools paginates Serena results and stops loading at requested limit
statusReason: files is not iterable

[Killed] BlockStatement
src/search.ts:380:23
  * Disconnect the registry Serena client (for cleanup)
  */
 export async function disconnectRegistrySerena(): Promise<void> {
-  if (registrySerena) {
-    try {
-      await registrySerena.close();
-      console.error("Registry Serena disconnected");
-    } catch (error) {
-      console.error("Error disconnecting registry Serena:", error);
-    }
-    registrySerena = null;
-  }
+  if (registrySerena) {}
 }
 
killedBy: searchTools paginates Serena results and stops loading at requested limit
statusReason: files is not iterable

[Survived] BlockStatement
src/search.ts:381:9
  */
 export async function disconnectRegistrySerena(): Promise<void> {
   if (registrySerena) {
-    try {
-      await registrySerena.close();
-      console.error("Registry Serena disconnected");
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error disconnecting registry Serena:", error);
     }

[NoCoverage] BlockStatement
src/search.ts:384:21
     try {
       await registrySerena.close();
       console.error("Registry Serena disconnected");
-    } catch (error) {
-      console.error("Error disconnecting registry Serena:", error);
-    }
+    } catch (error) {}
     registrySerena = null;
   }

[NoCoverage] StringLiteral
src/search.ts:385:21
       await registrySerena.close();
       console.error("Registry Serena disconnected");
     } catch (error) {
-      console.error("Error disconnecting registry Serena:", error);
+      console.error("", error);
     }
     registrySerena = null;
