[NoCoverage] BlockStatement
src/tools/execute.ts:15:4
     stack?: string;
   };
   isError: boolean;
-}> {
-  const result = await executeCode(params.code, params.timeout);
-
-  return {
-    content: [{ type: "text", text: JSON.stringify(result, null, 2) }],
-    structuredContent: { ...result },
-    isError: !!result.error,
-  };
-}
+}> {}
 

[NoCoverage] ArrayDeclaration
src/tools/execute.ts:19:14
   const result = await executeCode(params.code, params.timeout);
 
   return {
-    content: [{ type: "text", text: JSON.stringify(result, null, 2) }],
+    content: [],
     structuredContent: { ...result },
     isError: !!result.error,

[NoCoverage] BooleanLiteral
src/tools/execute.ts:21:15
   return {
     content: [{ type: "text", text: JSON.stringify(result, null, 2) }],
     structuredContent: { ...result },
-    isError: !!result.error,
+    isError: !result.error,
   };
 }
