[NoCoverage] ConditionalExpression
src/tools/schema.ts:28:7
 > {
   const tool = await getToolByName(params.name);
 
-  if (!tool) {
+  if (false) {
     return {
       content: [{

[NoCoverage] ConditionalExpression
src/tools/schema.ts:28:7
 > {
   const tool = await getToolByName(params.name);
 
-  if (!tool) {
+  if (true) {
     return {
       content: [{

[NoCoverage] StringLiteral
src/tools/schema.ts:31:15
   if (!tool) {
     return {
       content: [{
-        type: "text",
+        type: "",
         text: JSON.stringify({
           error: `Tool not found: ${params.name}`,

[NoCoverage] StringLiteral
src/tools/schema.ts:34:23
         type: "text",
         text: JSON.stringify({
           error: `Tool not found: ${params.name}`,
-          suggestion: "Use search_tools to find available tools first",
+          suggestion: "",
         }),
       }],

[NoCoverage] BooleanLiteral
src/tools/schema.ts:37:16
           suggestion: "Use search_tools to find available tools first",
         }),
       }],
-      isError: true,
+      isError: false,
     };
   }

[NoCoverage] ObjectLiteral
src/tools/schema.ts:51:15
   };
 
   return {
-    content: [{ type: "text", text: JSON.stringify(output, null, 2) }],
+    content: [{}],
     structuredContent: output,
   };

[NoCoverage] StringLiteral
src/tools/schema.ts:51:23
   };
 
   return {
-    content: [{ type: "text", text: JSON.stringify(output, null, 2) }],
+    content: [{ type: "", text: JSON.stringify(output, null, 2) }],
     structuredContent: output,
   };
