[NoCoverage] BlockStatement
src/tools/search.ts:5:41
 import type { SearchToolsInput } from "../schemas.js";
 
 /** First line only, max 80 chars */
-function oneLiner(text: string): string {
-  if (!text) return "";
-  const line = text.split("\n")[0].trim();
-  return line.length > 80 ? line.slice(0, 77) + "..." : line;
-}
+function oneLiner(text: string): string {}
 
 /**

[NoCoverage] BooleanLiteral
src/tools/search.ts:6:7
 
 /** First line only, max 80 chars */
 function oneLiner(text: string): string {
-  if (!text) return "";
+  if (text) return "";
   const line = text.split("\n")[0].trim();
   return line.length > 80 ? line.slice(0, 77) + "..." : line;

[NoCoverage] ConditionalExpression
src/tools/search.ts:6:7
 
 /** First line only, max 80 chars */
 function oneLiner(text: string): string {
-  if (!text) return "";
+  if (false) return "";
   const line = text.split("\n")[0].trim();
   return line.length > 80 ? line.slice(0, 77) + "..." : line;

[NoCoverage] MethodExpression
src/tools/search.ts:7:16
 /** First line only, max 80 chars */
 function oneLiner(text: string): string {
   if (!text) return "";
-  const line = text.split("\n")[0].trim();
+  const line = text.split("\n")[0];
   return line.length > 80 ? line.slice(0, 77) + "..." : line;
 }

[NoCoverage] MethodExpression
src/tools/search.ts:8:29
 function oneLiner(text: string): string {
   if (!text) return "";
   const line = text.split("\n")[0].trim();
-  return line.length > 80 ? line.slice(0, 77) + "..." : line;
+  return line.length > 80 ? line + "..." : line;
 }
 

[NoCoverage] EqualityOperator
src/tools/search.ts:8:10
 function oneLiner(text: string): string {
   if (!text) return "";
   const line = text.split("\n")[0].trim();
-  return line.length > 80 ? line.slice(0, 77) + "..." : line;
+  return line.length <= 80 ? line.slice(0, 77) + "..." : line;
 }
 

[NoCoverage] ObjectLiteral
src/tools/search.ts:35:18
 }> {
   const response = await searchTools(params.query, params.limit, params.offset);
 
-  const output = {
-    results: response.results.map((r) => ({
-      name: r.tool.name,
-      server: r.tool.server,
-      description: oneLiner(r.tool.description),
-    })),
-    // Pagination metadata (MCP best practice)
-    count: response.results.length,
-    limit: params.limit,
-    offset: params.offset,
-    totalCount: response.totalCount,
-    has_more: (params.offset + response.results.length) < (response.totalCount || 0),
-    // Source info
-    source: response.source,
-    ...(response.fallbackReason && { fallbackReason: response.fallbackReason }),
-    ...(response.suggestion && { suggestion: response.suggestion }),
-  };
+  const output = {};
 
   return {

[NoCoverage] ArrowFunction
src/tools/search.ts:36:35
   const response = await searchTools(params.query, params.limit, params.offset);
 
   const output = {
-    results: response.results.map((r) => ({
-      name: r.tool.name,
-      server: r.tool.server,
-      description: oneLiner(r.tool.description),
-    })),
+    results: response.results.map(() => undefined),
     // Pagination metadata (MCP best practice)
     count: response.results.length,

[NoCoverage] ConditionalExpression
src/tools/search.ts:46:60
     limit: params.limit,
     offset: params.offset,
     totalCount: response.totalCount,
-    has_more: (params.offset + response.results.length) < (response.totalCount || 0),
+    has_more: (params.offset + response.results.length) < (true),
     // Source info
     source: response.source,

[NoCoverage] ConditionalExpression
src/tools/search.ts:46:15
     limit: params.limit,
     offset: params.offset,
     totalCount: response.totalCount,
-    has_more: (params.offset + response.results.length) < (response.totalCount || 0),
+    has_more: true,
     // Source info
     source: response.source,

[NoCoverage] LogicalOperator
src/tools/search.ts:49:9
     has_more: (params.offset + response.results.length) < (response.totalCount || 0),
     // Source info
     source: response.source,
-    ...(response.fallbackReason && { fallbackReason: response.fallbackReason }),
+    ...(response.fallbackReason || {
+  fallbackReason: response.fallbackReason
+}),
     ...(response.suggestion && { suggestion: response.suggestion }),
   };

[NoCoverage] ConditionalExpression
src/tools/search.ts:49:9
     has_more: (params.offset + response.results.length) < (response.totalCount || 0),
     // Source info
     source: response.source,
-    ...(response.fallbackReason && { fallbackReason: response.fallbackReason }),
+    ...(false),
     ...(response.suggestion && { suggestion: response.suggestion }),
   };

[NoCoverage] ConditionalExpression
src/tools/search.ts:50:9
     // Source info
     source: response.source,
     ...(response.fallbackReason && { fallbackReason: response.fallbackReason }),
-    ...(response.suggestion && { suggestion: response.suggestion }),
+    ...(true),
   };
 

[NoCoverage] ConditionalExpression
src/tools/search.ts:50:9
     // Source info
     source: response.source,
     ...(response.fallbackReason && { fallbackReason: response.fallbackReason }),
-    ...(response.suggestion && { suggestion: response.suggestion }),
+    ...(false),
   };
 

[NoCoverage] ArrayDeclaration
src/tools/search.ts:54:14
   };
 
   return {
-    content: [{ type: "text", text: JSON.stringify(output, null, 2) }],
+    content: [],
     structuredContent: output,
   };
