[Survived] StringLiteral
src/index.ts:7:42
 
 // Load .env from module directory (not cwd) for plugin portability
 const __dirname = dirname(fileURLToPath(import.meta.url));
-dotenv.config({ path: resolve(__dirname, "..", ".env") });
+dotenv.config({ path: resolve(__dirname, "", ".env") });
 
 import { McpServer } from "@modelcontextprotocol/sdk/server/mcp.js";

[Killed] BooleanLiteral
src/index.ts:49:19
 - "fetch webpage" - HTTP fetch tools`,
   inputSchema: SearchToolsInputSchema,
   annotations: {
-    readOnlyHint: true,
+    readOnlyHint: false,
     destructiveHint: false,
     idempotentHint: true,
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected { title: 'Search MCP Tools', …(3) } to match object { title: 'Search MCP Tools', …(1) }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/index.ts:50:22
   inputSchema: SearchToolsInputSchema,
   annotations: {
     readOnlyHint: true,
-    destructiveHint: false,
+    destructiveHint: true,
     idempotentHint: true,
     openWorldHint: false,
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected { title: 'Search MCP Tools', …(3) } to match object { title: 'Search MCP Tools', …(1) }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/index.ts:51:21
   annotations: {
     readOnlyHint: true,
     destructiveHint: false,
-    idempotentHint: true,
+    idempotentHint: false,
     openWorldHint: false,
   },
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected { title: 'Search MCP Tools', …(3) } to match object { title: 'Search MCP Tools', …(1) }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/index.ts:52:20
     readOnlyHint: true,
     destructiveHint: false,
     idempotentHint: true,
-    openWorldHint: false,
+    openWorldHint: true,
   },
 }, handleSearchTools);
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected { title: 'Search MCP Tools', …(3) } to match object { title: 'Search MCP Tools', …(1) }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/index.ts:60:21
  * Tool: get_tool_schema
  * Get full inputSchema for a specific tool
  */
-server.registerTool("get_tool_schema", {
+server.registerTool("", {
   title: "Get Tool Schema",
   description: `Get the full inputSchema for a specific tool. Use after search_tools to get parameter details before calling execute_code.
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected [ 'search_tools', '', 'execute_code' ] to deeply equal [ 'search_tools', …(2) ]

[Killed] StringLiteral
src/index.ts:61:10
  * Get full inputSchema for a specific tool
  */
 server.registerTool("get_tool_schema", {
-  title: "Get Tool Schema",
+  title: "",
   description: `Get the full inputSchema for a specific tool. Use after search_tools to get parameter details before calling execute_code.
 
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected { title: '', …(3) } to match object { title: 'Get Tool Schema', …(1) }
(2 matching properties omitted from actual)

[Killed] ArrowFunction
src/index.ts:78:51
  * Tool: execute_code
  * Execute TypeScript/JavaScript code in sandbox
  */
-const clientList = getSandboxClientBindings().map((n) => `- ${n}`).join("\n");
+const clientList = getSandboxClientBindings().map(() => undefined).join("\n");
 
 server.registerTool("execute_code", {
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected 'Execute TypeScript/JavaScript code wi…' to contain '- serena'

[Killed] StringLiteral
src/index.ts:80:21
  */
 const clientList = getSandboxClientBindings().map((n) => `- ${n}`).join("\n");
 
-server.registerTool("execute_code", {
+server.registerTool("", {
   title: "Execute Code",
   description: `Execute TypeScript/JavaScript code with access to MCP clients and workspace.
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected [ 'search_tools', …(2) ] to deeply equal [ 'search_tools', …(2) ]

[Killed] ObjectLiteral
src/index.ts:117:16
 
 Results are summarised if console.log output exceeds ${MAX_LOG_CHARS} chars.`,
   inputSchema: ExecuteCodeInputSchema,
-  annotations: {
-    readOnlyHint: false,
-    destructiveHint: true,
-    idempotentHint: false,
-    openWorldHint: true,
-  },
+  annotations: {},
 }, handleExecuteCode as any);
 
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected { title: 'Execute Code', …(3) } to match object { title: 'Execute Code', …(1) }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/index.ts:118:19
 Results are summarised if console.log output exceeds ${MAX_LOG_CHARS} chars.`,
   inputSchema: ExecuteCodeInputSchema,
   annotations: {
-    readOnlyHint: false,
+    readOnlyHint: true,
     destructiveHint: true,
     idempotentHint: false,
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected { title: 'Execute Code', …(3) } to match object { title: 'Execute Code', …(1) }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/index.ts:119:22
   inputSchema: ExecuteCodeInputSchema,
   annotations: {
     readOnlyHint: false,
-    destructiveHint: true,
+    destructiveHint: false,
     idempotentHint: false,
     openWorldHint: true,
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected { title: 'Execute Code', …(3) } to match object { title: 'Execute Code', …(1) }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/index.ts:120:21
   annotations: {
     readOnlyHint: false,
     destructiveHint: true,
-    idempotentHint: false,
+    idempotentHint: true,
     openWorldHint: true,
   },
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected { title: 'Execute Code', …(3) } to match object { title: 'Execute Code', …(1) }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/index.ts:121:20
     readOnlyHint: false,
     destructiveHint: true,
     idempotentHint: false,
-    openWorldHint: true,
+    openWorldHint: false,
   },
 }, handleExecuteCode as any);
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected { title: 'Execute Code', …(3) } to match object { title: 'Execute Code', …(1) }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/index.ts:128:38
 /**
  * Main entry point
  */
-async function main(): Promise<void> {
-  startLifecycleManagement();
-
-  // Exit gracefully when client disconnects (prevents orphan processes)
-  process.stdin.on("close", () => {
-    console.error("Client disconnected, shutting down");
-    process.exit(0);
-  });
-
-  const transport = new StdioServerTransport();
-  await server.connect(transport);
-
-  console.error("Claudikins Tool Executor running");
-  console.error(`Available MCP clients: ${getAvailableClientNames().join(", ")}`);
-}
+async function main(): Promise<void> {}
 
 main().catch((error: unknown) => {
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/index.ts:132:35
   startLifecycleManagement();
 
   // Exit gracefully when client disconnects (prevents orphan processes)
-  process.stdin.on("close", () => {
-    console.error("Client disconnected, shutting down");
-    process.exit(0);
-  });
+  process.stdin.on("close", () => {});
 
   const transport = new StdioServerTransport();
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected "error" to be called with arguments: [ Array(1) ]

Received:

  1st error call:

  [
-   "Client disconnected, shutting down",

[Killed] StringLiteral
src/index.ts:140:17
   const transport = new StdioServerTransport();
   await server.connect(transport);
 
-  console.error("Claudikins Tool Executor running");
+  console.error("");
   console.error(`Available MCP clients: ${getAvailableClientNames().join(", ")}`);
 }
killedBy: index registers tools and starts server bootstrap on module load
statusReason: expected "error" to be called with arguments: [ 'Claudikins Tool Executor running' ]

Received:

  1st error call:

  [
-   "Claudikins Tool Executor running",

[Killed] BlockStatement
src/index.ts:144:34
   console.error(`Available MCP clients: ${getAvailableClientNames().join(", ")}`);
 }
 
-main().catch((error: unknown) => {
-  console.error("Fatal error:", error);
-  process.exit(1);
-});
+main().catch((error: unknown) => {});
 
killedBy: index reports fatal bootstrap errors
statusReason: expected "error" to be called with arguments: [ 'Fatal error:', …(1) ]

Number of calls: 0
